[{"binary":63,"binaryString":"111111","char":"䷀","id":1,"kanji":"乾","lowerBinaryString":"111","sameTrigram":true,"text":"Hexagram 1 is named 乾 (qián), \"Force\". Other variations include \"the creative\", \"strong action\", \"the key\", and \"god\". Its inner (lower) trigram is ☰ (乾 qián) force = (天) heaven, and its outer (upper) trigram is the same.","translation":"Force","unicode":19904,"upperBinaryString":"111","yomi":"qián","ichingTexts":{"text":{"cn":"乾：元亨，利貞。","en":"Qian (represents) what is great and originating, penetrating, advantageous, correct and firm."},"tuanZhuan":{"cn":"大哉乾元，萬物資始，乃統天。雲行雨施，品物流形。大明始終，六位時成，時乘六龍以御天。乾道變化，各正性命，保合大和，乃利貞。首出庶物，萬國咸寧。","en":"Vast is the 'great and originating (power)' indicated by Qian! All things owe to it their beginning: - it contains all the meaning belonging to (the name) heaven. The clouds move and the rain is distributed; the various things appear in their developed forms. (The sages) grandly understand (the connexion between) the end and the beginning, and how (the indications of) the six lines (in the hexagram) are accomplished, (each) in its season. (Accordingly) they mount (the carriage) drawn by those six dragons at the proper times, and drive through the sky. The method of Qian is to change and transform, so that everything obtains its correct nature as appointed (by the mind of Heaven); and (thereafter the conditions of) great harmony are preserved in union. The result is 'what is advantageous, and correct and firm. (The sage) appears aloft, high above all things, and the myriad states all enjoy repose."},"xiangZhuan":{"cn":"天行健，君子以自強不息。","en":"Heaven, in its motion, (gives the idea of) strength. The superior man, in accordance with this, nerves himself to ceaseless activity."},"commentaries":[{"number":1,"text":{"cn":"初九：潛龍，勿用。","en":"In the first (or lowest) NINE, undivided, (we see its subject as) the dragon lying hid (in the deep). It is not the time for active doing."},"xiangZhuan":{"cn":"潛龍勿用，陽在下也。","en":"'The dragon lies hid in the deep; - it is not the time for active doing:' - (this appears from) the strong and undivided line's being in the lowest place."}},{"number":2,"text":{"cn":"九二：見龍在田，利見大人。","en":"In the second NINE, undivided, (we see its subject as) the dragon appearing in the field. It will be advantageous to meet with the great man."},"xiangZhuan":{"cn":"見龍在田，德施普也。","en":"'The dragon appears in the field:' - the diffusion of virtuous influence has been wide."}},{"number":3,"text":{"cn":"九三：君子終日乾乾，夕惕若，厲，无咎。","en":"In the third NINE, undivided, (we see its subject as) the superior man active and vigilant all the day, and in the evening still careful and apprehensive. (The position is) dangerous, but there will be no mistake."},"xiangZhuan":{"cn":"終日乾乾，反復道也。","en":"'Active and vigilant all the day:' - (this refers to) the treading of the (proper) path over and over again."}},{"number":4,"text":{"cn":"九四：或躍在淵，无咎。","en":"In the fourth NINE, undivided, (we see its subject as the dragon looking) as if he were leaping up, but still in the deep. There will be no mistake."},"xiangZhuan":{"cn":"或躍在淵，進无咎也。","en":"'He seems to be leaping up, but is still in the deep:' - if he advance, there will be no error."}},{"number":5,"text":{"cn":"九五：飛龍在天，利見大人。","en":"In the fifth NINE, undivided, (we see its subject as) the dragon on the wing in the sky. It will be advantageous to meet with the great man."},"xiangZhuan":{"cn":"飛龍在天，大人造也。","en":"'The dragon is on the wing in the sky:' - the great man rouses himself to his work."}},{"number":6,"text":{"cn":"上九：亢龍有悔。","en":"In the sixth (or topmost) NINE, undivided, (we see its subject as) the dragon exceeding the proper limits. There will be occasion for repentance."},"xiangZhuan":{"cn":"亢龍有悔，盈不可久也。","en":"'The dragon exceeds the proper limits; - there will be occasion for repentance:' - a state of fulness, that is, should not be indulged in long."}},{"number":7,"text":{"cn":"用九：見群龍无首，吉。","en":"(The lines of this hexagram are all strong and undivided, as appears from) the use of the number NINE. If the host of dragons (thus) appearing were to divest themselves of their heads, there would be good fortune."},"xiangZhuan":{"cn":"用九，天德不可為首也。","en":"'The same NINE (undivided) is used' (in all the places of this hexagram), but the attribute of heaven (thereby denoted) should not (always) take the foremost place."}}]}},{"binary":0,"binaryString":"000000","char":"䷁","id":2,"kanji":"坤","lowerBinaryString":"000","sameTrigram":true,"text":"Hexagram 2 is named 坤 (kūn), \"Field\". Other variations include \"the receptive\", \"acquiescence\", and \"the flow\". Its inner (lower) trigram is ☷ (坤 kūn) field = (地) earth, and its outer (upper) trigram is identical.","translation":"Field","unicode":19905,"upperBinaryString":"000","yomi":"kūn","ichingTexts":{"text":{"cn":"坤：元亨，利牝馬之貞。君子有攸往，先迷後得主，利西南得朋，東北喪朋。安貞，吉。","en":"Kun (represents) what is great and originating, penetrating, advantageous, correct and having the firmness of a mare. When the superior man (here intended) has to make any movement, if he take the initiative, he will go astray; if he follow, he will find his (proper) lord. The advantageousness will be seen in his getting friends in the south-west, and losing friends in the north-east. If he rest in correctness and firmness, there will be good fortune."},"tuanZhuan":{"cn":"至哉坤元，萬物資生，乃順承天。坤厚載物，德合无疆。含弘光大，品物咸亨。牝馬地類，行地无疆，柔順利貞。君子攸行，先迷失道，後順得常。西南得朋，乃與類行；東北喪朋，乃終有慶。安貞之吉，應地无疆。","en":"Complete is the 'great and originating (capacity)' indicated by Kun! All things owe to it their birth; - it receives obediently the influences of Heaven. Kun, in its largeness, supports and contains all things. Its excellent capacity matches the unlimited power (of Qian). Its comprehension is wide, and its brightness great. The various things obtain (by it) their full development. The mare is a creature of earthly kind. Its (power of) moving on the earth is without limit; it is mild and docile, advantageous and firm: - such is the course of the superior man. 'If he take the initiative, he goes astray:' - he misses, that is, his proper course. 'If he follow,' he is docile, and gets into his regular (course). 'In the south-west he will get friends:' - he will be walking with those of his own class. 'In the north-east he will lose friends:' - but in the end there will be ground for congratulation. 'The good fortune arising from resting in firmness' corresponds to the unlimited capacity of the earth."},"xiangZhuan":{"cn":"地勢坤，君子以厚德載物。","en":"The (capacity and sustaining) power of the earth is what is denoted by Kun. The superior man, in accordance with this, with his large virtue supports (men and) things."},"commentaries":[{"number":1,"text":{"cn":"初六：履霜，堅冰至。","en":"In the first SIX, divided, (we see its subject) treading on hoarfrost. The strong ice will come (by and by)."},"xiangZhuan":{"cn":"履霜堅冰，陰始凝也。馴致其道，至堅冰也。","en":"'He is treading on hoarfrost; - the strong ice will come (by and by):' - the cold (air) has begun to take form. Allow it to go on quietly according to its nature, and (the hoarfrost) will come to strong ice."}},{"number":2,"text":{"cn":"六二：直，方，大，不習无不利。","en":"The second SIX, divided, (shows the attribute of) being straight, square, and great. (Its operation), without repeated efforts, will be in every respect advantageous."},"xiangZhuan":{"cn":"六二之動，直以方也。不習无不利，地道光也。","en":"The movement indicated by the second six, (divided),is 'from the straight (line) to the square.' '(Its operation), without repeated effort, in every way advantageous,' shows the brilliant result of the way of earth."}},{"number":3,"text":{"cn":"六三：含章可貞。或從王事，无成有終。","en":"The third SIX, divided, (shows its subject) keeping his excellence under restraint, but firmly maintaining it. If he should have occasion to engage in the king's service, though he will not claim the success (for himself), he will bring affairs to a good issue."},"xiangZhuan":{"cn":"含章可貞；以時發也。或從王事，知光大也。","en":"'He keeps his excellence tinder restraint, but firmly maintains it:' - at the proper time he will manifest it. 'He may have occasion to engage in the king's service: - great is the glory of his wisdom."}},{"number":4,"text":{"cn":"六四：括囊；无咎，无譽。","en":"The fourth SIX, divided, (shows the symbol of) a sack tied up. There will be no ground for blame or for praise."},"xiangZhuan":{"cn":"括囊无咎，慎不害也。","en":"'A sack tied up; - there will be no error:' - this shows how, through carefulness, no injury will be received."}},{"number":5,"text":{"cn":"六五：黃裳，元吉。","en":"The fifth SIX, divided, (shows) the yellow lower garment. There will be great good fortune."},"xiangZhuan":{"cn":"黃裳元吉，文在中也。","en":"S. 'The Yellow lower-garment; - there will be great good fortune:' - this follows from that ornamental (colour's) being in the right and central place."}},{"number":6,"text":{"cn":"上六：龍戰于野，其血玄黃。","en":"The sixth SIX, divided (shows) dragons fighting in the wild. Their blood is purple and yellow."},"xiangZhuan":{"cn":"戰龍於野，其道窮也。","en":"'The dragons fight in the wild: - the (onward) course (indicated by Kun) is pursued to extremity."}},{"number":7,"text":{"cn":"用六：利永貞。","en":"(The lines of this hexagram are all weak and divided, as appears from) the use of the number six. If those (who are thus represented) be perpetually correct and firm, advantage will arise."},"xiangZhuan":{"cn":"用六永貞，以大終也。","en":"'(The lines are all weak and divided, as appears from) the use of the number SIX: - but (those who are thus represented) becoming perpetually correct and firm, there will thereby be a great consummation."}}]}},{"binary":34,"binaryString":"100010","char":"䷂","id":3,"kanji":"屯","lowerBinaryString":"100","sameTrigram":false,"text":"Hexagram 3 is named 屯 (zhūn), \"Sprouting\". Other variations include \"difficulty at the beginning\", \"gathering support\", and \"hoarding\". Its inner (lower) trigram is ☳ (震 zhèn) shake = (雷) thunder, and its outer (upper) trigram is ☵ (坎 kǎn) gorge = (水) water.","translation":"Sprouting","unicode":19906,"upperBinaryString":"010","yomi":"zhūn","ichingTexts":{"text":{"cn":"屯：元亨，利貞，勿用有攸往，利建侯。","en":"Zhun (indicates that in the case which it presupposes) there will be great progress and success, and the advantage will come from being correct and firm. (But) any movement in advance should not be (lightly) undertaken. There will be advantage in appointing feudal princes."},"tuanZhuan":{"cn":"屯，剛柔始交而難生，動乎險中，大亨貞。雷雨之動滿盈，天造草昧，宜建侯而不寧。","en":"In Zhun we have the strong (Qian) and the weak (Kun) commencing their intercourse, and difficulties arising. Movement in the midst of peril gives rise to 'great progress and success, (through) firm correctness.' By the action of the thunder and rain, (which are symbols of Kan and Zhen), all (between heaven and earth) is filled up. But the condition of the time is full of irregularity and obscurity. Feudal princes should be established, but the feeling that rest and peace have been secured should not be indulged (even then)."},"xiangZhuan":{"cn":"雲，雷，屯；君子以經綸。","en":"(The trigram representing) clouds and (that representing) thunder form Zhun. The superior man, in accordance with this, (adjusts his measures of government) as in sorting the threads of the warp and woof."},"commentaries":[{"number":1,"text":{"cn":"初九：磐桓；利居貞，利建侯。","en":"The first NINE, undivided, shows the difficulty (its subject has) in advancing. It will be advantageous for him to abide correct and firm; advantageous (also) to be made a feudal ruler."},"xiangZhuan":{"cn":"雖磐桓，志行正也。以貴下賤，大得民也。","en":"Although 'there is a difficulty in advancing,' the mind (of the subject of the line) is set on doing what is correct. While noble, he humbles himself to the mean, and grandly gains the people."}},{"number":2,"text":{"cn":"六二：屯如邅如，乘馬班如。匪寇婚媾，女子貞不字，十年乃字。","en":"The second SIX, divided, shows (its subject) distressed and obliged to return; (even) the horses of her chariot (also) seem to be retreating. (But) not by a spoiler (is she assailed), but by one who seeks her to be his wife. The young lady maintains her firm correctness, and declines a union. After ten years she will be united, and have children."},"xiangZhuan":{"cn":"六二之難，乘剛也。十年乃字，反常也。","en":"The difficulty (to the subject of) the second six, (divided), arises from, its place over the undivided line below it. 'The union and children after ten years' shows things resuming their regular course."}},{"number":3,"text":{"cn":"六三：即鹿无虞，惟入于林中，君子幾不如舍，往吝。","en":"The third SIX, divided, shows one following the deer without (the guidance of) the forester, and only finding himself in the midst of the forest. The superior man, acquainted with the secret risks, thinks it better to give up the chase. If he went forward, he would regret it."},"xiangZhuan":{"cn":"即鹿无虞，以縱禽也。君子舍之，往吝窮也。","en":"'One pursues the deer without the (guidance of the) forester:' - (he does so) in (his eagerness to) follow the game. 'The superior man gives up the chase, (knowing that) if he go forward he will regret it:' - he would be reduced to extremity."}},{"number":4,"text":{"cn":"六四：乘馬班如，求婚媾，往吉，无不利。","en":"The fourth SIX, divided, shows (its subject as a lady), the horses of whose chariot appear in retreat. She seeks, however, (the help of) him who seeks her to be his wife. Advance will be fortunate; all will turn out advantageously."},"xiangZhuan":{"cn":"求而往，明也。","en":"'Going forward after such a search (for a helper)' shows intelligence."}},{"number":5,"text":{"cn":"九五：屯其膏，小貞吉，大貞凶。","en":"The fifth NINE, undivided, shows the difficulties in the way of (its subject's) dispensing the rich favours that might be expected from him. With firmness and correctness there will be good fortune in small things; (even) with them in great things there will be evil."},"xiangZhuan":{"cn":"屯其膏，施未光也。","en":"'Difficulty is experienced (by the subject of the fifth line) in bestowing his rich favours:' - the extent to which they reach will not yet be conspicuous."}},{"number":6,"text":{"cn":"上六：乘馬班如，泣血漣如。","en":"The topmost SIX, divided, shows (its subject) with the horses of his chariot obliged to retreat, and weeping tears of blood in streams."},"xiangZhuan":{"cn":"泣血漣如，何可長也。","en":"'He weeps tears of blood in streams:' - how can the state (thus emblemed) continue long?"}}]}},{"binary":17,"binaryString":"010001","char":"䷃","id":4,"kanji":"蒙","lowerBinaryString":"010","sameTrigram":false,"text":"Hexagram 4 is named 蒙 (méng), \"Enveloping\". Other variations include \"youthful folly\", \"the young shoot\", and \"discovering\". Its inner trigram is ☵ (坎 kǎn) gorge = (水) water. Its outer trigram is ☶ (艮 gèn) bound = (山) mountain.","translation":"Enveloping","unicode":19907,"upperBinaryString":"001","yomi":"méng","ichingTexts":{"text":{"cn":"蒙：亨。匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告。利貞。","en":"Meng (indicates that in the case which it presupposes) there will be progress and success. I do not (go and) seek the youthful and inexperienced, but he comes and seeks me. When he shows (the sincerity that marks) the first recourse to divination, I instruct him. If he apply a second and third time, that is troublesome; and I do not instruct the troublesome. There will be advantage in being firm and correct."},"tuanZhuan":{"cn":"蒙，山下有險，險而止，蒙。蒙亨，以亨行時中也。匪我求童蒙，童蒙求我，志應也。初噬告，以剛中也。再三瀆，瀆則不告，瀆蒙也。蒙以養正，聖功也。","en":"In Meng we have (the trigram for) a mountain, and below it that of a rugged defile with a stream in it. The conditions of peril and arrest of progress (suggested by these) give (the idea in) Meng. 'Meng indicates that there will be progress and success:' - for there is development at work in it, and its time of action is exactly what is right. 'I do not seek the youthful and inexperienced; he seeks me:' - so does will respond to will. 'When he shows (the sincerity that marks) the first recourse to divination, I instruct him:' - for possessing the qualities of the undivided line and being in the central place, (the subject of the second line thus speaks). 'A second and third application create annoyance, and I do not instruct so as to create annoyance:' - annoyance (he means) to the ignorant. (The method of dealing with) the young and ignorant is to nourish the correct (nature belonging to them); - this accomplishes the service of the sage."},"xiangZhuan":{"cn":"山下出泉，蒙；君子以果行育德。","en":"(The trigram representing) a mountain, and beneath it that for a spring issuing forth form Meng. The superior man, in accordance with this, strives to be resolute in his conduct and nourishes his virtue."},"commentaries":[{"number":1,"text":{"cn":"初六：發蒙，利用刑人，用說桎梏，以往吝。","en":"The first SIX, divided, (has respect to) the dispelling of ignorance. It will be advantageous to use punishment (for that purpose), and to remove the shackles (from the mind). But going on in that way (of punishment) will give occasion for regret."},"xiangZhuan":{"cn":"利用刑人，以正法也。","en":"'It will be advantageous to use punishment:' - the object being to bring under the influence of correcting law."}},{"number":2,"text":{"cn":"九二：包蒙吉；納婦吉；子克家。","en":"The second NINE, undivided, (shows its subject) exercising forbearance with the ignorant, in which there will be good fortune; and admitting (even the goodness of women, which will also be fortunate. (He may be described also as) a son able to (sustain the burden of) his family."},"xiangZhuan":{"cn":"子克家，剛柔接也。","en":"'A son able to (sustain the burden of) his family:' - as appears from the reciprocation between this strong line and the weak (fifth line)."}},{"number":3,"text":{"cn":"六三：勿用取女；見金夫，不有躬，无攸利。","en":"The third SIX, divided, (seems to say) that one should not marry a woman whose emblem it might be, for that, when she sees a man of wealth, she will not keep her person from him, and in no wise will advantage come from her."},"xiangZhuan":{"cn":"勿用取女，行不順也。","en":"'A woman (such as is here represented) should not be taken in marriage:' - her conduct is not agreeable to what is right."}},{"number":4,"text":{"cn":"六四：困蒙，吝。","en":"The fourth SIX, divided, (shows its subject as if) bound in chains of ignorance. There will be occasion for regret."},"xiangZhuan":{"cn":"困蒙之吝，獨遠實也。","en":"'The regret arising from ignorance bound in chains' is due to the special distance of (the subject of this line) from the solidity (shown in lines 2 and 6)."}},{"number":5,"text":{"cn":"六五：童蒙，吉。","en":"The fifth SIX, divided, shows its subject as a simple lad without experience. There will be good fortune."},"xiangZhuan":{"cn":"童蒙之吉，順以巽也。","en":"'The good fortune belonging to the simple lad without experience' comes from his docility going on to humility."}},{"number":6,"text":{"cn":"上九：擊蒙；不利為寇，利禦寇。","en":"In the topmost NINE, undivided, we see one smiting the ignorant (youth). But no advantage will come from doing him an injury. Advantage would come from warding off injury from him."},"xiangZhuan":{"cn":"利用禦寇，上下順也。","en":"'Advantage will come from warding off injury:' - (the subject of this line) above and (the ignorant) below, all do and are done to in accordance with their nature."}}]}},{"binary":58,"binaryString":"111010","char":"䷄","id":5,"kanji":"需","lowerBinaryString":"111","sameTrigram":false,"text":"Hexagram 5 is named 需 (xū), \"Attending\". Other variations include \"waiting\", \"moistened\", and \"arriving\". Its inner (lower) trigram is ☰ (乾 qián) force = (天) heaven, and its outer (upper) trigram is ☵ (坎 kǎn) gorge = (水) water.","translation":"Attending","unicode":19908,"upperBinaryString":"010","yomi":"xū","ichingTexts":{"text":{"cn":"需：有孚，光亨，貞吉。利涉大川。","en":"Xu intimates that, with the sincerity which is declared in it, there will be brilliant success. With firmness there will be good fortune; and it will be advantageous to cross the great stream."},"tuanZhuan":{"cn":"需，須也；險在前也。剛健而不陷，其義不困窮矣。需有孚，光亨，貞吉。位乎天位，以正中也。利涉大川，往有功也。","en":"Xu denotes waiting. (The figure) shows peril in front; but notwithstanding the firmness and strength (indicated by the inner trigram), its subject does not allow himself to be involved (in the dangerous defile); - it is right he should not be straitened or reduced to extremity. When it is said that, 'with the sincerity declared in Xu, there will be brilliant success, and with firmness there will be good fortune,' this is shown by the position (of the fifth line) in the place assigned by Heaven, and its being the correct position for it, and in the centre. 'It will be advantageous to go through the great stream;' - that is, going forward will be followed by meritorious achievement."},"xiangZhuan":{"cn":"雲上於天，需；君子以飲食宴樂。","en":"(The trigram for) clouds ascending over that for the sky forms Xu. The superior man, in accordance with this, eats and drinks, feasts and enjoys himself (as if there were nothing else to employ him)."},"commentaries":[{"number":1,"text":{"cn":"初九：需于郊。利用恆，无咎。","en":"The first NINE, undivided, shows its subject waiting in the distant border. It will be well for him constantly to maintain (the purpose thus shown), in which case there will be no error."},"xiangZhuan":{"cn":"需于郊，不犯難行也。利用恆，无咎；未失常也。","en":"'He is waiting in the (distant) border:' - he makes no movement to encounter rashly the difficulties (of the situation). 'It will be advantageous for him constantly to maintain (the purpose thus shown), in which case there will be no error:' - he will not fail to pursue that regular course."}},{"number":2,"text":{"cn":"九二：需于沙。小有言，終吉。","en":"The second NINE, undivided, shows its subject waiting on the sand (of the mountain stream). He will (suffer) the small (injury of) being spoken (against), but in the end there will be good fortune."},"xiangZhuan":{"cn":"需于沙，衍在中也。雖小有言，以終吉也。","en":"'He is waiting on the sand:' - he occupies his position in the centre with a generous forbearance. Though 'he suffer the small injury of being spoken (against),' he will bring things to a good issue."}},{"number":3,"text":{"cn":"九三：需于泥，致寇至。","en":"The third NINE, undivided, shows its subject in the mud (close by the stream). He thereby invites the approach of injury."},"xiangZhuan":{"cn":"需于泥，災在外也。自我致寇，敬慎不敗也。","en":"'He is waiting in the mud:' - calamity is (close at hand, and as it were) in the outer (trigram). 'He himself invites the approach of injury:' - if he be reverent and careful, he will not be worsted."}},{"number":4,"text":{"cn":"六四：需于血，出自穴。","en":"The fourth SIX, divided, shows its subject waiting in (the place of) blood. But he will get out of the cavern."},"xiangZhuan":{"cn":"需于血，順以聽也。","en":"'He is waiting in (the place of) blood:' - he accommodates himself (to the circumstances of the time), and hearkens to (its requirements)."}},{"number":5,"text":{"cn":"九五：需于酒食，貞吉。","en":"The fifth NINE, undivided, shows its subject waiting amidst the appliances of a feast. Through his firmness and correctness there will be good fortune."},"xiangZhuan":{"cn":"酒食貞吉，以中正也。","en":"'The appliances of a feast, and the good fortune through being firm and correct,' are indicated by (the position in) the central and correct place."}},{"number":6,"text":{"cn":"上六：入于穴，有不速之客三人來，敬之終吉。","en":"The topmost SIX, divided, shows its subject entered into the cavern. (But) there are three guests coming, without being urged, (to his help). If he receive them respectfully, there will be good fortune in the end."},"xiangZhuan":{"cn":"不速之客來，敬之終吉。雖不當位，未大失也。","en":"'Guests come unurged (to give their help), and if (the subject of the line) receive them respectfully, there will be good fortune in the end:' - though the occupant and the place are not suited to each other, there has been no great failure (in what has been done)."}}]}},{"binary":23,"binaryString":"010111","char":"䷅","id":6,"kanji":"訟","lowerBinaryString":"010","sameTrigram":false,"text":"Hexagram 6 is named 訟 (sòng), \"Arguing\". Other variations include \"conflict\" and \"lawsuit\". Its inner (lower) trigram is ☵ (坎 kǎn) gorge = (水) water, and its outer (upper) trigram is ☰ (乾 qián) force = (天) heaven.","translation":"Arguing","unicode":19909,"upperBinaryString":"111","yomi":"sòng","ichingTexts":{"text":{"cn":"訟：有孚，窒。惕中吉。終凶。利見大人，不利涉大川。","en":"Song intimates how, though there is sincerity in one's contention, he will yet meet with opposition and obstruction; but if he cherish an apprehensive caution, there will be good fortune, while, if he must prosecute the contention to the (bitter) end, there will be evil. It will be advantageous to see the great man; it will not be advantageous to cross the great stream."},"tuanZhuan":{"cn":"訟，上剛下險，險而健訟。訟有孚窒，惕中吉，剛來而得中也。終凶；訟不可成也。利見大人；尚中正也。不利涉大川；入于淵也。","en":"The upper portion of Song is (the trigram representing) strength, and the lower (that representing) peril. (The coming together of) strength and peril gives (the idea in) Song. 'Song intimates how, though there is sincerity in one's contention, he will yet meet with opposition and obstruction; but if he cherish an apprehensive caution, there will be good fortune:' - a strong (line) has come and got the central place (in the lower trigram).'If he must prosecute the contention to the (bitter) end, there will be evil:' - contention is not a thing to be carried on to extremity. 'It will be advantageous to meet with the great man:' - what he sets a value on is the due mean, and the correct place. 'It will not be advantageous to cross the great stream:' - one (attempting to do so) would find himself in an abyss."},"xiangZhuan":{"cn":"天與水違行，訟；君子以作事謀始。","en":"(The trigram representing) heaven and (that representing) water, moving away from each other, form Song. The superior man, in accordance with this, in the transaction of affairs takes good counsel about his first steps."},"commentaries":[{"number":1,"text":{"cn":"初六：不永所事，小有言，終吉。","en":"The first SIX, divided, shows its subject not perpetuating the matter about which (the contention is). He will suffer the small (injury) of being spoken against, but the end will be fortunate."},"xiangZhuan":{"cn":"不永所事，訟不可長也。雖有小言，其辯明也。","en":"'He does not perpetuate the matter about which (the contention is):' - contention should not be prolonged. Although 'he may suffer the small (injury) of being spoken against,' his argument is clear."}},{"number":2,"text":{"cn":"九二：不克訟，歸而逋，其邑人三百戶，无眚。","en":"The second NINE, undivided, shows its subject unequal to the contention. If he retire and keep concealed (where) the inhabitants of his city are (only) three hundred families, he will fall into no mistake."},"xiangZhuan":{"cn":"不克訟，歸而逋也。自下訟上，患至掇也。","en":"'He is unequal to the contention; he retires and keeps concealed, stealthily withdrawing from it:' - for him from his lower place to contend with (the stronger one) above, would be to (invite) calamity, as if he brought it with his hand to himself."}},{"number":3,"text":{"cn":"六三：食舊德，貞厲，終吉，或從王事，无成。","en":"The third SIX, divided, shows its subject keeping in the old place assigned for his support, and firmly correct. Perilous as the position is, there will be good fortune in the end. Should he perchance engage in the king's business, he will not (claim the merit of) achievement."},"xiangZhuan":{"cn":"食舊德，從上吉也。","en":"'He confines himself to the support assigned to him of old:' - (thus) following those above him, he will have good fortune."}},{"number":4,"text":{"cn":"九四：不克訟，復即命渝，安貞吉。","en":"The fourth NINE, undivided, shows its subject unequal to the contention. He returns to (the study of Heaven's) ordinances, changes (his wish to contend), and rests in being firm and correct. There will be good fortune."},"xiangZhuan":{"cn":"復即命，渝安貞；不失也。","en":"'He returns to (the study of Heaven's) ordinances, changes (his wish to contend), and rests in being firm and correct:' - he does not fail (in doing what is right)."}},{"number":5,"text":{"cn":"九五：訟元吉。","en":"S. The fifth NINE, undivided, shows its subject contending - and with great good fortune."},"xiangZhuan":{"cn":"訟元吉，以中正也。","en":"'He contends; - and 'with great fortune: - this is shown by his holding the due mean and being in the correct place."}},{"number":6,"text":{"cn":"上九：或錫之鞶帶，終朝三褫之。","en":"The topmost NINE, undivided, shows how its subject may have the leathern belt conferred on him (by the sovereign), and thrice it shall be taken from him in a morning."},"xiangZhuan":{"cn":"以訟受服，亦不足敬也。","en":"'He receives the robe through his contention:' - but still be is not deserving of respect."}}]}},{"binary":16,"binaryString":"010000","char":"䷆","id":7,"kanji":"師","lowerBinaryString":"010","sameTrigram":false,"text":"Hexagram 7 is named 師 (shī), \"Leading\". Other variations include \"the army\" and \"the troops\". Its inner (lower) trigram is ☵ (坎 kǎn) gorge = (水) water, and its outer (upper) trigram is ☷ (坤 kūn) field = (地) earth.","translation":"Leading","unicode":19910,"upperBinaryString":"000","yomi":"shī","ichingTexts":{"text":{"cn":"師：貞，丈人，吉无咎。","en":"Shi indicates how, in the case which it supposes, with firmness and correctness, and (a leader of) age and experience, there will be good fortune and no error."},"tuanZhuan":{"cn":"師，眾也，貞正也，能以眾正，可以王矣。剛中而應，行險而順，以此毒天下，而民從之，吉又何咎矣。","en":"(The name) Shi describes the multitude (of the host). The 'firmness and correctness' (which the hexagram indicates) refer to (moral) correctness (of aim). When (the mover) is able to use the multitude with such correctness, he may attain to the royal sway. There is (the symbol of) strength in the centre (of the trigram below), and it is responded to (by its proper correlate above). The action gives rise to perils, but is in accordance (with the best sentiments of men). (Its mover) may by such action distress all the country, but the people will follow him; - there will be good fortune, and what error should there be?"},"xiangZhuan":{"cn":"地中有水，師；君子以容民畜眾。","en":"(The trigram representing) the earth and in the midst of it that representing water, form Shi. The superior man, in accordance with this, nourishes and educates the people, and collects (from among them) the multitudes (of the hosts)."},"commentaries":[{"number":1,"text":{"cn":"初六：師出以律，否臧凶。","en":"The first SIX, divided, shows the host going forth according to the rules (for such a movement). If these be not good, there will be evil."},"xiangZhuan":{"cn":"師出以律，失律凶也。","en":"'The host goes forth according to the rules (for) such a movement:' - if those rules be not observed, there will be evil."}},{"number":2,"text":{"cn":"九二：在師中吉，无咎，王三錫命。","en":"The second NINE, undivided, shows (the leader) in the midst of the host. There will be good fortune and no error. The king has thrice conveyed to him the orders (of his favour)."},"xiangZhuan":{"cn":"在師中吉，承天寵也。王三錫命，懷萬邦也。","en":"'He is in the midst of the host, and there will be good fortune:' - he has received the favour of Heaven. 'The king has thrice conveyed to him the orders (of) his favour:' - (the king) cherishes the myriad regions in his heart."}},{"number":3,"text":{"cn":"六三：師或輿尸，凶。","en":"The third SIX, divided, shows how the host may, possibly, have many inefficient leaders. There will be evil."},"xiangZhuan":{"cn":"師或輿尸，大无功也。","en":"'The host with the possibility of its having many idle leaders:' - great will be its want of success."}},{"number":4,"text":{"cn":"六四：師左次，无咎。","en":"The fourth SIX, divided, shows the host in retreat. There is no error."},"xiangZhuan":{"cn":"左次无咎，未失常也。","en":"'The host is in retreat; but there is no error:' - there has been no failure in the regular course."}},{"number":5,"text":{"cn":"六五：田有禽，利執言，无咎。長子帥師，弟子輿尸，貞凶。","en":"The fifth SIX, divided, shows birds in the fields, which it will be advantageous to seize (and destroy). In that case there will be no error. If the oldest son leads the host, and younger men (idly occupy offices assigned to them), however firm and correct he may be, there will be evil."},"xiangZhuan":{"cn":"長子帥師，以中行也。弟子輿尸，使不當也。","en":"'The oldest son leads the host:' - its movements are directed by him in accordance with his position in the centre. 'Younger men idly occupy their positions:' - the employment of such men is improper."}},{"number":6,"text":{"cn":"上六：大君有命，開國承家，小人勿用。","en":"The topmost SIX, divided, shows the great ruler delivering his charges, (appointing some) to be rulers of states, and others to undertake the headship of clans; but small men should not be employed (in such positions)."},"xiangZhuan":{"cn":"大君有命，以正功也。小人勿用，必亂邦也。","en":"'The great ruler delivers his charges:' - thereby he rightly apportions merit. 'Small men should not be employed:' - they are sure to throw the states into confusion."}}]}},{"binary":2,"binaryString":"000010","char":"䷇","id":8,"kanji":"比","lowerBinaryString":"000","sameTrigram":false,"text":"Hexagram 8 is named 比 (bǐ), \"Grouping\". Other variations include \"holding together\" and \"alliance\". Its inner (lower) trigram is ☷ (坤 kūn) field = (地) earth, and its outer (upper) trigram is ☵ (坎 kǎn) gorge = (水) water.","translation":"Grouping","unicode":19911,"upperBinaryString":"010","yomi":"bǐ","ichingTexts":{"text":{"cn":"比：吉。原筮元永貞，无咎。不寧方來，後夫凶。","en":"Bi indicates that (under the conditions which it supposes) there is good fortune. But let (the principal party intended in it) re-examine himself, (as if) by divination, whether his virtue be great, unintermitting, and firm. If it be so, there will be no error. Those who have not rest will then come to him; and with those who are (too) late in coming it will be ill."},"tuanZhuan":{"cn":"比，吉也，比，輔也，下順從也。原筮元永貞，无咎，以剛中也。不寧方來，上下應也。後夫凶，其道窮也。","en":"'Bi indicates that there is good fortune:' - (the name) Bi denotes help; (and we see in the figure) inferiors docilely following (their superior). 'Let (the principal party intended in it) reexamine himself, (as if) by divination, whether his virtue be great, unintermitting, and firm; - if it be so, there will be no error: - all this follows from the position of the strong line in the centre (of the upper trigram). 'Those who have not rest will come to him:' - high and low will respond to its subject. 'With those who are (too) late in coming it will be ill:' - (for them) the way (of good fortune here indicated) has been exhausted."},"xiangZhuan":{"cn":"地上有水，比；先王以建萬國，親諸侯。","en":"(The trigram representing) the earth, and over it (that representing) water, form Bi. The ancient kings, in accordance with this, established the various states and maintained an affectionate relation to their princes."},"commentaries":[{"number":1,"text":{"cn":"初六：有孚，比之，无咎。有孚盈缶，終來有它吉。","en":"The first SIX, divided, shows its subject seeking by his sincerity to win the attachment of his object. There will be no error. Let (the breast) be full of sincerity as an earthenware vessel is of its contents, and it will in the end bring other advantages."},"xiangZhuan":{"cn":"比之初六，有他吉也。","en":"From 'the seeking union with its object' shown in the first SIX, (divided),there will be other advantages."}},{"number":2,"text":{"cn":"六二：比之自內，貞吉。","en":"In the second SIX, divided, we see the movement towards union and attachment proceeding from the inward (mind). With firm correctness there will be good fortune."},"xiangZhuan":{"cn":"比之自內，不自失也。","en":"'The movement towards union and attachment proceeds from the inward (mind):' - (the party concerned) does not fail in what is proper to himself"}},{"number":3,"text":{"cn":"六三：比之匪人。","en":"In the third SIX, divided, we see its subject seeking for union with such as ought not to be associated with."},"xiangZhuan":{"cn":"比之匪人，不亦傷乎！","en":"'Union is sought with such as ought not to be associated with:' - but will not injury be the result?"}},{"number":4,"text":{"cn":"六四：外比之，貞吉。","en":"In the fourth SIX, divided, we see its subject seeking for union with the one beyond himself. With firm correctness there will be good fortune."},"xiangZhuan":{"cn":"外比於賢，以從上也。","en":"'Union is sought (by the party intended here) with one beyond himself, and (in this case) with a worthy object:' - he is following (the ruler) above him."}},{"number":5,"text":{"cn":"九五：顯比，王用三驅，失前禽。邑人不誡，吉。","en":"The fifth NINE, undivided, affords the most illustrious instance of seeking union and attachment. (We seem to see in it) the king urging his pursuit of the game (only) in three directions, and allowing the escape of all the animals before him, while the people of his towns do not warn one another (to prevent it). There will be good fortune."},"xiangZhuan":{"cn":"顯比之吉，位正中也。舍逆取順，失前禽也。邑人不誡，上使中也。","en":"'The good fortune belonging to the most illustrious instance of seeking union and attachment' appears in the correct and central position (of the fifth line, undivided). (The king's) neglecting (the animals) confronting him (and then fleeing), and (only) taking those who present themselves as it were obediently, is seen in his allowing the escape of those in front of him.' 'That the people of his towns do not warn one another (to prevent such escape),' shows how he, in his high eminence, has made them pursue the due course."}},{"number":6,"text":{"cn":"上六：比之无首，凶。","en":"In the topmost SIX, divided, we see one seeking union and attachment without having taken the first step (to such an end). There will be evil."},"xiangZhuan":{"cn":"比之无首，无所終也。","en":"'He seeks union and attachment without taking the first (step to such an end):' - there is no possibility of a (good) issue."}}]}},{"binary":59,"binaryString":"111011","char":"䷈","id":9,"kanji":"小畜","lowerBinaryString":"111","sameTrigram":false,"text":"Hexagram 9 is named 小畜 (xiǎo xù), \"Small Accumulating\". Other variations include \"the taming power of the small\" and \"small harvest\". Its inner (lower) trigram is ☰ (乾 qián) force = (天) heaven, and its outer (upper) trigram is ☴ (巽 xùn) ground = (風) wind.","translation":"Small Accumulating","unicode":19912,"upperBinaryString":"011","yomi":"xiǎo xù","ichingTexts":{"text":{"cn":"小畜：亨。密雲不雨，自我西郊。","en":"Xiao Xu indicates that (under its conditions) there will be progress and success. (We see) dense clouds, but no rain coming from our borders in the west."},"tuanZhuan":{"cn":"小畜，柔得位，而上下應之，曰小畜。健而巽，剛中而志行，乃亨。密雲不雨，尚往也。自我西郊，施未行也。","en":"In Xiao Xu the weak line occupies its (proper) position, and (the lines) above and below respond to it. Hence comes the name of Xiao Xu (Small Restraint). (It presents the symbols of) strength and flexibility. Strong lines are in the central places, and the will (of their subjects) will have free course. Thus it indicates that there will be progress and success. 'Dense clouds but no rain' indicate the movement (of the strong lines) still going forward. The 'Commencing at our western border' indicates that the (beneficial) influence has not yet been widely displayed."},"xiangZhuan":{"cn":"風行天上，小畜；君子以懿文德。","en":"(The trigram representing) the sky, and that representing wind moving above it, form Xiao Xu The superior man, in accordance with this, adorns the outward manifestation of his virtue."},"commentaries":[{"number":1,"text":{"cn":"初九：復自道，何其咎，吉。","en":"The first NINE, undivided, shows its subject returning and pursuing his own course. What mistake should he fall into? There will be good fortune."},"xiangZhuan":{"cn":"復自道，其義吉也。","en":"'He returns and pursues his own path:' - it is right that there should be good fortune."}},{"number":2,"text":{"cn":"九二：牽復，吉。","en":"The second NINE, undivided, shows its subject, by the attraction (of the former line), returning (to the proper course). There will be good fortune."},"xiangZhuan":{"cn":"牽復在中，亦不自失也。","en":"'By the attraction (of the subject of the former line) he returns (to its own course),' and is in the central place: - neither will he err in what is due from him."}},{"number":3,"text":{"cn":"九三：輿說輻，夫妻反目。","en":"The third NINE, undivided, suggests the idea of a carriage, the strap beneath which has been removed, or of a husband and wife looking on each other with averted eyes."},"xiangZhuan":{"cn":"夫妻反目，不能正室也。","en":"'Husband and wife look on each other with averted eyes:' - (the subject of line three is like a husband who) cannot maintain correctly his relations with his wife."}},{"number":4,"text":{"cn":"六四：有孚，血去惕出，无咎。","en":"The fourth SIX, divided, shows its subject possessed of sincerity. The danger of bloodshed is thereby averted, and his (ground for) apprehension dismissed. There will be no mistake."},"xiangZhuan":{"cn":"有孚惕出，上合志也。","en":"'He is possessed of sincerity; his (ground for) apprehension is dismissed:' - (the subjects of the lines) above agree in aim with him."}},{"number":5,"text":{"cn":"九五：有孚攣如，富以其鄰。","en":"The fifth NINE, undivided, shows its subject possessed of sincerity, and drawing others to unite with him. Rich in resources, he employs his neighbours (in the same cause with himself)."},"xiangZhuan":{"cn":"有孚攣如，不獨富也。","en":"'He is possessed of sincerity, and draws others to unite with him:' - he does not use only his own rich resources."}},{"number":6,"text":{"cn":"上九：既雨既處，尚德載，婦貞厲。月幾望，君子征凶。","en":"The topmost NINE, undivided, shows how the rain has fallen, and the (onward progress) is stayed - (so) must we value the full accumulation of the virtue (represented by the upper trigram). But a wife (exercising restraint), however firm and correct she may be, is in a position of peril, (and like) the moon approaching to the full. If the superior man prosecute his measures (in such circumstances), there will be evil."},"xiangZhuan":{"cn":"既雨既處，德積載也。君子征凶，有所疑也。","en":"'The rain has fallen and (the onward progress) is stayed:' - the power (denoted in the figure) has accumulated to the full. 'If the superior man prosecute his measures, there will be evil:' - he will find himself obstructed."}}]}},{"binary":55,"binaryString":"110111","char":"䷉","id":10,"kanji":"履","lowerBinaryString":"110","sameTrigram":false,"text":"Hexagram 10 is named 履 (lǚ), \"Treading\". Other variations include \"treading (conduct)\" and \"continuing\". Its inner (lower) trigram is ☱ (兌 duì) open = (澤) swamp, and its outer (upper) trigram is ☰ (乾 qián) force = (天) heaven.","translation":"Treading","unicode":19913,"upperBinaryString":"111","yomi":"lǚ","ichingTexts":{"text":{"cn":"履虎尾，不咥人，亨。","en":"(Lu suggests the idea of) one treading on the tail of a tiger, which does not bite him. There will be progress and success."},"tuanZhuan":{"cn":"履，柔履剛也。說而應乎乾，是以履虎尾，不咥人，亨。剛中正，履帝位而不疚，光明也。","en":"In Lu we have (the symbol of) weakness treading on (that of) strength. (The lower trigram) indicates pleasure and satisfaction, and responds to (the upper) indicating strength. Hence (it is said), 'He treads on the tail of a tiger, which does not bite him; there will be progress and success.' (The fifth line is) strong, in the centre, and in its correct place. (Its subject) occupies the God-(given) position, and falls into no distress or failure; - (his) action will be brilliant."},"xiangZhuan":{"cn":"上天下澤，履；君子以辨上下，安民志。","en":"(The trigram representing) the sky above, and below it (that representing the waters of) a marsh, form Lu. The superior man, in accordance with this, discriminates between high and low, and gives settlement to the aims of the people."},"commentaries":[{"number":1,"text":{"cn":"初九：素履，往无咎。","en":"The first NINE, undivided, shows its subject treading his accustomed path. If he go forward, there will be no error."},"xiangZhuan":{"cn":"素履之往，獨行愿也。","en":"'He treads his accustomed path and goes forward:' - singly and exclusively he carries out his (long-cherished) wishes."}},{"number":2,"text":{"cn":"九二：履道坦坦，幽人貞吉。","en":"The second NINE, undivided, shows its subject treading the path that is level and easy - a quiet and solitary man, to whom, if he be firm and correct, there will be good fortune."},"xiangZhuan":{"cn":"幽人貞吉，中不自亂也。","en":"'A quiet and solitary man, to whom, being firm and correct, there will be good fortune:' - holding the due mean, he will not allow himself to be thrown into disorder."}},{"number":3,"text":{"cn":"六三：眇能視，跛能履，履虎尾，咥人，凶。武人為于大君。","en":"The third SIX, divided, shows a one-eyed man (who thinks he) can see; a lame man (who thinks he) can walk well; one who treads on the tail of a tiger and is bitten. (All this indicates) ill fortune. We have a (mere) bravo acting the part of a great ruler."},"xiangZhuan":{"cn":"眇能視；不足以有明也。跛能履；不足以與行也，咥人之凶；位不當也。武人為于大君；志剛也。","en":"'A one-eyed man (who thinks that he) can see:' - he is not fit to see clearly. 'A lame man (who thinks that he can) tread well:' - one cannot walk along with him. 'The ill fortune of being bitten' arises from the place not being the proper one for him. 'A (mere) bravo acting the part of a great ruler:' - this is owing to his aims being (too) violent."}},{"number":4,"text":{"cn":"九四：履虎尾，愬愬，終吉。","en":"The fourth NINE, undivided, shows its subject treading on the tail of a tiger. He becomes full of apprehensive caution, and in the end there will be good fortune."},"xiangZhuan":{"cn":"愬愬終吉，志行也。","en":"'He becomes full of apprehensive caution, and in the end there will be good fortune:' - his aim takes effect."}},{"number":5,"text":{"cn":"九五：夬履，貞厲。","en":"The fifth NINE, undivided, shows the resolute tread of its subject. Though he be firm and correct, there will be peril."},"xiangZhuan":{"cn":"夬履貞厲，位正當也。","en":"'He treads resolutely; and though he be firm and correct, there is peril:' - this is due to his being in the position that is correct and appropriate to him."}},{"number":6,"text":{"cn":"上九：視履考祥，其旋元吉。","en":"The sixth NINE, undivided, tells us to look at (the whole course) that is trodden, and examine the presage which that gives. If it be complete and without failure, there will be great good fortune."},"xiangZhuan":{"cn":"元吉在上，大有慶也。","en":"'There will be great good fortune,' and that in the occupancy of the topmost line: - this is great matter for congratulation."}}]}},{"binary":56,"binaryString":"111000","char":"䷊","id":11,"kanji":"泰","lowerBinaryString":"111","sameTrigram":false,"text":"Hexagram 11 is named 泰 (tài), \"Pervading\". Other variations include \"peace\" and \"greatness\". Its inner (lower) trigram is ☰ (乾 qián) force = (天) heaven, and its outer (upper) trigram is ☷ (坤 kūn) field = (地) earth.","translation":"Pervading","unicode":19914,"upperBinaryString":"000","yomi":"tài","ichingTexts":{"text":{"cn":"泰：小往大來，吉亨。","en":"In Tai (we see) the little gone and the great come. (It indicates that) there will be good fortune, with progress and success."},"tuanZhuan":{"cn":"泰，小往大來，吉亨。則是天地交，而萬物通也；上下交，而其志同也。內陽而外陰，內健而外順，內君子而外小人，君子道長，小人道消也。","en":"'The little come and the great gone in Tai, and its indication that there will be good fortune with progress and success' show to us heaven and earth in communication with each other, and all things in consequence having free course, and (also) the high and the low, (superiors and inferiors), in communication with one another, and possessed by the same aim. The inner (trigram) is made up of the strong and undivided lines, and the outer of the weak and divided; the inner is (the symbol of) strength, and the outer of docility; the inner (represents) the superior man, and the outer the small man. (Thus) the way of the superior man appears increasing, and that of the small man decreasing."},"xiangZhuan":{"cn":"天地交泰，后以財成天地之道，輔相天地之宜，以左右民。","en":"(The trigrams for) heaven and earth in communication together form Tai. The (sage) sovereign, in harmony with this, fashions and completes (his regulations) after the courses of heaven and earth, and assists the application of the adaptations furnished by them, - in order to benefit the people."},"commentaries":[{"number":1,"text":{"cn":"初九：拔茅茹，以其彙，征吉。","en":"The first NINE, undivided, suggests the idea of grass pulled up, and bringing with it other stalks with whose roots it is connected. Advance (on the part of its subject) will be fortunate."},"xiangZhuan":{"cn":"拔茅征吉，志在外也。","en":"'The good fortune of advance, (as suggested by the emblem of) the grass pulled up,' arises from the will (of the party intended) being set on what is external to himself."}},{"number":2,"text":{"cn":"九二：包荒，用馮河，不遐遺，朋亡，得尚于中行。","en":"The second NINE, undivided, shows one who can bear with the uncultivated, will cross the He without a boat, does not forget the distant, and has no (selfish) friendships. Thus does he prove himself acting in accordance with the course of the due Mean."},"xiangZhuan":{"cn":"包荒，得尚于中行，以光大也。","en":"'He bears with the uncultivated, and proves himself acting in accordance with the due mean:' - for (his intelligence is) bright and (his capacity is) great."}},{"number":3,"text":{"cn":"九三：无平不陂，无往不復，艱貞无咎。勿恤其孚，于食有福。","en":"The third NINE, undivided, shows that, while there is no state of peace that is not liable to be disturbed, and no departure (of evil men) so that they shall not return, yet when one is firm and correct, as he realises the distresses that may arise, he will commit no error. There is no occasion for sadness at the certainty (of such recurring changes); and in this mood the happiness (of the present) may be (long) enjoyed."},"xiangZhuan":{"cn":"无往不復，天地際也。","en":"'There is no going away so that there shall not be a return' refers to this as the point where the interaction of heaven and earth takes place."}},{"number":4,"text":{"cn":"六四：翩翩，不富，以其鄰，不戒以孚。","en":"The fourth SIX, divided, shows its subject fluttering (down) - not relying on his own rich resources, but calling in his neighbours. (They all come) not as having received warning, but in the sincerity (of their hearts)."},"xiangZhuan":{"cn":"翩翩不富，皆失實也。不戒以孚，中心願也。","en":"'He comes fluttering (down), not relying on his own rich resources:' - both he and his neighbours are out of their real (place where they are). 'They have not received warning, but (come) in the sincerity (of their hearts):' - this is what they have desired in the core of their hearts."}},{"number":5,"text":{"cn":"六五：帝乙歸妹，以祉元吉。","en":"The fifth six, divided, reminds us of (king) Di-yi's (rule about the) marriage of his younger sister. By such a course there is happiness and there will be great good fortune."},"xiangZhuan":{"cn":"以祉元吉，中以行愿也。","en":"'By such a course there is happiness, and there will be great good fortune:' - (the subject of the line) employs the virtue proper to his central position to carry his wishes into effect."}},{"number":6,"text":{"cn":"上六：城復于隍，勿用師。自邑告命，貞吝。","en":"The sixth six, divided, shows us the city wall returned into the moat. It is not the time to use the army. (The subject of the line) may, indeed, announce his orders to the people of his own city; but however correct and firm he may be, he will have cause for regret."},"xiangZhuan":{"cn":"城復于隍，其命亂也。","en":"'The city wall returned back into the moat' shows how the (governmental) orders have (long) been in disorder."}}]}},{"binary":7,"binaryString":"000111","char":"䷋","id":12,"kanji":"否","lowerBinaryString":"000","sameTrigram":false,"text":"Hexagram 12 is named 否 (pǐ), \"Obstruction\". Other variations include \"standstill (stagnation)\" and \"selfish persons\". Its inner (lower) trigram is ☷ (坤 kūn) field = (地) earth, and its outer (upper) trigram is ☰ (乾 qián) force = (天) heaven.","translation":"Obstruction","unicode":19915,"upperBinaryString":"111","yomi":"pǐ","ichingTexts":{"text":{"cn":"否之匪人，不利君子貞，大往小來。","en":"In Pi there is the want of good understanding between the (different classes of) men, and its indication is unfavourable to the firm and correct course of the superior man. We see in it the great gone and the little come."},"tuanZhuan":{"cn":"否之匪人，不利君子貞。大往小來，則是天地不交，而萬物不通也；上下不交，而天下无邦也。內陰而外陽，內柔而外剛，內小人而外君子。小人道長，君子道消也。","en":"'The want of good understanding between the (different classes of) men in Pi, and its indication as unfavourable to the firm and correct course of the superior man; with the intimation that the great are gone and the little come:' - all this springs from the fact that in it heaven and earth are not in communication with each other, and all things in consequence do not have free course; and that the high and the low (superiors and inferiors) are not in communication with one another, and there are no (well-regulated) states under the sky. The inner (trigram) is made up of the weak and divided lines, and the outer of the strong and undivided: the inner is (the symbol of) weakness, and the outer of strength; the inner (represents) the small man, and the outer the superior man. Thus the way of the small man appears increasing, and that of the superior man decreasing."},"xiangZhuan":{"cn":"天地不交，否；君子以儉德辟難，不可榮以祿。","en":"(The trigrams of) heaven and earth, not in intercommunication, form Pi. The superior man, in accordance with this, restrains (the manifestation) of) his virtue, and avoids the calamities (that threaten him). There is no opportunity of conferring on him the glory of emolument."},"commentaries":[{"number":1,"text":{"cn":"初六：拔茅茹，以其彙，貞吉亨。","en":"The first SIX, divided, suggests the idea of grass pulled up, and bringing with it other stalks with whose roots it is connected. With firm correctness (on the part of its subject), there will be good fortune and progress."},"xiangZhuan":{"cn":"拔茅貞吉，志在君也。","en":"'The good fortune through firm goodness, (suggested by) the pulling up of the grass,' arises from the will (of the parties intended) being bent on (serving) the ruler."}},{"number":2,"text":{"cn":"六二：包承。小人吉，大人否，亨。","en":"The second SIX, divided, shows its subject patient and obedient. To the small man (comporting himself so) there will be good fortune. If the great man (comport himself) as the distress and obstruction require, he will have success."},"xiangZhuan":{"cn":"大人否亨，不亂群也。","en":"'The great man, comporting himself as the distress and obstruction require, will have success: - 'he does not allow himself to be disordered by the herd (of small men)."}},{"number":3,"text":{"cn":"六三：包羞。","en":"The third SIX, divided, shows its subject ashamed of the purpose folded (in his breast)."},"xiangZhuan":{"cn":"包羞，位不當也。","en":"That 'his shame is folded in his breast' is owing to the inappropriateness of his position."}},{"number":4,"text":{"cn":"九四：有命，无咎，疇離祉。","en":"The fourth NINE, undivided, shows its subject acting in accordance with the ordination (of Heaven), and committing no error. His companions will come and share in his happiness."},"xiangZhuan":{"cn":"有命无咎，志行也。","en":"'He acts in accordance with the ordination (of Heaven), and commits no error:' - the purpose of his mind can be carried into effect."}},{"number":5,"text":{"cn":"九五：休否，大人吉。其亡其亡，繫于苞桑。","en":"In the fifth NINE, undivided, we see him who brings the distress and obstruction to a close,--the great man and fortunate. (But let him say), 'We may perish! We may perish!' (so shall the state of things become firm, as if) bound to a clump of bushy mulberry trees."},"xiangZhuan":{"cn":"大人之吉，位正當也。","en":"The good fortune of the great man' arises from the correctness of his position."}},{"number":6,"text":{"cn":"上九：傾否，先否後喜。","en":"The sixth NINE, undivided, shows the overthrow (and removal of) the condition of distress and obstruction. Before this there was that condition. Hereafter there will be joy."},"xiangZhuan":{"cn":"否終則傾，何可長也。","en":"'The distress and obstruction having reached its end, it is overthrown and removed:' - how could it be prolonged?"}}]}},{"binary":47,"binaryString":"101111","char":"䷌","id":13,"kanji":"同人","lowerBinaryString":"101","sameTrigram":false,"text":"Hexagram 13 is named 同人 (tóng rén), \"Concording People\". Other variations include \"fellowship with men\" and \"gathering men\". Its inner (lower) trigram is ☲ (離 lí) radiance = (火) fire, and its outer (upper) trigram is ☰ (乾 qián) force = (天) heaven.","translation":"Concording People","unicode":19916,"upperBinaryString":"111","yomi":"tóng rén","ichingTexts":{"text":{"cn":"同人于野，亨。利涉大川，利君子貞。","en":"Tong Ren (or 'Union of men') appears here (as we find it) in the (remote districts of the) country, indicating progress and success. It will be advantageous to cross the great stream. It will be advantageous to maintain the firm correctness of the superior man."},"tuanZhuan":{"cn":"同人，柔得位得中，而應乎乾，曰同人。同人曰，同人于野，亨。利涉大川，乾行也。文明以健，中正而應，君子正也。唯君子為能通天下之志。","en":"In Tong Ren the weak (line) has the place (of influence), the central place, and responds to (the corresponding line in) Qian (above); hence comes its name of Tong Ren (or 'Union of men'). Tong Ren says: - The language, 'Tong Ren appears here (as we find it) in (the remote districts of) the country, indicating progress and success, and that it will be advantageous to cross the great stream,' is moulded by its containing the strength (symbolled) in Qian. (Then) we have (the trigram indicating) elegance and intelligence, supported by (that indicating) strength; with the line in the central, and its correct, position, and responding (to the corresponding line above): - (all representing) the correct course of the superior man. It is only the superior man who can comprehend and affect the minds of all under the sky."},"xiangZhuan":{"cn":"天與火，同人；君子以類族辨物。","en":"(The trigrams for) heaven and fire form Tong Ren. The superior man, in accordance with this), distinguishes things according to their kinds and classes."},"commentaries":[{"number":1,"text":{"cn":"初九：同人于門，无咎。","en":"The first NINE, undivided, (shows the representative of) the union of men just issuing from his gate. There will be no error."},"xiangZhuan":{"cn":"出門同人，又誰咎也。","en":"'(The representative of) the union of men is just issuing from his gate:' - who will blame him?"}},{"number":2,"text":{"cn":"六二：同人于宗，吝。","en":"The second SIX, divided, (shows the representative of) the union of men in relation with his kindred. There will be occasion for regret."},"xiangZhuan":{"cn":"同人于宗，吝道也。","en":"'(The representative of) the union of men appears in relation with his kindred:' - that is the path to regret."}},{"number":3,"text":{"cn":"九三：伏戎于莽，升其高陵，三歲不興。","en":"The third NINE, undivided, (shows its subject) with his arms hidden in the thick grass, and at the top of a high mound. (But) for three years he makes no demonstration."},"xiangZhuan":{"cn":"伏戎于莽，敵剛也。三歲不興，安行也。","en":"'He hides his arms in the thick grass:' - because of the strength of his opponent. 'For three years he makes no demonstration:' - how can he do anything?"}},{"number":4,"text":{"cn":"九四：乘其墉，弗克攻，吉。","en":"The fourth NINE, undivided, (shows its subject) mounted on the city wall; but he does not proceed to make the attack (he contemplates). There will be good fortune."},"xiangZhuan":{"cn":"乘其墉，義弗克也，其吉，則困而反則也。","en":"'He is mounted on his city-wall;' but yielding to the right, 'he does not proceed to make the attack (he contemplated).' (Where it is said),'There will be good fortune,' (that shows how) he feels the strait he is in, and returns to the rule of law."}},{"number":5,"text":{"cn":"九五：同人，先號咷而後笑。大師克相遇。","en":"In the fifth NINE, undivided, (the representative of) the union of men first wails and cries out, and then laughs. His great host conquers, and he (and the subject of the second line) meet together."},"xiangZhuan":{"cn":"同人之先，以中直也。大師相遇，言相克也。","en":"The first action of (the representative of) the union of men (here described) arises from his central position and straightforward character. 'The meeting secured by his great host' intimates that the opponents of it have been overcome."}},{"number":6,"text":{"cn":"上九：同人于郊，无悔。","en":"The topmost NINE, undivided, (shows the representative of) the union of men in the suburbs. There will be no occasion for repentance."},"xiangZhuan":{"cn":"同人于郊，志未得也。","en":"'(The representative of) the union of men appears in the suburbs:' - his object has not yet been attained."}}]}},{"binary":61,"binaryString":"111101","char":"䷍","id":14,"kanji":"大有","lowerBinaryString":"111","sameTrigram":false,"text":"Hexagram 14 is named 大有 (dà yǒu), \"Great Possessing\". Other variations include \"possession in great measure\" and \"the great possession\". Its inner (lower) trigram is ☰ (乾 qián) force = (天) heaven, and its outer (upper) trigram is ☲ (離 lí) radiance = (火) fire.","translation":"Great Possessing","unicode":19917,"upperBinaryString":"101","yomi":"dà yǒu","ichingTexts":{"text":{"cn":"大有：元亨。","en":"Da You indicates that, (under the circumstances which it implies), there will be great progress and success."},"tuanZhuan":{"cn":"大有，柔得尊位，大中而上下應之，曰大有。其德剛健而文明，應乎天而時行，是以元亨。","en":"In Da You the weak (line) has the place of honour, is grandly central, and (the strong lines) above and below respond to it. Hence comes its name of Da You (Having what is Great). The attributes (of its component trigrams) are strength and vigour with elegance and brightness. (The ruling line in it) responds to (the ruling line in the symbol of) heaven, and (consequently) its action is (all) at the proper times. In this way (it is said to) indicate great progress and success."},"xiangZhuan":{"cn":"火在天上，大有；君子以遏惡揚善，順天休命。","en":"(The trigram for) heaven and (that of) fire above it form Da You. The superior man, in accordance with this, represses what is evil and gives distinction to what is good, in sympathy with the excellent Heaven-conferred (nature)."},"commentaries":[{"number":1,"text":{"cn":"初九：无交害，匪咎，艱則无咎。","en":"In the first NINE, undivided, there is no approach to what is injurious, and there is no error. Let there be a realisation of the difficulty (and danger of the position), and there will be no error (to the end)."},"xiangZhuan":{"cn":"大有初九，无交害也。","en":"This first NINE, (undivided), of Da You shows no approach to what is injurious."}},{"number":2,"text":{"cn":"九二：大車以載，有攸往，无咎。","en":"In the second NINE, undivided, we have a large waggon with its load. In whatever direction advance is made, there will be no error."},"xiangZhuan":{"cn":"大車以載，積中不敗也。","en":"'A large waggon with its load' refers to the (virtue) accumulated (in the subject of the line), so that he will suffer no loss (in the conduct of affairs)."}},{"number":3,"text":{"cn":"九三：公用亨于天子，小人弗克。","en":"The third NINE, undivided, shows us a feudal prince presenting his offerings to the Son of Heaven. A small man would be unequal (to such a duty)."},"xiangZhuan":{"cn":"公用亨于天子，小人害也。","en":"'A feudal prince presents his offerings to the son of Heaven:' - a small man (in such a position) does (himself) harm."}},{"number":4,"text":{"cn":"九四：匪其彭，无咎。","en":"The fourth NINE, undivided, shows its subject keeping his great resources under restraint. There will be no error."},"xiangZhuan":{"cn":"匪其彭，无咎；明辨晰也。","en":"'He keeps his great resources under restraint:' - his wisdom discriminates clearly (what he ought to do)."}},{"number":5,"text":{"cn":"六五：厥孚交如，威如；吉。","en":"The fifth SIX, divided, shows the sincerity of its subject reciprocated by that of all the others (represented in the hexagram). Let him display a proper majesty, and there will be good fortune."},"xiangZhuan":{"cn":"厥孚交如，信以發志也。威如之吉，易而无備也。","en":"'His sincerity is reciprocated by all the others:' - his sincerity serves to stir and call out what is in their minds. 'The good fortune springing from a display of proper majesty' shows how they might (otherwise) feel too easy, and make no preparation (to serve him)."}},{"number":6,"text":{"cn":"上九：自天祐之，吉无不利。","en":"The topmost NINE, undivided, shows its subject with help accorded to him from Heaven. There will be good fortune, advantage in every respect."},"xiangZhuan":{"cn":"大有上吉，自天佑也。","en":"'The good fortune attached to the topmost line of Da You' arises from the help of Heaven."}}]}},{"binary":8,"binaryString":"001000","char":"䷎","id":15,"kanji":"謙","lowerBinaryString":"001","sameTrigram":false,"text":"Hexagram 15 is named 謙 (qiān), \"Humbling\". Other variations include \"modesty\". Its inner (lower) trigram is ☶ (艮 gèn) bound = (山) mountain and its outer (upper) trigram is ☷ (坤 kūn) field = (地) earth.","translation":"Humbling","unicode":19918,"upperBinaryString":"000","yomi":"qiān","ichingTexts":{"text":{"cn":"謙：亨，君子有終。","en":"Qian indicates progress and success. The superior man, (being humble as it implies), will have a (good) issue (to his undertakings)."},"tuanZhuan":{"cn":"謙，亨，天道下濟而光明，地道卑而上行。天道虧盈而益謙，地道變盈而流謙，鬼神害盈而福謙，人道惡盈而好謙。謙尊而光，卑而不可踰，君子之終也。","en":"Qian indicates progress and success. It is the way of heaven to send down its beneficial influences below, where they are brilliantly displayed. It is the way of earth, lying low, to send its influences upwards and (there) to act. It is the way of heaven to diminish the full and augment the humble. It is the way of earth to overthrow the full and replenish the humble. Spiritual Beings inflict calamity on the full and bless the humble. It is the way of men to hate the full and love the humble. Humility in a position of honour makes that still more brilliant; and in a low position men will not (seek to) pass beyond it. Thus it is that 'the superior man will have a (good) issue (to his undertakings).'"},"xiangZhuan":{"cn":"地中有山，謙；君子以裒多益寡，稱物平施。","en":"(The trigram for) the earth and (that of) a mountain in the midst of it form Qian. The superior man, in accordance with this, diminishes what is excessive (in himself), and increases where there is any defect, bringing about an equality, according to the nature of the case, in his treatment (of himself and others)."},"commentaries":[{"number":1,"text":{"cn":"初六：謙謙君子，用涉大川，吉。","en":"The first SIX, divided, shows us the superior man who adds humility to humility. (Even) the great stream may be crossed with this, and there will be good fortune."},"xiangZhuan":{"cn":"謙謙君子，卑以自牧也。","en":"'The superior man who adds humility to humility' is one who nourishes his (virtue) in lowliness."}},{"number":2,"text":{"cn":"六二：鳴謙，貞吉。","en":"The second SIX, divided, shows us humility that has made itself recognised. With firm correctness there will be good fortune."},"xiangZhuan":{"cn":"鳴謙貞吉，中心得也。","en":"'The good fortune consequent on being firm and correct, where the humility has made itself recognised, is owing to the possessor's having (the virtue) in the core of his heart."}},{"number":3,"text":{"cn":"九三：勞謙，君子有終，吉。","en":"The third NINE, undivided, shows the superior man of (acknowledged) merit. He will maintain his success to the end, and have good fortune."},"xiangZhuan":{"cn":"勞謙君子，萬民服也。","en":"'The superior man of (acknowledged) merit, and yet humble:' - the myriads of the people will submit to him."}},{"number":4,"text":{"cn":"六四：无不利，撝謙。","en":"The fourth SIX, divided, shows one, whose action would be in every way advantageous, stirring up (the more) his humility."},"xiangZhuan":{"cn":"无不利，撝謙；不違則也。","en":"'One, whose action would be in every way advantageous, stirs up his humility the more:'(but in doing so) he does not act contrary to the (proper) rule."}},{"number":5,"text":{"cn":"六五：不富，以其鄰，利用侵伐，无不利。","en":"The fifth SIX, divided, shows one who, without being rich, is able to employ his neighbours. He may advantageously use the force of arms. All his movements will be advantageous."},"xiangZhuan":{"cn":"利用侵伐，征不服也。","en":"'He may advantageously use the force of arms:' - correcting, that is, those who do not submit."}},{"number":6,"text":{"cn":"上六：鳴謙，利用行師，征邑國。","en":"The sixth SIX, divided, shows us humility that has made itself recognised. The subject of it will with advantage put his hosts in motion; but (he will only) punish his own towns and state."},"xiangZhuan":{"cn":"鳴謙，志未得也。可用行師，征邑國也。","en":"'His humility has made itself recognised:' - (but) all his aims have not yet been attained. He may employ the force of arms, (but only) in correcting (his own) towns and state.'"}}]}},{"binary":4,"binaryString":"000100","char":"䷏","id":16,"kanji":"豫","lowerBinaryString":"000","sameTrigram":false,"text":"Hexagram 16 is named 豫 (yù), \"Providing-For\". Other variations include \"enthusiasm\" and \"excess\". Its inner (lower) trigram is ☷ (坤 kūn) field = (地) earth, and its outer (upper) trigram is ☳ (震 zhèn) shake = (雷) thunder.","translation":"Providing-For","unicode":19919,"upperBinaryString":"100","yomi":"yù","ichingTexts":{"text":{"cn":"豫：利建侯，行師。","en":"Yu indicates that, (in the state which it implies), feudal princes may be set up, and the hosts put in motion, with advantage."},"tuanZhuan":{"cn":"豫，剛應而志行，順以動，豫。豫，順以動，故天地如之，而況建侯行師乎？天地以順動，故日月不過，而四時不忒；聖人以順動，則刑罰清而民服。豫之時義大矣哉！","en":"In Yu we see the strong (line) responded to by all the others, and the will (of him whom it represents) being carried out; and (also) docile obedience employing movement (for its purposes). (From these things comes) Yu (the Condition of harmony and satisfaction). In this condition we have docile obedience employing movement (for its purposes), and therefore it is so as between heaven and earth; - how much more will it be so (among men) in 'the setting up of feudal princes and putting the hosts in motion!' Heaven and earth show that docile obedience in connexion with movement, and hence the sun and moon make no error (in time), and the four seasons do not deviate (from their order). The sages show such docile obedience in connexion with their movements, and hence their punishments and penalties are entirely just, and the people acknowledge it by their submission. Great indeed are the time and significance indicated in Yu!"},"xiangZhuan":{"cn":"雷出地奮，豫。先王以作樂崇德，殷薦之上帝，以配祖考。","en":"(The trigrams for) the earth and thunder issuing from it with its crashing noise form Yu. The ancient kings, in accordance with this, composed their music and did honour to virtue, presenting it especially and most grandly to God, when they associated with Him (at the service) their highest ancestor and their father."},"commentaries":[{"number":1,"text":{"cn":"初六：鳴豫，凶。","en":"The first SIX, divided, shows its subject proclaiming his pleasure and satisfaction. There will be evil."},"xiangZhuan":{"cn":"初六鳴豫，志窮凶也。","en":"'The (subject of the) first six proclaims his pleasure and satisfaction:' - there will be evil; his wishes have been satisfied to overflowing."}},{"number":2,"text":{"cn":"六二：介于石，不終日，貞吉。","en":"The second SIX, divided, shows one who is firm as a rock. (He sees a thing) without waiting till it has come to pass; with his firm correctness there will be good fortune."},"xiangZhuan":{"cn":"不終日，貞吉；以中正也。","en":"'(He sees a thing) without waiting till it has come to pass; with his firm correctness there will be good fortune:' - this is shown by the central and correct position (of the line)."}},{"number":3,"text":{"cn":"六三：盱豫，悔。遲有悔。","en":"The third SIX, divided, shows one looking up (for favours), while he indulges the feeling of pleasure and satisfaction. If he would understand!--If he be late in doing so, there will indeed be occasion for repentance."},"xiangZhuan":{"cn":"盱豫有悔，位不當也。","en":"'He looks up (for favours), while he indulges the feeling of satisfaction; there will be occasion for repentance:' - this is intimated by the position not being the appropriate one."}},{"number":4,"text":{"cn":"九四：由豫，大有得。勿疑。朋盍簪。","en":"The fourth NINE, undivided, shows him from whom the harmony and satisfaction come. Great is the success which he obtains. Let him not allow suspicions to enter his mind, and thus friends will gather around him."},"xiangZhuan":{"cn":"由豫，大有得；志大行也。","en":"'From him the harmony and satisfaction come; great is the success which he obtains:' - his aims take effect on a grand scale."}},{"number":5,"text":{"cn":"六五：貞疾，恆不死。","en":"The fifth six, divided, shows one with a chronic complaint, but who lives on without dying."},"xiangZhuan":{"cn":"六五貞疾，乘剛也。恆不死，中未亡也。","en":"'(The subject of) the fifth six has a chronic complaint:' - this is shown by his being mounted on the strong (line). 'He still lives on without dying:' - he is in the central position, (and its memories of the past) have not yet perished."}},{"number":6,"text":{"cn":"上六：冥豫，成有渝，无咎。","en":"The topmost six, divided, shows its subject with darkened mind devoted to the pleasure and satisfaction (of the time); but if he change his course even when (it may be considered as) completed, there will be no error."},"xiangZhuan":{"cn":"冥豫在上，何可長也。","en":"'With darkened mind devoted to the harmony and satisfaction (of the time),' as shown in the topmost (line): - how can one in such a condition continue long?"}}]}},{"binary":38,"binaryString":"100110","char":"䷐","id":17,"kanji":"隨","lowerBinaryString":"100","sameTrigram":false,"text":"Hexagram 17 is named 隨 (suí), \"Following\". Its inner (lower) trigram is ☳ (震 zhèn) shake = (雷) thunder, and its outer (upper) trigram is ☱ (兌 duì) open = (澤) swamp.","translation":"Following","unicode":19920,"upperBinaryString":"110","yomi":"suí","ichingTexts":{"text":{"cn":"隨：元亨利貞，无咎。","en":"Sui indicates that (under its conditions) there will be great progress and success. But it will be advantageous to be firm and correct. There will (then) be no error."},"tuanZhuan":{"cn":"隨，剛來而下柔，動而說，隨。大亨貞，无咎，而天下隨時，隨時之義大矣哉！","en":"In Sui we see the strong (trigram) come and place itself under the weak; we see (in the two) the attributes of movement and pleasure: - this gives (the idea of) Sui. 'There will be great progress and success; and through firm correctness no error:' - all under heaven will be found following at such a time. Great indeed are the time and significance indicated in Sui."},"xiangZhuan":{"cn":"澤中有雷，隨；君子以嚮晦入宴息。","en":"(The trigram for the waters of) a marsh and (that for) thunder (hidden) in the midst of it form Sui. The superior man in accordance with this, when it is getting towards dark, enters (his house) and rests."},"commentaries":[{"number":1,"text":{"cn":"初九：官有渝，貞吉。出門交有功。","en":"The first NINE, undivided, shows us one changing the object of his pursuit; but if he be firm and correct, there will he good fortune. Going beyond (his own) gate to find associates, he will achieve merit."},"xiangZhuan":{"cn":"官有渝，從正吉也。出門交有功，不失也。","en":"'He is changing the object of his pursuit:' - but if he follow what is correct, there will be good fortune. 'He goes beyond (his own) gate to find associates:' - he will not fail (in the method he pursues)."}},{"number":2,"text":{"cn":"六二：系小子，失丈夫。","en":"The second SIX, divided, shows us one who cleaves to the little boy, and lets go the man of age and experience."},"xiangZhuan":{"cn":"係小子，弗兼與也。","en":"'He cleaves to the little boy:' - he cannot be with the two at the same time."}},{"number":3,"text":{"cn":"六三：系丈夫，失小子。隨有求得，利居貞。","en":"The third SIX, divided, shows us one who cleaves to the man of age and experience, and lets go. the little boy. Such following will get what it seeks; but it will be advantageous to adhere to what is firm and correct."},"xiangZhuan":{"cn":"系丈夫，志舍下也。","en":"'He cleaves to the man of age and experience:' - by the decision of his will, he abandons (the youth) below."}},{"number":4,"text":{"cn":"九四：隨有獲，貞凶。有孚在道，以明，何咎。","en":"The fourth NINE, undivided, shows us one followed and obtaining (adherents). Though he be firm and correct, there will be evil. If he be sincere (however) in his course, and make that evident, into what error will he fall?"},"xiangZhuan":{"cn":"隨有獲，其義凶也。有孚在道，明功也。","en":"'He is followed and obtains adherents:' - according to the idea (of the hexagram), this is evil. 'He is sincere in his course:' - showing his intelligence, and leading to achievement."}},{"number":5,"text":{"cn":"九五：孚于嘉，吉。","en":"The fifth NINE, undivided, shows us (the ruler) sincere in (fostering all) that is excellent. There will be good fortune."},"xiangZhuan":{"cn":"孚于嘉，吉；位正中也。","en":"'He is sincere in fostering what is excellent:' - his position is correct and in the centre."}},{"number":6,"text":{"cn":"上六：拘系之，乃從維之。王用亨于西山。","en":"The topmost SIX, divided, shows us (that sincerity) firmly held and clung to, yea, and bound fast. (We see) the king with it presenting his offerings on the western mountain."},"xiangZhuan":{"cn":"拘系之，上窮也。","en":"'The sincerity is firmly held and clung to, as shown in the topmost line:' - (the idea of the hexagram) has reached its extreme development."}}]}},{"binary":25,"binaryString":"011001","char":"䷑","id":18,"kanji":"蠱","lowerBinaryString":"011","sameTrigram":false,"text":"Hexagram 18 is named 蠱 (gǔ), \"Correcting\". Other variations include \"work on what has been spoiled (decay)\", decaying and \"branch\". Its inner (lower) trigram is ☴ (巽 xùn) ground = (風) wind, and its outer (upper) trigram is ☶ (艮 gèn) bound = (山) mountain. Gu is the name of a venom-based poison traditionally used in Chinese witchcraft.","translation":"Correcting","unicode":19921,"upperBinaryString":"001","yomi":"gǔ","ichingTexts":{"text":{"cn":"蠱：元亨，利涉大川。先甲三日，後甲三日。","en":"Gu indicates great progress and success (to him who deals properly with the condition represented by it). There will be advantage in (efforts like that of) crossing the great stream. (He should weigh well, however, the events of) three days before the turning point, and those (to be done) three days after it."},"tuanZhuan":{"cn":"蠱，剛上而柔下，巽而止，蠱。蠱，元亨，而天下治也。利涉大川，往有事也。先甲三日，後甲三日，終則有始，天行也。","en":"In Gu we have the strong (trigram) above, and the weak one below; we have (below) pliancy, and (above) stopping: - these give the idea of Gu (a Troublous Condition of affairs verging to ruin). 'Gu indicates great progress and success:' - (through the course shown in it), all under heaven, there will be good order. 'There will be advantage in crossing the great stream:' - he who advances will encounter the business to be done. '(He should weigh well, however, the events of) three days before (the turning-point), and those (to be done) three days after it:' - the end (of confusion) is the beginning (of order); such is the procedure of Heaven."},"xiangZhuan":{"cn":"山下有風，蠱；君子以振民育德。","en":"(The trigram for) a mountain, and below it that for wind, form Gu. The superior man, in accordance with this, (addresses himself to) help the people and nourish his own virtue."},"commentaries":[{"number":1,"text":{"cn":"初六：幹父之蠱，有子，考无咎，厲終吉。","en":"The first SIX, divided, shows (a son) dealing with the troubles caused by his father. If he be an (able) son, the father will escape the blame of having erred. The position is perilous, but there will be good fortune in the end."},"xiangZhuan":{"cn":"幹父之蠱，意承考也。","en":"'He deals with the troubles caused by his father:' - he feels that he has entered into the work of his father."}},{"number":2,"text":{"cn":"九二：幹母之蠱，不可貞。","en":"The second NINE, undivided, shows (a son) dealing with the troubles caused by his mother. He should not (carry) his firm correctness (to the utmost)."},"xiangZhuan":{"cn":"幹母之蠱，得中道也。","en":"'He deals with the troubles caused by his mother:' - he holds to the course of the due mean."}},{"number":3,"text":{"cn":"九三：幹父之蠱，小有悔，无大咎。","en":"The third NINE, undivided, shows (a son) dealing with the troubles caused by his father. There may be some small occasion for repentance, but there will not be any great error."},"xiangZhuan":{"cn":"幹父之蠱，終无咎也。","en":"'He deals with the troubles caused by his father:' - in the end there will be no error."}},{"number":4,"text":{"cn":"六四：裕父之蠱，往見吝。","en":"The fourth SIX, divided, shows (a son) viewing indulgently the troubles caused by his father. If he go forward, he will find cause to regret it."},"xiangZhuan":{"cn":"裕父之蠱，往未得也。","en":"'He views indulgently the troubles caused by his father:' - if he go forward, he will not succeed."}},{"number":5,"text":{"cn":"六五：幹父之蠱，用譽。","en":"The fifth SIX, divided, shows (a son) dealing with the troubles caused by his father. He obtains the praise of using (the fit instrument for his work)."},"xiangZhuan":{"cn":"干父之蠱；承以德也。","en":"'He deals with the troubles caused by his father, and obtains praise:' - he is responded to (by the subject of line two) with all his virtue."}},{"number":6,"text":{"cn":"上九：不事王侯，高尚其事。","en":"The sixth NINE, undivided, shows us one who does not serve either king or feudal lord, but in a lofty spirit prefers (to attend to) his own affairs."},"xiangZhuan":{"cn":"不事王侯，志可則也。","en":"'He does not serve either king or feudal lord:' - but his aim may be a model (to others)."}}]}},{"binary":48,"binaryString":"110000","char":"䷒","id":19,"kanji":"臨","lowerBinaryString":"110","sameTrigram":false,"text":"Hexagram 19 is named 臨 (lín), \"Nearing\". Other variations include \"approach\" and \"the forest\". Its inner (lower) trigram is ☱ (兌 duì) open = (澤) swamp, and its outer (upper) trigram is ☷ (坤 kūn) field = (地) earth.","translation":"Nearing","unicode":19922,"upperBinaryString":"000","yomi":"lín","ichingTexts":{"text":{"cn":"臨：元，亨，利，貞。至于八月有凶。","en":"Lin (indicates that under the conditions supposed in it) there will be great progress and success, while it will be advantageous to be firmly correct. In the eighth month there will be evil."},"tuanZhuan":{"cn":"臨，剛浸而長。說而順，剛中而應，大亨以正，天之道也。至于八月有凶，消不久也。","en":"In Lin (we see) the strong (lines) gradually increasing and advancing. (The lower trigram is the symbol of) being pleased, and (the upper of) being compliant. The strong (line) is in the central position, and is properly responded to. 'There is great progress and success, along with firm correctness:' - this is the way of Heaven. 'In the eighth month there will be evil:' - (the advancing power) will decay after no long time."},"xiangZhuan":{"cn":"澤上有地，臨；君子以教思无窮，容保民无疆。","en":"(The trigram for) the waters of a marsh and that for the earth above it form Lin. The superior man, in accordance with this, has his purposes of instruction that are inexhaustible, and nourishes and supports the people without limit."},"commentaries":[{"number":1,"text":{"cn":"初九：咸臨，貞吉。","en":"The first NINE, undivided, shows its subject advancing in company (with the subject of the second line). Through his firm correctness there will be good fortune."},"xiangZhuan":{"cn":"咸臨貞吉，志行正也。","en":"'The good fortune through the firm correctness of (the subject of the first line) advancing in company (with the subject of the second)' is due to his will being set on doing what is right."}},{"number":2,"text":{"cn":"九二：咸臨，吉无不利。","en":"The second NINE, undivided, shows its subject advancing in company (with the subject of the first line). There will be good fortune; (advancing) will be in every way advantageous."},"xiangZhuan":{"cn":"咸臨，吉无不利；未順命也。","en":"'The good fortune and every possible advantage attending the advance (of the subject of the second line), in company (with the subject of the first),' arises from the fact that those (to whom the advance is made) are not yet obedient to the ordinances (of Heaven)."}},{"number":3,"text":{"cn":"六三：甘臨，无攸利。既憂之，无咎。","en":"The third SIX, divided, shows one well pleased (indeed) to advance, (but whose action) will be in no way advantageous. If he become anxious about it (however), there will be no error."},"xiangZhuan":{"cn":"甘臨，位不當也。既憂之，咎不長也。","en":"'He (shows himself) well pleased to advance:' - his position is not that appropriate to him. 'If he become anxious, however, about his action,' his error will not be continued."}},{"number":4,"text":{"cn":"六四：至臨，无咎。","en":"The fourth SIX, divided, shows one advancing in the highest mode. There will be no error."},"xiangZhuan":{"cn":"至臨无咎，位當也。","en":"'The freedom from error consequent on the advance in the highest mode' is due to the (various) appropriateness of the position."}},{"number":5,"text":{"cn":"六五：知臨，大君之宜，吉。","en":"The fifth SIX, divided, shows the advance of wisdom, such as befits the great ruler. There will be good fortune."},"xiangZhuan":{"cn":"大君之宜，行中之謂也。","en":"'What befits the great ruler' means the pursuing the course of the due mean."}},{"number":6,"text":{"cn":"上六：敦臨，吉无咎。","en":"The sixth SIX, divided, shows the advance of honesty and generosity. There will be good fortune, and no error."},"xiangZhuan":{"cn":"敦臨之吉，志在內也。","en":"'The good fortune consequent on the advance of honesty and generosity' is due to the will (of the subject of the line) being set on the subjects of (the first two lines of) the inner (trigram)."}}]}},{"binary":3,"binaryString":"000011","char":"䷓","id":20,"kanji":"觀","lowerBinaryString":"000","sameTrigram":false,"text":"Hexagram 20 is named 觀 (guān), \"Viewing\". Other variations include \"contemplation (view)\" and \"looking up\". Its inner (lower) trigram is ☷ (坤 kūn) field = (地) earth, and its outer (upper) trigram is ☴ (巽 xùn) ground = (風) wind.","translation":"Viewing","unicode":19923,"upperBinaryString":"011","yomi":"guān","ichingTexts":{"text":{"cn":"觀：盥而不薦，有孚顒若。","en":"Guan shows (how he whom it represents should be like) the worshipper who has washed his hands, but not (yet) presented his offerings - with sincerity and an appearance of dignity (commanding reverent regard)."},"tuanZhuan":{"cn":"大觀在上，順而巽，中正以觀天下。觀，盥而不薦，有孚顒若，下觀而化也。觀天之神道，而四時不忒，聖人以神道設教，而天下服矣。","en":"The great Manifester occupies an upper place (in the figure), which consists of (the trigrams whose attributes are) docility and flexibility. He is in the central position and his correct place, and thus exhibits (his lessons) to all under heaven. 'Guan shows its subject like a worshipper who has washed his hands, but not (yet) presented his offerings; - with sincerity and an appearance of dignity (commanding reverent regard):' - (all) beneath look to him and are transformed. When we contemplate the spirit-like way of Heaven, we see how the four seasons proceed without error. The sages, in accordance with (this) spirit-like way, laid down their instructions, and all under heaven yield submission to them."},"xiangZhuan":{"cn":"風行地上，觀；先王以省方，觀民設教。","en":"(The trigram representing) the earth, and that for wind moving above it, form Guan. The ancient kings, in accordance with this, examined the (different) regions (of the kingdom), to see the (ways of the) people, and set forth their instructions."},"commentaries":[{"number":1,"text":{"cn":"初六：童觀，小人无咎，君子吝。","en":"The first SIX, divided, shows the looking of a lad - not blamable in men of inferior rank, but matter for regret in superior men."},"xiangZhuan":{"cn":"初六童觀，小人道也。","en":"'The looking of a lad shown by the first six, (divided); indicates the way of the inferior people."}},{"number":2,"text":{"cn":"六二：闚觀，利女貞。","en":"The second SIX, divided, shows one peeping out from a door. It would be advantageous if it were (merely) the firm correctness of a female."},"xiangZhuan":{"cn":"窺觀女貞，亦可醜也。","en":"'The firm correctness of a woman, in peeping out from a door' is also a thing to be ashamed of (in a superior man)."}},{"number":3,"text":{"cn":"六三：觀我生，進退。","en":"The third SIX, divided, shows one looking at (the course of) his own life, to advance or recede (accordingly)."},"xiangZhuan":{"cn":"觀我生，進退；未失道也。","en":"'He looks at (the course of his own life, to advance or recede (accordingly):' - he will not err in the path (to be pursued)."}},{"number":4,"text":{"cn":"六四：觀國之光，利用賓于王。","en":"The fourth SIX, divided, shows one contemplating the glory of the kingdom. It will be advantageous for him, being such as he is, (to seek) to be a guest of the king."},"xiangZhuan":{"cn":"觀國之光，尚賓也。","en":"'He contemplates the glory of the kingdom:'(thence) arises the wish to be a guest (at court)."}},{"number":5,"text":{"cn":"九五：觀我生，君子无咎。","en":"The fifth NINE, undivided, shows its subject contemplating his own life(-course). A superior man, he will (thus) fall into no error."},"xiangZhuan":{"cn":"觀我生，觀民也。","en":"'He contemplates his own life(-course):' - he should (for this purpose) contemplate (the condition of) the people."}},{"number":6,"text":{"cn":"上九：觀其生，君子无咎。","en":"The sixth NINE, undivided, shows its subject contemplating his character to see if it be indeed that of a superior man. He will not fall into error."},"xiangZhuan":{"cn":"觀其生，志未平也。","en":"'He contemplates his own character:' - he cannot even yet let his mind be at rest."}}]}},{"binary":37,"binaryString":"100101","char":"䷔","id":21,"kanji":"噬嗑","lowerBinaryString":"100","sameTrigram":false,"text":"Hexagram 21 is named 噬嗑 (shì kè), \"Gnawing Bite\". Other variations include \"biting through\" and \"biting and chewing\". Its inner (lower) trigram is ☳ (震 zhèn) shake = (雷) thunder, and its outer trigram is ☲ (離 lí) radiance = (火) fire.","translation":"Gnawing Bite","unicode":19924,"upperBinaryString":"101","yomi":"shì kè","ichingTexts":{"text":{"cn":"噬嗑：亨。利用獄。","en":"Shi He indicates successful progress (in the condition of things which it supposes). It will be advantageous to use legal constraints."},"tuanZhuan":{"cn":"頤中有物，曰噬嗑，噬嗑而亨。剛柔分，動而明，雷電合而章。柔得中而上行，雖不當位，利用獄也。","en":"The existence of something between the jaws gives rise to the name Shi He (Union by means of biting through the intervening article). The Union by means of biting through the intervening article indicates 'the successful progress (denoted by the hexagram).' The strong and weak (lines) are equally divided (in the figure). Movement is denoted (by the lower trigram), and bright intelligence (by the upper); thunder and lightning uniting in them, and having brilliant manifestation. The weak (fifth) line is in the centre, and acts in its high position. Although it is not in its proper position, this is advantageous for the use of legal constraints."},"xiangZhuan":{"cn":"雷電噬嗑；先王以明罰敕法。","en":"(The trigrams representing) thunder and lightning form Shi He. The ancient kings, in accordance with this, framed their penalties with intelligence, and promulgated their laws."},"commentaries":[{"number":1,"text":{"cn":"初九：屨校滅趾，无咎。","en":"The first NINE, undivided, shows one with his feet in the stocks and deprived of his toes. There will be no error."},"xiangZhuan":{"cn":"屨校滅趾，不行也。","en":"'His feet are in the stocks, and he is deprived of his toes:' - there is no walking (to do evil)."}},{"number":2,"text":{"cn":"六二：噬膚滅鼻，无咎。","en":"The second SIX, divided, shows one biting through the soft flesh, and (going on to) bite off the nose. There will be no error."},"xiangZhuan":{"cn":"噬膚滅鼻，乘剛也。","en":"'He bites through the soft flesh, and (goes on) to bite off the nose:' - (the subject of the line) is mounted on the strong (first line)."}},{"number":3,"text":{"cn":"六三：噬臘肉，遇毒；小吝，无咎。","en":"The third SIX, divided, shows one gnawing dried flesh, and meeting with what is disagreeable. There will be occasion for some small regret, but no (great) error."},"xiangZhuan":{"cn":"遇毒，位不當也。","en":"'He meets with what is disagreeable and hurtful:' - his position is not the proper one for him."}},{"number":4,"text":{"cn":"九四：噬乾胏，得金矢，利艱貞，吉。","en":"The fourth NINE, undivided, shows one gnawing the flesh dried on the bone, and getting the pledges of money and arrows. It will be advantageous to him to realise the difficulty of his task and be firm,--in which case there will be good fortune."},"xiangZhuan":{"cn":"利艱貞吉，未光也。","en":"'It will be advantageous to him to realise the difficulty of his task and be firm, in which case there will be good fortune:' - his light has not yet been sufficiently displayed."}},{"number":5,"text":{"cn":"六五：噬乾肉，得黃金，貞厲，无咎。","en":"The fifth SIX, divided, shows one gnawing at dried flesh, and finding the yellow gold. Let him be firm and correct, realising the peril (of his position). There will be no error."},"xiangZhuan":{"cn":"貞厲无咎，得當也。","en":"'Let him be firm and correct, realising the peril (of his position), and there will be no error:' - he will possess every quality appropriate (to his position and task)."}},{"number":6,"text":{"cn":"上九：何校滅耳，凶。","en":"The sixth NINE, undivided, shows one wearing the cangue, and deprived of his ears. There will be evil."},"xiangZhuan":{"cn":"何校滅耳，聰不明也。","en":"'He wears the cangue and is deprived of his ears:' - he hears, but will not understand."}}]}},{"binary":41,"binaryString":"101001","char":"䷕","id":22,"kanji":"賁","lowerBinaryString":"101","sameTrigram":false,"text":"Hexagram 22 is named 賁 (bì), \"Adorning\". Other variations include \"grace\" and \"luxuriance\". Its inner (lower) trigram is ☲ (離 lí) radiance = (火) fire, and its outer (upper) trigram is ☶ (艮 gèn) bound = (山) mountain.","translation":"Adorning","unicode":19925,"upperBinaryString":"001","yomi":"bì","ichingTexts":{"text":{"cn":"賁：亨。小利有攸往。","en":"Bi indicates that there should be free course (in what it denotes). There will be little advantage (however) if it be allowed to advance (and take the lead)."},"tuanZhuan":{"cn":"賁，亨；柔來而文剛，故亨。分剛上而文柔，故小利有攸往。天文也；文明以止，人文也。觀乎天文，以察時變；觀乎人文，以化成天下。","en":"(When it is said that) Bi indicates that there should be free course (in what it denotes): - (We see) the weak line coming and ornamenting the strong lines (of the lower trigram), and hence (it is said that ornament) 'should have free course.' On the other hand, the strong line above ornaments the weak ones (of the upper trigram), and hence (it is said) that 'there will be little advantage, if (ornament) be allowed to advance (and take the lead).' (This is illustrated in the) appearances that ornament the sky. Elegance and intelligence (denoted by the lower trigram) regulated by the arrest (denoted by the upper) suggest the observances that adorn human (society). We look at the ornamental figures of the sky, and thereby ascertain the changes of the seasons. We look at the ornamental observances of society, and understand how the processes of transformation are accomplished all under heaven."},"xiangZhuan":{"cn":"山下有火，賁；君子以明庶政，无敢折獄。","en":"(The trigram representing) a mountain and that for fire under it form Bi. The superior man, in accordance with this, throws a brilliancy around his various processes of government, but does not dare (in a similar way) to decide cases of criminal litigation."},"commentaries":[{"number":1,"text":{"cn":"初九：賁其趾，舍車而徒。","en":"The first NINE, undivided, shows one adorning (the way of) his feet. He can discard a carriage and walk on foot."},"xiangZhuan":{"cn":"舍車而徒，義弗乘也。","en":"'He can discard a carriage and walk on foot:' - righteousness requires that he should not ride."}},{"number":2,"text":{"cn":"六二：賁其須。","en":"The second SIX, divided, shows one adorning his beard."},"xiangZhuan":{"cn":"賁其須，與上興也。","en":"'He adorns his beard:' - he rouses himself to action (only) along with the (subject of the) line above."}},{"number":3,"text":{"cn":"九三：賁如濡如，永貞吉。","en":"The third NINE, undivided, shows its subject with the appearance of being adorned and bedewed (with rich favours). But let him ever maintain his firm correctness, and there will be good fortune."},"xiangZhuan":{"cn":"永貞之吉，終莫之陵也。","en":"'The good fortune consequent on his ever maintaining firm correctness' is due to this, - that to the end no one will insult him."}},{"number":4,"text":{"cn":"六四：賁如皤如，白馬翰如，匪寇婚媾。","en":"The fourth SIX, divided, shows one looking as if adorned, but only in white. As if (mounted on) a white horse, and furnished with wings, (he seeks union with the subject of the first line), while (the intervening third pursues), not as a robber, but intent on a matrimonial alliance."},"xiangZhuan":{"cn":"六四，當位疑也。匪寇婚媾，終无尤也。","en":"'The place occupied by the fourth six, (divided),' affords ground for doubt (as to its subject); but '(as the subject of the third pursues) not as a robber, but as intent on a matrimonial alliance,' he will in the end have no grudge against him."}},{"number":5,"text":{"cn":"六五：賁于丘園，束帛戔戔，吝，終吉。","en":"The fifth SIX, divided, shows its subject adorned by (the occupants of) the heights and gardens. He bears his roll of silk, small and slight. He may appear stingy; but there will be good fortune in the end."},"xiangZhuan":{"cn":"六五之吉，有喜也。","en":"'The good fortune falling to the fifth six, (divided); affords occasion for joy."}},{"number":6,"text":{"cn":"上九：白賁，无咎。","en":"The sixth NINE, undivided, shows one with white as his (only) ornament. There will be no error."},"xiangZhuan":{"cn":"白賁无咎，上得志也。","en":"'The freedom from error attached to (the subject of) the topmost line, with no ornament but the (simple white),' shows how he has attained his aim."}}]}},{"binary":1,"binaryString":"000001","char":"䷖","id":23,"kanji":"剝","lowerBinaryString":"000","sameTrigram":false,"text":"Hexagram 23 is named 剝 (bō), \"Stripping\". Other variations include \"splitting apart\" and \"flaying\". Its inner trigram is ☷ (坤 kūn) field = (地) earth, and its outer trigram is ☶ (艮 gèn) bound = (山) mountain.","translation":"Stripping","unicode":19926,"upperBinaryString":"001","yomi":"bō","ichingTexts":{"text":{"cn":"剝：不利有攸往。","en":"Bo indicates that (in the state which it symbolises) it will not be advantageous to make a movement in any direction whatever."},"tuanZhuan":{"cn":"剝，剝也，柔變剛也。不利有攸往，小人長也。順而止之，觀象也。君子尚消息盈虛，天行也。","en":"Bo denotes overthrowing or being overthrown. We see (in the figure) the weak lines (threatening to) change the (last) strong line (into one of themselves). That 'it will not be advantageous to make a movement in any direction whatever' appears from the fact that the small men are (now) growing and increasing. The superior man acts according to (the exigency of the time), and stops all forward movement, looking at the (significance of the) symbolic figures (in the hexagram). He values the processes of decrease and increase, of fulness and decadence, (as seen) in the movements of the heavenly bodies."},"xiangZhuan":{"cn":"山附地上，剝；上以厚下，安宅。","en":"(The trigrams representing) the earth, and (above it) that for a mountain, which adheres to the earth, form Bo. Superiors, in accordance with this, seek to strengthen those below them, to secure the peace and stability of their own position."},"commentaries":[{"number":1,"text":{"cn":"初六：剝床以足，蔑貞凶。","en":"The first SIX, divided, shows one overturning the couch by injuring its legs. (The injury will go on to) the destruction of (all) firm correctness, and there will be evil."},"xiangZhuan":{"cn":"剝床以足，以滅下也。","en":"'He overthrows the couch by injuring its legs:' - thus (he commences) his work of ruin with what is lowest (in the superior man)."}},{"number":2,"text":{"cn":"六二：剝床以辨，蔑貞凶。","en":"The second SIX, divided, shows one overthrowing the couch by injuring its frame. (The injury will go on to) the destruction of (all) firm correctness, and there will be evil."},"xiangZhuan":{"cn":"剝床以辨，未有與也。","en":"'He destroys the couch by injuring its frame:' - (the superior man) has as yet no associates."}},{"number":3,"text":{"cn":"六三：剝之，无咎。","en":"The third SIX, divided, shows its subject among the overthrowers; but there will be no error."},"xiangZhuan":{"cn":"剝之无咎，失上下也。","en":"That 'there will be no error on the part of this one among the overthrowers' arises from the difference between him and the others above and below."}},{"number":4,"text":{"cn":"六四：剝床以膚，凶。","en":"The fourth SIX, divided, shows its subject having overthrown the couch, and (going to injure) the skin (of him who lies on it). There will be evil."},"xiangZhuan":{"cn":"剝床以膚，切近災也。","en":"'He has overthrown the couch, and (proceeds to injure) the skin (of him who lies on it):' - calamity is very near at hand."}},{"number":5,"text":{"cn":"六五：貫魚，以宮人寵，无不利。","en":"The fifth SIX, divided, shows (its subject leading on the others like) a string of fishes, and (obtaining for them) the favour that lights on the inmates of the palace. There will be advantage in every way."},"xiangZhuan":{"cn":"以宮人寵，終无尤也。","en":"'He obtains for them the favour that lights on the inmates of the palace:' - in the end there will be no grudge against him."}},{"number":6,"text":{"cn":"上九：碩果不食，君子得輿，小人剝廬。","en":"The topmost NINE, undivided, shows its subject (as) a great fruit which has not been eaten. The superior man finds (the people again) as a chariot carrying him. The small men (by their course) overthrow their own dwellings."},"xiangZhuan":{"cn":"君子得輿，民所載也。小人剝廬，終不可用也。","en":"'The superior man finds himself in a carriage:' - he is carried along by the people. 'The small men (by their course) overthrow their own dwellings:' - they can. never again be of use to them."}}]}},{"binary":32,"binaryString":"100000","char":"䷗","id":24,"kanji":"復","lowerBinaryString":"100","sameTrigram":false,"text":"Hexagram 24 is named 復 (fù), \"Returning\". Other variations include \"return (the turning point)\". Its inner trigram is ☳ (震 zhèn) shake = (雷) thunder, and its outer trigram is ☷ (坤 kūn) field = (地) earth.","translation":"Returning","unicode":19927,"upperBinaryString":"000","yomi":"fù","ichingTexts":{"text":{"cn":"復：亨。出入无疾，朋來无咎。反復其道，七日來復，利有攸往。","en":"Fu indicates that there will be free course and progress (in what it denotes). (The subject of it) finds no one to distress him in his exits and entrances; friends come to him, and no error is committed . He will return and repeat his (proper) course. In seven days comes his return. There will be advantage in whatever direction movement is made."},"tuanZhuan":{"cn":"復亨；剛反，動而以順行，是以出入无疾，朋來无咎。反復其道，七日來復，天行也。利有攸往，剛長也。復其見天地之心乎？","en":"'Fu indicates the free course and progress (of what it denotes):' - it is the coming back of what is intended by the undivided line. (Its subject's) actions show movement directed by accordance with natural order. Hence 'he finds no one to distress him in his exits and entrances,' and 'friends come to him, and no error is committed.' 'He will return and repeat his proper course; in seven days comes his return:' - such is the movement of the heavenly (revolution). 'There will be advantage in whatever direction movement is made: - the strong lines are growing and increasing. Do we not see in Fu the mind of heaven and earth?"},"xiangZhuan":{"cn":"雷在地中，復；先王以至日閉關，商旅不行，后不省方。","en":"(The trigram representing) the earth and that for thunder in the midst of it form Fu. The ancient kings, in accordance with this, on the day. of the (winter) solstice, shut the gates of the passes (from one state to another), so that the travelling merchants could not (then) pursue their journeys, nor the princes go on with the inspection of their states."},"commentaries":[{"number":1,"text":{"cn":"初九：不遠復，无祗悔，元吉。","en":"The first NINE, undivided, shows its subject returning (from an error) of no great extent, which would not proceed to anything requiring repentance. There will be great good fortune."},"xiangZhuan":{"cn":"不遠之復，以修身也。","en":"'Returning (from an error) of no great extent' is the prelude to the cultivation of the person."}},{"number":2,"text":{"cn":"六二：休復，吉。","en":"The second SIX, divided, shows the admirable return (of its subject). There will be good fortune."},"xiangZhuan":{"cn":"休復之吉，以下仁也。","en":"'The good fortune attendant on the admirable return (of the subject of the second line)' is due to his condescension to the virtuous (subject of the line) below."}},{"number":3,"text":{"cn":"六三：頻復，厲无咎。","en":"The third SIX, divided, shows one who has made repeated returns. The position is perilous, but there will be no error."},"xiangZhuan":{"cn":"頻復之厲，義无咎也。","en":"Notwithstanding 'the perilous position of him who has made many returns,' there will be no error through (his aiming after righteousness)."}},{"number":4,"text":{"cn":"六四：中行獨復。","en":"The fourth SIX, divided, shows its subject moving right in the centre (among those represented by the other divided lines), and yet returning alone (to his proper path)."},"xiangZhuan":{"cn":"中行獨復，以從道也。","en":"'He moves right in the centre (among those represented by the other divided lines), and yet returns alone:' - his object is to pursue the (proper) path."}},{"number":5,"text":{"cn":"六五：敦復，无悔。","en":"The fifth SIX, divided, shows the noble return of its subject. There will be no ground for repentance."},"xiangZhuan":{"cn":"敦復无悔，中以自考也。","en":"'The noble return, giving no ground for repentance,' is due to (the subject of the line) striving to perfect himself in accordance with his central position."}},{"number":6,"text":{"cn":"上六：迷復，凶，有災眚。用行師，終有大敗，以其國君，凶；至于十年，不克征。","en":"The topmost SIX, divided, shows its subject all astray on the subject of returning. There will be evil. There will be calamities and errors. If with his views he put the hosts in motion, the end will be a great defeat, whose issues will extend to the ruler of the state. Even in ten years he will not be able to repair the disaster."},"xiangZhuan":{"cn":"迷復之凶，反君道也。","en":"'The evil consequent on being all astray on the subject of returning' is because the course pursued is contrary to the proper course for a ruler."}}]}},{"binary":39,"binaryString":"100111","char":"䷘","id":25,"kanji":"無妄","lowerBinaryString":"100","sameTrigram":false,"text":"Hexagram 25 is named 無妄 (wú wàng), \"Without Embroiling\". Other variations include \"innocence (the unexpected)\" and \"pestilence\". Its inner trigram is ☳ (震 zhèn) shake = (雷) thunder, and its outer trigram is ☰ (乾 qián) force = (天) heaven.","translation":"Without Embroiling","unicode":19928,"upperBinaryString":"111","yomi":"wú wàng","ichingTexts":{"text":{"cn":"无妄：元亨，利貞。其匪正有眚，不利有攸往。","en":"Wu Wang indicates great progress and success, while there will be advantage in being firm and correct. If (its subject and his action) be not correct, he will fall into errors, and it will not be advantageous for him to move in any direction."},"tuanZhuan":{"cn":"无妄，剛自外來，而為主於內。動而健，剛中而應，大亨以正，天之命也。其匪正有眚，不利有攸往。无妄之往，何之矣？天命不佑，行矣哉？","en":"In Wu Wang we have the strong (first) line come from the outer (trigram), and become in the inner trigram lord (of the whole figure); we have (the attributes of) motive power and strength; we have the strong line (of the fifth place) in the central position, and responded to (by the weak second): - there will be 'great progress proceeding from correctness; such is the appointment of Heaven. 'If (its subject and his action) be not correct, he will fall into errors, and it will not be advantageous for him to move in any direction:' - whither can he (who thinks he is) free from all insincerity, (and yet is as here described) proceed? Can anything be done (advantageously) by him whom the (will and) appointment of Heaven do not help?"},"xiangZhuan":{"cn":"天下雷行，物與无妄；先王以茂對時，育萬物。","en":"The thunder rolls all under the sky, and to (every)thing there is given (its nature), free from all insincerity. The ancient kings, in accordance with this, (made their regulations) in complete accordance with the seasons, thereby nourishing all things."},"commentaries":[{"number":1,"text":{"cn":"初九：无妄，往吉。","en":"The first NINE, undivided, shows its subject free from all insincerity. His advance will be accompanied with good fortune."},"xiangZhuan":{"cn":"无妄之往，得志也。","en":"When 'he who is free from insincerity makes any movement,' he will get what he desires."}},{"number":2,"text":{"cn":"六二：不耕獲，不菑畬，則利有攸往。","en":"The second SIX, divided, shows one who reaps without having ploughed (that he might reap), and gathers the produce of his third year's fields without having cultivated them the first year for that end. To such a one there will be advantage in whatever direction he may move."},"xiangZhuan":{"cn":"不耕獲，未富也。","en":"'He reaps without having ploughed:' - (the thought of) riches to be got had not risen (in his mind)."}},{"number":3,"text":{"cn":"六三：无妄之災，或繫之牛，行人之得，邑人之災。","en":"The third SIX, divided, shows calamity happening to one who is free from insincerity - as in the case of an ox that has been tied up. A passer by finds it (and carries it off), while the people in the neighbourhood have the calamity (of being accused and. apprehended)."},"xiangZhuan":{"cn":"行人得牛，邑人災也。","en":"'The passer-by gets the ox:' - this proves a calamity to the people of the neighbourhood."}},{"number":4,"text":{"cn":"九四：可貞，无咎。","en":"The fourth NINE, undivided, shows (a case) in which, if its subject can remain firm and correct, there will be no error."},"xiangZhuan":{"cn":"可貞无咎，固有之也。","en":"'If he can remain firm and correct there will be no error:' - he firmly holds fast (his correctness)."}},{"number":5,"text":{"cn":"九五：无妄之疾，勿藥有喜。","en":"The fifth NINE, undivided, shows one who is free from insincerity, and yet has fallen ill. Let him not use medicine, and he will have occasion for joy (in his recovery)."},"xiangZhuan":{"cn":"无妄之藥，不可試也。","en":"'Medicine in the case of one who is free from insincerity!' - it should not be tried (at all)."}},{"number":6,"text":{"cn":"上九：无妄，行有眚，无攸利。","en":"The topmost NINE, undivided, shows its subject free from insincerity, yet sure to fall into error, if he take action. (His action) will not be advantageous in any way."},"xiangZhuan":{"cn":"无妄之行，窮之災也。","en":"'The action (in this case) of one who is free from insincerity' will occasion the calamity arising from action (when the time for it is) exhausted."}}]}},{"binary":57,"binaryString":"111001","char":"䷙","id":26,"kanji":"大畜","lowerBinaryString":"111","sameTrigram":false,"text":"Hexagram 26 is named 大畜 (dà xù), \"Great Accumulating\". Other variations include \"the taming power of the great\", \"great storage\", and \"potential energy\". Its inner trigram is ☰ (乾 qián) force = (天) heaven, and its outer trigram is ☶ (艮 gèn) bound = (山) mountain.","translation":"Great Accumulating","unicode":19929,"upperBinaryString":"001","yomi":"dà xù","ichingTexts":{"text":{"cn":"大畜：利貞，不家食吉，利涉大川。","en":"Under the conditions of Da Xu it will be advantageous to be firm and correct. (If its subject do not seek to) enjoy his revenues in his own family (without taking service at court), there will be good fortune. It will be advantageous for him to cross the great stream."},"tuanZhuan":{"cn":"大畜，剛健篤實輝光，日新其德，剛上而尚賢。能止健，大正也。不家食吉，養賢也。利涉大川，應乎天也。","en":"In (the trigrams composing) Da Xu we have (the attributes) of the greatest strength and of substantial solidity, which emit a brilliant light; and indicate a daily renewal of his virtue (by the subject of it). The strong line is in the highest place, and suggests the value set on talents and virtue; there is power (in the upper trigram) to keep the strongest in restraint: - all this shows 'the great correctness' (required in the hexagram). 'The good fortune attached to the subject's not seeking to enjoy his revenues in his own family' shows how talents and virtue are nourished. 'It will be advantageous to cross the great stream:' - (the fifth line, representing the ruler,) is responded to by (the second, the central line of Qian, representing) Heaven."},"xiangZhuan":{"cn":"天在山中，大畜；君子以多識前言往行，以畜其德。","en":"(The trigram representing) a mountain, and in the midst of it that (representing) heaven, form Da Xu. The superior man, in accordance with this, stores largely in his memory the words and deeds of former men, to subserve the accumulation of his virtue."},"commentaries":[{"number":1,"text":{"cn":"初九：有厲利已。","en":"The first NINE, undivided, shows its subject in a position of peril. It will be advantageous for him to stop his advance."},"xiangZhuan":{"cn":"有厲利已，不犯災也。","en":"'He is in a position of peril; it will be advantageous for him to stop his advance:' - he should not rashly expose himself to calamity."}},{"number":2,"text":{"cn":"九二：輿說輹。","en":"The second NINE, undivided, shows a carriage with the strap under it removed."},"xiangZhuan":{"cn":"輿說輹，中无尤也。","en":"'(He is as) a carriage from which the strap under it has been removed:' - being in the central position, he will incur no blame."}},{"number":3,"text":{"cn":"九三：良馬逐，利艱貞。曰閑輿衛，利有攸往。","en":"The third NINE, undivided, shows its subject urging his way with good horses. It will be advantageous for him to realise the difficulty (of his course), and to be firm and correct, exercising himself daily in his charioteering and methods of defence; then there will be advantage in whatever direction he may advance."},"xiangZhuan":{"cn":"利有攸往，上合志也。","en":"'There will be advantage in whatever direction he may advance:' - (the subject of) the topmost line is of the same mind with him."}},{"number":4,"text":{"cn":"六四：童牛之牿，元吉。","en":"The fourth six, divided, shows the young bull, (and yet) having the piece of wood over his horns. There will be great good fortune."},"xiangZhuan":{"cn":"六四元吉，有喜也。","en":"'The great good fortune indicated by the fourth six, (divided),' shows that there is occasion for joy."}},{"number":5,"text":{"cn":"六五：豶豕之牙，吉。","en":"The fifth six, divided, shows the teeth of a castrated hog. There will be good fortune."},"xiangZhuan":{"cn":"六五之吉，有慶也。","en":"'The good fortune indicated by the fifth six, (divided),' shows that there is occasion for congratulation."}},{"number":6,"text":{"cn":"上九：何天之衢，亨。","en":"The sixth NINE, undivided, shows its subject (as) in command of the firmament of heaven. There will be progress."},"xiangZhuan":{"cn":"何天之衢，道大行也。","en":"'In command of the firmament of heaven:' - the way is grandly open for movement."}}]}},{"binary":33,"binaryString":"100001","char":"䷚","id":27,"kanji":"頤","lowerBinaryString":"100","sameTrigram":false,"text":"Hexagram 27 is named 頤 (yí), \"Swallowing\". Other variations include \"the corners of the mouth (providing nourishment)\", \"jaws\" and \"comfort/security\". Its inner trigram is ☳ (震 zhèn) shake = (雷) thunder, and its outer trigram is ☶ (艮 gèn) bound = (山) mountain.","translation":"Swallowing","unicode":19930,"upperBinaryString":"001","yomi":"yí","ichingTexts":{"text":{"cn":"頤：貞吉。觀頤，自求口實。","en":"Yi indicates that with firm correctness there will be good fortune (in what is denoted by it). We must look at what we are seeking to nourish, and by the exercise of our thoughts seek for the proper aliment."},"tuanZhuan":{"cn":"頤貞吉，養正則吉也。觀頤，觀其所養也；自求口實，觀其自養也。天地養萬物，聖人養賢，以及萬民；頤之時大矣哉！","en":"'Yi indicates that with firm correctness there will be good fortune:' - when the nourishing is correct, there will be good fortune. 'We must look at what we are seeking to nourish:' - we must look at those whom we wish to nourish. 'We must by the exercise of our thoughts seek the proper aliment:' - we must look to our own nourishing of ourselves. Heaven and earth nourish all things. The sages nourish men of talents and virtue, by them to reach to the myriads of the people. Great is (the work intended by this) nourishing in its time!"},"xiangZhuan":{"cn":"山下有雷，頤；君子以慎言語，節飲食。","en":"(The trigram representing) a mountain and under it that for thunder form Yi. The superior man, in accordance with this, (enjoins) watchfulness over our words, and the temperate regulation of our eating and drinking."},"commentaries":[{"number":1,"text":{"cn":"初九：舍爾靈龜，觀我朵頤，凶。","en":"The first NINE, undivided, (seems to be thus addressed), 'You leave your efficacious tortoise, and look at me till your lower jaw hangs down.' There will be evil."},"xiangZhuan":{"cn":"觀我朵頤，亦不足貴也。","en":"'You look at me till your (lower) jaw hangs down:' - (the subject of the line) is thus shown unfit to be thought noble."}},{"number":2,"text":{"cn":"六二：顛頤，拂經，于丘頤，征凶。","en":"The second SIX, divided, shows one looking downwards for nourishment, which is contrary to what is proper; or seeking it from the height (above), advance towards which will lead to evil."},"xiangZhuan":{"cn":"六二征凶，行失類也。","en":"'The evil of advance by the subject of the second SIX, (divided),' is owing to his leaving in his movements his proper associates."}},{"number":3,"text":{"cn":"六三：拂頤，貞凶，十年勿用，无攸利。","en":"The third SIX, divided, shows one acting contrary to the method of nourishing. However firm he may be, there will be evil. For ten years let him not take any action, (for) it will not be in any way advantageous."},"xiangZhuan":{"cn":"十年勿用，道大悖也。","en":"'For ten years let him not take any action:' - his course is greatly opposed (to what is right)."}},{"number":4,"text":{"cn":"六四：顛頤，吉，虎視眈眈，其欲逐逐，无咎。","en":"The fourth SIX, divided, shows one looking downwards for (the power to) nourish. There will be good fortune. Looking with a tiger's downward unwavering glare, and with his desire that impels him to spring after spring, he will fall into no error."},"xiangZhuan":{"cn":"顛頤之吉，上施光也。","en":"'The good fortune attached to looking downwards for (the power to) nourish,' shows how brilliant will be the diffusion (of that power) from (the subject of the line's) superior position."}},{"number":5,"text":{"cn":"六五：拂經，居貞吉，不可涉大川。","en":"The fifth SIX, divided, shows one acting contrary to what is regular and proper; but if he abide in firmness, there will be good fortune. He should not, (however, try to) cross the great stream."},"xiangZhuan":{"cn":"居貞之吉，順以從上也。","en":"'The good fortune from abiding in firmness' is due to the docility (of the subject of the line) in following (the subject of the line) above."}},{"number":6,"text":{"cn":"上九：由頤，厲吉，利涉大川。","en":"The sixth NINE, undivided, shows him from whom comes the nourishing. His position is perilous, but there will be good fortune. It will be advantageous to cross the great stream."},"xiangZhuan":{"cn":"由頤厲吉，大有慶也。","en":"'The good fortune, notwithstanding the peril of his position, of him from whom comes the nourishing,' affords great cause for congratulation."}}]}},{"binary":30,"binaryString":"011110","char":"䷛","id":28,"kanji":"大過","lowerBinaryString":"011","sameTrigram":false,"text":"Hexagram 28 is named 大過 (dà guò), \"Great Exceeding\". Other variations include \"preponderance of the great\", \"great surpassing\" and \"critical mass\". Its inner trigram is ☴ (巽 xùn) ground = (風) wind, and its outer trigram is ☱ (兌 duì) open = (澤) swamp.","translation":"Great Exceeding","unicode":19931,"upperBinaryString":"110","yomi":"dà guò","ichingTexts":{"text":{"cn":"大過：棟橈，利有攸往，亨。","en":"Da Guo suggests to us a beam that is weak. There will be advantage in moving (under its conditions) in any direction whatever; there will be success."},"tuanZhuan":{"cn":"大過，大者過也。棟橈，本末弱也。剛過而中，巽而說行，利有攸往，乃亨。大過之時大矣哉！","en":"Da Guo shows the great ones (= the undivided lines) in excess. In 'the beam that is weak' we see weakness both in the lowest and the topmost (lines). The strong lines are in excess, but (two of them) are in the central positions. The action (of the hexagram is represented by the symbols of) flexibility and satisfaction. (Hence it is said), 'There will be advantage in moving in any direction whatever; yea, there will be success. ' Great indeed is (the work to be done in) this very extraordinary time."},"xiangZhuan":{"cn":"澤滅木，大過；君子以獨立不懼，遯世无悶。","en":"(The trigram representing) trees hidden beneath that for the waters of a marsh forms Da Guo. The superior man, in accordance with this, stands up alone and has no fear, and keeps retired from the world without regret."},"commentaries":[{"number":1,"text":{"cn":"初六：藉用白茅，无咎。","en":"The first SIX, divided, shows one placing mats of the white m?o grass under things set on the ground. There will be no error."},"xiangZhuan":{"cn":"藉用白茅，柔在下也。","en":"'He places mats of the white m?o grass under things set on the ground:' - he feels his weakness and his being in the lowest place, (and uses extraordinary care)."}},{"number":2,"text":{"cn":"九二：枯楊生稊，老夫得其女妻，无不利。","en":"The second NINE, undivided, shows a decayed willow producing shoots, or an old husband in possession of his young wife. There will be advantage in every way."},"xiangZhuan":{"cn":"老夫女妻，過以相與也。","en":"'An old husband and a young wife:' - such association is extraordinary."}},{"number":3,"text":{"cn":"九三：棟橈，凶。","en":"The third NINE, undivided, shows a beam that is weak. There will be evil."},"xiangZhuan":{"cn":"棟橈之凶，不可以有輔也。","en":"'The evil connected with the beam that is weak' arises from this, that no help can be given (to the condition thus represented)."}},{"number":4,"text":{"cn":"九四：棟隆，吉；有它吝。","en":"The fourth NINE, undivided, shows a beam curving upwards. There will be good fortune. If (the subject of it) looks for other (help but that of line one), there will be cause for regret."},"xiangZhuan":{"cn":"棟隆之吉，不橈乎下也。","en":"'The good fortune connected with the beam curving upwards' arises from this, that it does not bend towards what is below."}},{"number":5,"text":{"cn":"九五：枯楊生華，老婦得士夫，无咎无譽。","en":"The fifth NINE, undivided, shows a decayed willow producing flowers, or an old wife in possession of her young husband. There will be occasion neither for blame nor for praise."},"xiangZhuan":{"cn":"枯楊生華，何可久也。老婦士夫，亦可醜也。","en":"'A decayed willow produces flowers:' - but how can this secure its long continuance? 'An old wife and a young husband:' - this also is a thing to be ashamed of."}},{"number":6,"text":{"cn":"上六：過涉滅頂，凶，无咎。","en":"The topmost SIX, divided, shows its subject with extraordinary (boldness) wading through a stream, till the water hides the crown of his head. There will be evil, but no ground for blame."},"xiangZhuan":{"cn":"過涉之凶，不可咎也。","en":"'Evil follows wading with (extraordinary) boldness (through the stream):' - but (the act) affords no ground for blame."}}]}},{"binary":18,"binaryString":"010010","char":"䷜","id":29,"kanji":"坎","lowerBinaryString":"010","sameTrigram":true,"text":"Hexagram 29 is named 坎 (kǎn), \"Gorge\". Other variations include \"the abyss\" (in the oceanographic sense) and \"repeated entrapment\". Its inner trigram is ☵ (坎 kǎn) gorge = (水) water, and its outer trigram is identical.","translation":"Gorge","unicode":19932,"upperBinaryString":"010","yomi":"kǎn","ichingTexts":{"text":{"cn":"坎：習坎，有孚，維心亨，行有尚。","en":"Kan, here repeated, shows the possession of sincerity, through which the mind is. penetrating. Action (in accordance with this) will be of high value."},"tuanZhuan":{"cn":"習坎，重險也。水流而不盈，行險而不失其信。維心亨，乃以剛中也。行有尚，往有功也。天險不可升也，地險山川丘陵也，王公設險以守其國，坎之時用大矣哉！","en":"Kan repeated shows us one defile succeeding another. This is the nature of water; - it flows on, without accumulating its volume (so as to overflow); it pursues its way through a dangerous defile, without losing its true (nature). That 'the mind is penetrating' is indicated by the strong (line) in the centre. That 'action (in accordance with this) will be of high value' tells us that advance will be followed by achievement. The dangerous (height) of heaven cannot be ascended; the difficult places of the earth are mountains, rivers, hills, and mounds. Kings and princes arrange by means of such strengths, to maintain their territories. Great indeed is the use of (what is here) taught about seasons of peril."},"xiangZhuan":{"cn":"水洊至，習坎；君子以常德行，習教事。","en":"(The representation of) water flowing on continuously forms the repeated Kan. The superior man, in accordance with this, maintains constantly the virtue (of his heart) and (the integrity of) his conduct, and practises the business of instruction."},"commentaries":[{"number":1,"text":{"cn":"初六：習坎，入于坎窞，凶。","en":"The first SIX, divided, shows its subject in the double defile, and (yet) entering a cavern within it. There will be evil."},"xiangZhuan":{"cn":"習坎入坎，失道凶也。","en":"'In the double defile, he enters a cavern within it:' - he has missed his (proper) way, and there will be evil."}},{"number":2,"text":{"cn":"九二：坎有險，求小得。","en":"The second NINE, undivided, shows its subject in all the peril of the defile. He will, however, get a little (of the deliverance) that he seeks."},"xiangZhuan":{"cn":"求小得，未出中也。","en":"'He will get a little (of the deliverance) that he seeks:' - he will not yet escape from his environed position."}},{"number":3,"text":{"cn":"六三：來之坎坎，險且枕，入于坎窞，勿用。","en":"The third SIX, divided, shows its subject, whether he comes or goes ( =descends or ascends), confronted by a defile. All is peril to him and unrest. (His endeavours) will lead him into the cavern of the pit. There should be no action (in such a case)."},"xiangZhuan":{"cn":"來之坎坎，終无功也。","en":"'Whether he comes or goes, he is confronted by a defile:' - he will never (in such circumstances) achieve any success."}},{"number":4,"text":{"cn":"六四：樽酒簋貳，用缶，納約自牖，終无咎。","en":"The fourth SIX, divided, shows its subject (at a feast), with (simply) a bottle of spirits, and a subsidiary basket of rice, while (the cups and bowls) are (only) of earthenware. He introduces his important lessons (as his ruler's) intelligence admits. There will in the end be no error."},"xiangZhuan":{"cn":"樽酒簋貳，剛柔際也。","en":"'(Nothing but) a bottle of spirits and a subsidiary basket of rice:' - (these describe) the meeting at this point of (those who are represented by) the strong and weak lines."}},{"number":5,"text":{"cn":"九五：坎不盈，祗既平，无咎。","en":"The fifth NINE, undivided, shows the water of the defile not yet full, (so that it might flow away); but order will (soon) be brought about. There will be no error."},"xiangZhuan":{"cn":"坎不盈，中未大也。","en":"'The water in the defile is not full (so as to flow away):' - (the virtue indicated by) the central situation is not yet (sufficiently) great."}},{"number":6,"text":{"cn":"上六：係用徽纆，寘于叢棘，三歲不得，凶。","en":"The topmost SIX, divided, shows its subject bound with cords of three strands or two strands, and placed in the thicket of thorns. But in three years he does not learn the course for him to pursue. There will be evil."},"xiangZhuan":{"cn":"上六失道，凶三歲也。","en":"'The sixth line, divided, shows its subject missing his (proper) course:' - 'there will be evil for three years.'"}}]}},{"binary":45,"binaryString":"101101","char":"䷝","id":30,"kanji":"離","lowerBinaryString":"101","sameTrigram":true,"text":"Hexagram 30 is named 離 (lí), \"Radiance\". Other variations include \"the clinging, fire\" and \"the net\". Its inner trigram is ☲ (離 lí) radiance = (火) fire, and its outer trigram is identical. The origin of the character has its roots in symbols of long-tailed birds such as the peacock or the legendary phoenix.","translation":"Radiance","unicode":19933,"upperBinaryString":"101","yomi":"lí","ichingTexts":{"text":{"cn":"離：利貞，亨。畜牝牛，吉。","en":"Li indicates that, (in regard to what it denotes), it will be advantageous to be firm and correct, and that thus there will be free course and success. Let (its subject) also nourish (a docility like that of) the cow, and there will be good fortune."},"tuanZhuan":{"cn":"離，麗也；日月麗乎天，百穀草木麗乎土，重明以麗乎正，乃化成天下。柔麗乎中正，故亨；是以畜牝牛吉也。","en":"Li means being attached to. The sun and moon have their place in the sky. All the grains, grass, and trees have their place on the earth. The double brightness (of the two trigrams) adheres to what is correct, and the result is the transforming and perfecting all under the sky. The weak (second line) occupies the middle and correct position, and gives the indication of 'a free and successful course;' and, moreover, 'nourishing (docility like that of) the cow' will lead to good fortune."},"xiangZhuan":{"cn":"明兩作離，大人以繼明照于四方。","en":"(The trigram for) brightness, repeated, forms Li. The great man, in accordance with this, cultivates more and more his brilliant (virtue), and diffuses its brightness over the four quarters (of the land)."},"commentaries":[{"number":1,"text":{"cn":"初九：履錯然，敬之无咎。","en":"The first NINE, undivided, shows one ready to move with confused steps. But he treads at the same time reverently, and there will be no mistake."},"xiangZhuan":{"cn":"履錯之敬，以辟咎也。","en":"'The reverent attention directed to his confused steps' is the way by which error is avoided."}},{"number":2,"text":{"cn":"六二：黃離，元吉。","en":"The second SIX, divided, shows its subject in his place in yellow. There will be great good fortune."},"xiangZhuan":{"cn":"黃離元吉，得中道也。","en":"'The great good fortune (from the subject of the second line) occupying his place in yellow' is owing to his holding the course of the due mean."}},{"number":3,"text":{"cn":"九三：日昃之離，不鼓缶而歌，則大耋之嗟，凶。","en":"The third NINE, undivided, shows its subject in a position like that of the declining sun. Instead of playing on his instrument of earthenware, and singing to it, he utters the groans of an old man of eighty. There will be evil."},"xiangZhuan":{"cn":"日昃之離，何可久也。","en":"'A position like that of the declining sun:' - how can it continue long?"}},{"number":4,"text":{"cn":"九四：突如其來如，焚如，死如，棄如。","en":"The fourth NINE, undivided, shows the manner of its subject's coming. How abrupt it is, as with fire, with death, to be rejected (by all)!"},"xiangZhuan":{"cn":"突如其來如，无所容也。","en":"'How abrupt is the manner of his coming!' - none can bear with him."}},{"number":5,"text":{"cn":"六五：出涕沱若，戚嗟若，吉。","en":"The fifth SIX, divided, shows its subject as one with tears flowing in torrents, and groaning in sorrow. There will be good fortune."},"xiangZhuan":{"cn":"六五之吉，離王公也。","en":"'The good fortune attached to the fifth SIX, divided),' is due to its occupying the place of a king or a prince."}},{"number":6,"text":{"cn":"上九：王用出征，有嘉折首，獲匪其醜，无咎。","en":"The topmost NINE, undivided, shows the king employing its subject in his punitive expeditions. Achieving admirable (merit), he breaks (only) the chiefs (of the rebels). Where his prisoners were not their associates, he does not punish. There will be no error."},"xiangZhuan":{"cn":"王用出征，以正邦也。","en":"'The king employs him in his punitive expeditions:' - the object is to bring the regions to a correct state."}}]}},{"binary":14,"binaryString":"001110","char":"䷞","id":31,"kanji":"咸","lowerBinaryString":"001","sameTrigram":false,"text":"Hexagram 31 is named 咸 (xián), \"Conjoining\". Other variations include \"influence (wooing)\" and \"feelings\". Its inner trigram is ☶ (艮 gèn) bound = (山) mountain, and its outer trigram is ☱ (兌 duì) open = (澤) swamp.","translation":"Conjoining","unicode":19934,"upperBinaryString":"110","yomi":"xián","ichingTexts":{"text":{"cn":"咸，亨，利貞，取女吉。","en":"Xian indicates that, (on the fulfilment of the conditions implied in it), there will be free course and success. Its advantageousness will depend on the being firm and correct, (as) in marrying a young lady. There will be good fortune."},"tuanZhuan":{"cn":"咸，感也。柔上而剛下，二氣感應以相與，止而說，男下女，是以亨利貞，取女吉也。天地感而萬物化生，聖人感人心而天下和平，觀其所感，而天地萬物之情可見矣。","en":"Xian is here used in the sense of Kan, meaning (mutually) influencing. The weak (trigram) above, and the strong one below; their two influences moving and responding to each other, and thereby forming a union; the repression (of the one) and the satisfaction (of the other); (with their relative position), where the male is placed below the female: - all these things convey the notion of 'a free and successful course (on the fulfilment of the conditions), while the advantage will depend on being firm and correct, as in marrying a young lady, and there will be good fortune.' Heaven and earth exert their influences, and there ensue the transformation and production of all things. The sages influence the minds of men, and the result is harmony and peace all under the sky. If we look at (the method and issues) of those influences, the true character of heaven and earth and of all things can be seen."},"xiangZhuan":{"cn":"山上有澤，咸，君子以虛受人。","en":"(The trigram representing) a mountain and above it that for (the waters of) a marsh form Xian. The superior man, in accordance with this, keeps his mind free from pre-occupation, and open to receive (the influences of) others."},"commentaries":[{"number":1,"text":{"cn":"初六，咸其拇。","en":"The first six, divided, shows one moving his great toes."},"xiangZhuan":{"cn":"咸其拇，志在外也。","en":"'He moves his great toe:' - his mind is set on what is beyond (himself)."}},{"number":2,"text":{"cn":"六二，咸其腓，凶，居吉。","en":"The second SIX, divided, shows one moving the calves of his leg. There will be evil. If he abide (quiet in his place), there will be good fortune."},"xiangZhuan":{"cn":"雖凶居吉，順不害也。","en":"Though 'there would be evil; yet, if he abide (quiet) in his place, there will be good fortune:' - through compliance (with the circumstances of his condition and place) there will be no injury."}},{"number":3,"text":{"cn":"九三，咸其股，執其隨，往吝。","en":"The third NINE, undivided, shows one moving his thighs, and keeping close hold of those whom he follows. Going forward (in this way) will cause regret."},"xiangZhuan":{"cn":"咸其股，亦不處也。志在隨人，所執下也。","en":"'He moves his thighs:' - he still does not (want to) rest in his place. His will is set on 'following others:' - what he holds in his grasp is low."}},{"number":4,"text":{"cn":"九四，貞吉，悔亡，憧憧往來，朋從爾思。","en":"The fourth NINE, undivided, shows that firm correctness whi.ch will lead to good fortune, and prevent all occasion for repentance. If its subject be unsettled in his movements, (only) his friends will follow his purpose."},"xiangZhuan":{"cn":"貞吉悔亡，未感害也。憧憧往來，未光大也。","en":"'Firm correctness will lead to good fortune, and prevent all occasion for repentance:' - there has not yet been any harm from (a selfish wish to) influence. 'He is unsettled in his movements:'(his power to influence) is not yet either brilliant or great."}},{"number":5,"text":{"cn":"九五，咸其脢，无悔。","en":"The fifth NINE, undivided, shows one moving the flesh along the spine above the heart. There will be no occasion for repentance."},"xiangZhuan":{"cn":"咸其脢，志末也。","en":"'He (tries to) move the flesh along the spine above the heart:' - his aim is trivial."}},{"number":6,"text":{"cn":"上六，咸其輔頰舌。","en":"The sixth six, divided, shows one moving his jaws and tongue."},"xiangZhuan":{"cn":"咸其輔頰舌，滕口說也。","en":"'He moves his jaws and tongue:' - he (only) talks with loquacious mouth."}}]}},{"binary":28,"binaryString":"011100","char":"䷟","id":32,"kanji":"恆","lowerBinaryString":"011","sameTrigram":false,"text":"Hexagram 32 is named 恆 (héng), \"Persevering\". Other variations include \"duration\" and \"constancy\". Its inner trigram is ☴ (巽 xùn) ground = (風) wind, and its outer trigram is ☳ (震 zhèn) shake = (雷) thunder.","translation":"Persevering","unicode":19935,"upperBinaryString":"100","yomi":"héng","ichingTexts":{"text":{"cn":"恆：亨，无咎，利貞，利有攸往。","en":"Heng indicates successful progress and no error (in what it denotes). But the advantage will come from being firm and correct; and movement in any direction whatever will be advantageous."},"tuanZhuan":{"cn":"恆，久也。剛上而柔下，雷風相與，巽而動，剛柔皆應，恆。恆亨无咎，利貞；久於其道也，天地之道，恆久而不已也。利有攸往，終則有始也。日月得天，而能久照，四時變化，而能久成，聖人久於其道，而天下化成；觀其所恆，而天地萬物之情可見矣！","en":"Heng denotes long continuance. The strong (trigram) is above, and the weak one below; (they are the symbols of) thunder and wind, which are in mutual communication; (they have the qualities of) docility and motive force; their strong and weak (lines) all respond, each to the other: - these things are all found in Heng. (When it is said that) 'Heng indicates successful progress and no error (in what it denotes); but the advantage will come from being firm and correct,' this indicates that there must be long continuance in its way of operation. The way of heaven and earth is to be long continued in their operation without stopping. (When it is said that) 'Movement in any direction whatever will be advantageous,' this implies that when (the moving power) is spent, it will begin again. The sun and moon, realising in themselves (the course of Heaven), can perpetuate their shining. The four seasons, by their changing and transforming, can perpetuate their production (of things). The sages persevere long in their course, and all under the sky are transformed and perfect. When we look at what they continue doing long, the natural tendencies of heaven, earth, and all things can be seen."},"xiangZhuan":{"cn":"雷風，恆；君子以立不易方。","en":"(The trigram representing) thunder and that for wind form Heng. The superior man, in accordance with this, stands firm, and does not change his method (of operation)."},"commentaries":[{"number":1,"text":{"cn":"初六：浚恆，貞凶，无攸利。","en":"The first SIX, divided, shows its subject deeply (desirous) of long continuance. Even with firm correctness there will be evil; there will be no advantage in any way."},"xiangZhuan":{"cn":"浚恆之凶，始求深也。","en":"'The evil attached to the deep desire for long continuance (in the subject of the first line)' arises from the deep seeking for it at the commencement (of things)."}},{"number":2,"text":{"cn":"九二：悔亡。","en":"The second NINE, undivided, shows all occasion for repentance disappearing."},"xiangZhuan":{"cn":"九二悔亡，能久中也。","en":"'All occasion for repentance on the part of the subject of the second NINE, (undivided,), disappears:' - he can abide long in the due mean."}},{"number":3,"text":{"cn":"九三：不恆其德，或承之羞，貞吝。","en":"The third NINE, undivided, shows one who does not continuously maintain his virtue. There are those who will impute this to him as a disgrace. However firm he may be, there will be ground for regret."},"xiangZhuan":{"cn":"不恆其德，无所容也。","en":"'He does not continuously maintain his virtue:' - nowhere will he be borne with."}},{"number":4,"text":{"cn":"九四：田无禽。","en":"The fourth NINE, undivided, shows a field where there is no game."},"xiangZhuan":{"cn":"久非其位，安得禽也。","en":"(Going) for long to what is not his proper place, how can he get game?"}},{"number":5,"text":{"cn":"六五：恆其德，貞，婦人吉，夫子凶。","en":"The fifth SIX, divided, shows its subject continuously maintaining the virtue indicated by it. In a wife this will be fortunate; in a husband, evil."},"xiangZhuan":{"cn":"婦人貞吉，從一而終也。夫子制義，從婦凶也。","en":"'Such firm correctness in a wife will be fortunate:' - it is hers to the end of life to follow with an unchanged mind. The husband must decide what is right, and lay down the rule accordingly: - for him to follow (like) a wife is evil."}},{"number":6,"text":{"cn":"上六：振恆，凶。","en":"The topmost SIX, divided, shows its subject exciting himself to long continuance. There will be evil."},"xiangZhuan":{"cn":"振恆在上，大无功也。","en":"'The subject of the topmost line is exciting himself to long continuance:' - far will he be from achieving merit."}}]}},{"binary":15,"binaryString":"001111","char":"䷠","id":33,"kanji":"遯","lowerBinaryString":"001","sameTrigram":false,"text":"Hexagram 33 is named 遯 (dùn), \"Retiring\". Other variations include \"retreat\" and \"yielding\". Its inner trigram is ☶ (艮 gèn) bound = (山) mountain, and its outer trigram is ☰ (乾 qián) force = (天) heaven.","translation":"Retiring","unicode":19936,"upperBinaryString":"111","yomi":"dùn","ichingTexts":{"text":{"cn":"遯：亨，小利貞。","en":"Dun indicates successful progress (in its circumstances). To a small extent it will (still) be advantageous to be firm and correct."},"tuanZhuan":{"cn":"遯亨，遯而亨也。剛當位而應，與時行也。小利貞，浸而長也。遯之時義大矣哉！","en":"'Dun indicates successful progress:' - that is, in the very retiring which Dun denotes there is such progress. The strong (line) is in the ruling place, (the fifth), and is properly responded to (by the second line). The action takes place according to (the requirement of) the time. 'To a small extent it will (still) be advantageous to be firm and correct:' - (the small men) are gradually encroaching and advancing. Great indeed is the significance of (what is required to be done in) the time that necessitates retiring."},"xiangZhuan":{"cn":"天下有山，遯；君子以遠小人，不惡而嚴。","en":"(The trigram representing) the sky and below it that for a mountain form Dun. The superior man, in accordance with this, keeps small men at a distance, not by showing that he hates them, but by his own. dignified gravity."},"commentaries":[{"number":1,"text":{"cn":"初六：遯尾，厲，勿用有攸往。","en":"The first SIX, divided, shows a retiring tail. The position is perilous. No movement in any direction should be made."},"xiangZhuan":{"cn":"遯尾之厲，不往何災也。","en":"There is 'the perilousness of the position shown by the retiring tail:' - but if 'no movement' be made, what disaster can there be?"}},{"number":2,"text":{"cn":"六二：執之用黃牛之革，莫之勝說。","en":"The second SIX, divided, shows its subject holding (his purpose) fast as if by a (thong made from the) hide of a yellow ox, which cannot be broken."},"xiangZhuan":{"cn":"執用黃牛，固志也。","en":"'He holds it as; by (a thong from the hide of) a yellow ox:' - his purpose is firm."}},{"number":3,"text":{"cn":"九三：係遯，有疾厲，畜臣妾吉。","en":"The third NINE, undivided, shows one retiring but bound,--to his distress and peril. (If he were to deal with his binders as in) nourishing a servant or concubine, it would be fortunate for him."},"xiangZhuan":{"cn":"係遯之厲，有疾憊也。畜臣妾吉，不可大事也。","en":"'The peril connected with the case of one retiring, though bound,' is due to the (consequent) distress and exhaustion. 'If he were (to deal as in) nourishing a servant or concubine, it would be fortunate for him:' - but a great affair cannot be dealt with in this way."}},{"number":4,"text":{"cn":"九四：好遯，君子吉，小人否。","en":"The fourth NINE, undivided, shows its subject retiring notwithstanding his likings. In a superior man this will lead to good fortune; a small man cannot attain to this."},"xiangZhuan":{"cn":"君子好遯，小人否也。","en":"'A superior man retires notwithstanding his likings; a small man cannot attain to this.'"}},{"number":5,"text":{"cn":"九五：嘉遯，貞吉。","en":"The fifth NINE, undivided, shows its subject retiring in an admirable way. With firm correctness there will be good fortune."},"xiangZhuan":{"cn":"嘉遯貞吉，以正志也。","en":"'He retires in an admirable way, and with firm correctness there will be good fortune:' - this is due to the rectitude of his purpose."}},{"number":6,"text":{"cn":"上九：肥遯，无不利。","en":"The sixth NINE, undivided, shows its subject retiring in a noble way. It will be advantageous in every respect."},"xiangZhuan":{"cn":"肥遯，无不利；无所疑也。","en":"'He retires in a noble way, and his doing so will be advantageous in every respect:' - he who does so has no doubts about his course."}}]}},{"binary":60,"binaryString":"111100","char":"䷡","id":34,"kanji":"大壯","lowerBinaryString":"111","sameTrigram":false,"text":"Hexagram 34 is named 大壯 (dà zhuàng), \"Great Invigorating\". Other variations include \"the power of the great\" and \"great maturity\". Its inner trigram is ☰ (乾 qián) force = (天) heaven, and its outer trigram is ☳ (震 zhèn) shake = (雷) thunder.","translation":"Great Invigorating","unicode":19937,"upperBinaryString":"100","yomi":"dà zhuàng","ichingTexts":{"text":{"cn":"大壯：利貞。","en":"Da Zhuang indicates that (under the conditions which it symbolises) it will be advantageous to be firm and correct."},"tuanZhuan":{"cn":"大壯，大者壯也。剛以動，故壯。大壯利貞；大者正也。正大而天地之情可見矣！","en":"In Da Zhuang we see that which is great becoming strong. We have the (trigram) denoting strength directing that which denotes movement, and hence (the whole) is expressive of vigour. 'Da Zhuang indicates that it will be advantageous to be firm and correct:' - that which is great (should be) correct. Given correctness and greatness (in their highest degree), and the character and tendencies of heaven and earth can be seen."},"xiangZhuan":{"cn":"雷在天上，大壯；君子以非禮勿履。","en":"(The trigram representing) heaven and above it that for thunder form Da Zhuang. The superior man, in accordance with this, does not take a step which is not according to propriety."},"commentaries":[{"number":1,"text":{"cn":"初九：壯于趾，征凶，有孚。","en":"The first NINE, undivided, shows its subject manifesting his strength in his toes. But advance will lead to evil,--most certainly."},"xiangZhuan":{"cn":"壯于趾，其孚窮也。","en":"'He manifests his vigour in his toes:' - this will certainly lead to exhaustion."}},{"number":2,"text":{"cn":"九二：貞吉。","en":"The second NINE, undivided, shows that with firm correctness there will be good fortune."},"xiangZhuan":{"cn":"九二貞吉，以中也。","en":"'The second NINE, (undivided), shows that with firm correctness there will be good fortune:' - this is due to its being in the centre, (and its subject exemplifying the due mean)."}},{"number":3,"text":{"cn":"九三：小人用壯，君子用罔，貞厲。羝羊觸藩，羸其角。","en":"The third NINE, undivided, shows, in the case of a small man, one using all his strength; and in the case of a superior man, one whose rule is not to do so. Even with firm correctness the position would be perilous. (The exercise of strength in it might be compared to the case of) a ram butting against a fence, and getting his horns entangled."},"xiangZhuan":{"cn":"小人用壯，君子罔也。","en":"'The small man uses all his strength; in the case of the superior man it is his rule not to do so.'"}},{"number":4,"text":{"cn":"九四：貞吉悔亡，藩決不羸，壯于大輿之輹。","en":"The fourth NINE, undivided, shows (a case in which) firm correctness leads to good fortune, and occasion for repentance disappears. (We see) the fence opened without the horns being entangled. The strength is like that in the wheel-spokes of a large waggon."},"xiangZhuan":{"cn":"藩決不羸，尚往也。","en":"'The fence is opened and the horns are not entangled:' - (the subject of the line) still advances."}},{"number":5,"text":{"cn":"六五：喪羊于易，无悔。","en":"The fifth SIX, divided, shows one who loses his ram(-like strength) in the ease of his position. (But) there will be no occasion for repentance."},"xiangZhuan":{"cn":"喪羊于易，位不當也。","en":"'He loses his ram and hardly perceives it:' - he is not in his appropriate place."}},{"number":6,"text":{"cn":"上六：羝羊觸藩，不能退，不能遂，无攸利，艱則吉。","en":"The sixth SIX, divided, shows (one who may be compared to) the ram butting against the fence, and unable either to retreat, or to advance as he would fain do. There will not be advantage in any respect; but if he realise the difficulty (of his position), there will be good fortune."},"xiangZhuan":{"cn":"不能退，不能遂，不祥也。艱則吉，咎不長也。","en":"'He is unable either to retreat or to advance:' - this is owing to his want of care. 'If he realise the difficulty (of his position), there will be good fortune:' - his error will not be prolonged."}}]}},{"binary":5,"binaryString":"000101","char":"䷢","id":35,"kanji":"晉","lowerBinaryString":"000","sameTrigram":false,"text":"Hexagram 35 is named 晉 (jìn), \"Prospering\". Other variations include \"progress\" and \"aquas\". Its inner trigram is ☷ (坤 kūn) field = (地) earth, and its outer trigram is ☲ (離 lí) radiance = (火) fire.","translation":"Prospering","unicode":19938,"upperBinaryString":"101","yomi":"jìn","ichingTexts":{"text":{"cn":"晉：康侯用錫馬蕃庶，晝日三接。","en":"In Jin we see a prince who secures the tranquillity (of the people) presented on that account with numerous horses (by the king), and three times in a day received at interviews."},"tuanZhuan":{"cn":"晉，進也。明出地上，順而麗乎大明，柔進而上行。是以康侯用錫馬蕃庶，晝日三接也。","en":"Jin denotes advancing. (In Jin we have) the bright (sun) appearing above the earth; (the symbol of) docile submission cleaving to that of the Great brightness; and the weak line advanced and moving above: - all these things give us the idea of 'a prince who secures the tranquillity (of the people), presented on that account with numerous horses (by the king), and three times in a day received at interviews.'"},"xiangZhuan":{"cn":"明出地上，晉；君子以自昭明德。","en":"(The trigram representing) the earth and that for the bright (sun) coming forth above it form Jin. The superior man, according to this, gives himself to make more brilliant his bright virtue."},"commentaries":[{"number":1,"text":{"cn":"初六：晉如，摧如，貞吉。罔孚，裕无咎。","en":"The first SIX, divided, shows one wishing to advance, and (at the same time) kept back. Let him be firm and correct, and there will be good fortune. If trust be not reposed in him, let him maintain a large and generous mind, and there will be no error."},"xiangZhuan":{"cn":"晉如，摧如；獨行正也。裕无咎；未受命也。","en":"'He appears wishing to advance, but (at the same time) being kept back:' - all-alone he pursues the correct course. 'Let him maintain a large and generous mind, and there will be no error:' - he has not yet received an official charge."}},{"number":2,"text":{"cn":"六二：晉如，愁如，貞吉。受茲介福，于其王母。","en":"The second SIX, divided, shows its subject with the appearance of advancing, and yet of being sorrowful. If he be firm and correct, there will be good fortune. He will receive this great blessing from his grandmother."},"xiangZhuan":{"cn":"受玆介福，以中正也。","en":"'He will receive this great blessing:' - for he is in the central place and the correct position for him."}},{"number":3,"text":{"cn":"六三：眾允，悔亡。","en":"The third SIX, divided, shows its subject trusted by all (around him). All occasion for repentance will disappear."},"xiangZhuan":{"cn":"眾允之，志上行也。","en":"'All (around) trust him:' - their (common) aim is to move upwards and act."}},{"number":4,"text":{"cn":"九四：晉如碩鼠，貞厲。","en":"The fourth NINE, undivided, shows its subject with the appearance of advancing, but like a marmot. However firm and correct he may be, the position is one of peril."},"xiangZhuan":{"cn":"碩鼠貞厲，位不當也。","en":"'(He advances like) a marmot. However firm and correct he may be, his position is one of peril:' - his place is not that appropriate for him."}},{"number":5,"text":{"cn":"六五：悔亡，失得勿恤，往吉，无不利。","en":"The fifth SIX, divided, shows how all occasion for repentance disappears (from its subject). (But) let him not concern himself about whether he shall fail or succeed. To advance will be fortunate, and in every way advantageous."},"xiangZhuan":{"cn":"失得勿恤，往有慶也。","en":"'Let him not concern himself whether he fails or succeeds:' - his movement in advance will afford ground for congratulation."}},{"number":6,"text":{"cn":"上九：晉其角，維用伐邑，厲吉无咎，貞吝。","en":"The topmost NINE, undivided, shows one advancing his horns. But he only uses them to punish the (rebellious people of his own) city. The position is perilous, but there will be good fortune. (Yet) however firm and correct he may be, there will be occasion for regret."},"xiangZhuan":{"cn":"維用伐邑，道未光也。","en":"'He uses his horns only to punish (the rebellious people of) his city:' - his course of procedure is not yet brilliant."}}]}},{"binary":40,"binaryString":"101000","char":"䷣","id":36,"kanji":"明夷","lowerBinaryString":"101","sameTrigram":false,"text":"Hexagram 36 is named 明夷 (míng yí), \"Darkening of the Light\". Other variations include \"brilliance injured\" and \"intelligence hidden\". Its inner trigram is ☲ (離 lí) radiance = (火) fire, and its outer trigram is ☷ (坤 kūn) field = (地) earth.","translation":"Darkening of the Light","unicode":19939,"upperBinaryString":"000","yomi":"míng yí","ichingTexts":{"text":{"cn":"明夷：利艱貞。","en":"Ming Yi indicates that (in the circumstances which it denotes) it will be advantageous to realise the difficulty (of the position), and maintain firm correctness."},"tuanZhuan":{"cn":"明入地中，明夷。內文明而外柔順，以蒙大難，文王以之。利艱貞，晦其明也，內難而能正其志，箕子以之。","en":"(The symbol of) the Earth and that of Brightness entering into the midst of it give the idea of Ming Yi (Brightness wounded or obscured). The inner (trigram) denotes being accomplished and bright; the outer, being pliant and submissive. The case of king Wen was that of one who with these qualities was yet involved in great difficulties. 'It will be advantageous to realise the difficulty (of the position), and maintain firm correctness: - that is, (the individual concerned) should obscure his brightness. The case of the count of K? was that of one who, amidst the difficulties of his House, was able (thus) to maintain his aim and mind correct."},"xiangZhuan":{"cn":"明入地中，明夷；君子以蒞眾，用晦而明。","en":"(The trigram representing) the earth and that for the bright (sun) entering within it form Ming Yi. The superior man, in accordance with this, conducts his management of men; - he shows his intelligence by keeping it obscured."},"commentaries":[{"number":1,"text":{"cn":"初九：明夷于飛，垂其翼。君子于行，三日不食，有攸往，主人有言。","en":"The first NINE, undivided, shows its subject, (in the condition indicated by) Ming Yi, flying, but with drooping wings. When the superior man (is revolving) his going away, he may be for three days without eating. Wherever he goes, the people there may speak (derisively of him)."},"xiangZhuan":{"cn":"君子于行，義不食也。","en":"'The superior man (is revolving his) going away:' - (in such a case) he feels it right not to eat."}},{"number":2,"text":{"cn":"六二：明夷，夷于左股，用拯馬壯，吉。","en":"The second SIX, divided, shows its subject, (in the condition indicated by) Ming Yi, wounded in the left thigh. He saves himself by the strength of a (swift) horse; and is fortunate."},"xiangZhuan":{"cn":"六二之吉，順以則也。","en":"'The good fortune of (the subject of) the second SIX, divided,' is due to the proper fashion of his acting according to his circumstances."}},{"number":3,"text":{"cn":"九三：明夷于南狩，得其大首，不可疾貞。","en":"The third NINE, undivided, shows its subject, (in the condition indicated by) Ming Yi, hunting in the south, and taking the great chief (of the darkness). He should not be eager to make (all) correct (at once)."},"xiangZhuan":{"cn":"南狩之志，乃大得也。","en":"With the aim represented by 'hunting in the south' a great achievement is accomplished."}},{"number":4,"text":{"cn":"六四：入于左腹，獲明夷之心，出于門庭。","en":"The fourth six, divided, shows its subject (just) entered into the left side of the belly (of the dark land). (But) he is able to carry out the mind appropriate (in the condition indicated by) Ming Yi, quitting the gate and courtyard (of the lord of darkness)."},"xiangZhuan":{"cn":"入于左腹，獲心意也。","en":"'He has (just) entered into the left side of the belly (of the dark land):' - he is still able to carry out the idea in his (inner) mind."}},{"number":5,"text":{"cn":"六五：箕子之明夷，利貞。","en":"The fifth six, divided, shows how the count of K? fulfilled the condition indicated by Ming Yi. It will be advantageous to be firm and correct."},"xiangZhuan":{"cn":"箕子之貞，明不可息也。","en":"'With the firm correctness of the count of K?,' his brightness could not be (quite) extinguished."}},{"number":6,"text":{"cn":"上六：不明晦，初登于天，後入于地。","en":"The sixth six, divided, shows the case where there is no light, but (only) obscurity. (Its subject) had at first ascended to (the top of) the sky; his future shall be to go into the earth."},"xiangZhuan":{"cn":"初登于天，照四國也。後入于地，失則也。","en":"'He had at first ascended to (the top of) the sky:' - he might have enlightened the four quarters of the kingdom. 'His future shall be to go into the earth:' - he has failed to fulfil the model (of a ruler)."}}]}},{"binary":43,"binaryString":"101011","char":"䷤","id":37,"kanji":"家人","lowerBinaryString":"101","sameTrigram":false,"text":"Hexagram 37 is named 家人 (jiā rén), \"Dwelling People\". Other variations include \"the family (the clan)\" and \"family members\". Its inner trigram is ☲ (離 lí) radiance = (火) fire, and its outer trigram is ☴ (巽 xùn) ground = (風) wind.","translation":"Dwelling People","unicode":19940,"upperBinaryString":"011","yomi":"jiā rén","ichingTexts":{"text":{"cn":"家人：利女貞。","en":"For (the realisation of what is taught in) Jia Ren, (or for the regulation of the family), what is most advantageous is that the wife be firm and correct."},"tuanZhuan":{"cn":"家人，女正位乎內，男正位乎外，男女正，天地之大義也。家人有嚴君焉，父母之謂也。父父，子子，兄兄，弟弟，夫夫，婦婦，而家道正；正家而天下定矣。","en":"In Jia Ren the wife has her correct place in the inner (trigram), and the man his correct place in the outer. That man and woman occupy their correct places is the great righteousness shown (in the relation and positions of) heaven and earth. In Jia Ren we have the idea of an authoritative ruler; - that, namely, represented by the parental authority. Let the father be indeed father, and the son son; let the elder brother be indeed elder brother, and the younger brother younger brother, let the husband be indeed husband, and the wife wife: - then will the family be in its normal state. Bring the family to that state, and all under heaven will be established."},"xiangZhuan":{"cn":"風自火出，家人；君子以言有物，而行有恆。","en":"(The trigram representing) fire, and that for wind coming forth from it, form Jia Ren. The superior man, in accordance with this, orders his words according to (the truth of) things, and his conduct so that it is uniformly consistent."},"commentaries":[{"number":1,"text":{"cn":"初九：閑有家，悔亡。","en":"The first NINE, undivided, shows its subject establishing restrictive regulations in his household Occasion for repentance will disappear."},"xiangZhuan":{"cn":"閑有家，志未變也。","en":"'He establishes restrictive regulations in his household: - (he does so), before any change has taken place in their wills."}},{"number":2,"text":{"cn":"六二：无攸遂，在中饋，貞吉。","en":"The second SIX, divided, shows its subject taking nothing on herself, but in her central place attending to the preparation of the food. Through her firm correctness there will be good fortune."},"xiangZhuan":{"cn":"六二之吉，順以巽也。","en":"'The good fortune attached to the second six, (divided),' is due to the docility (of its subject), operating with humility."}},{"number":3,"text":{"cn":"九三：家人嗃嗃，悔厲吉；婦子嘻嘻，終吝。","en":"The third NINE, undivided, shows its subject (treating) the members of the household with stern severity. There will be occasion for repentance, there will be peril, (but) there will (also) be good fortune. If the wife and children were to be smirking and chattering, in the end there would be occasion for regret."},"xiangZhuan":{"cn":"家人嗃嗃，未失也；婦子嘻嘻，失家節也。","en":"When 'the members of the household are treated with stern severity,' there has been no (great) failure (in the regulation of the family). When 'wife and children are smirking and chattering,' the (proper) economy of the family has been lost."}},{"number":4,"text":{"cn":"六四：富家，大吉。","en":"The fourth SIX, divided, shows its subject enriching the family. There will be great good fortune."},"xiangZhuan":{"cn":"富家大吉，順在位也。","en":"'The family is enriched, and there is great good fortune:' - this is due to the docility (belonging to the subject of the line), and its being in its correct place."}},{"number":5,"text":{"cn":"九五：王假有家，勿恤，往吉。","en":"The fifth NINE, undivided, shows the influence of the king extending to his family. There need be no anxiety; there will be good fortune."},"xiangZhuan":{"cn":"王假有家，交相愛也。","en":"'The influence of the king extends to his family:' - the intercourse between them is that of mutual love."}},{"number":6,"text":{"cn":"上九：有孚威如，終吉。","en":"The topmost NINE, undivided, shows its subject possessed of sincerity and arrayed in majesty. In the end there will be good fortune."},"xiangZhuan":{"cn":"威如之吉，反身之謂也。","en":"'The good fortune connected with the display of majesty' describes (the result of) the recovery of the true character."}}]}},{"binary":53,"binaryString":"110101","char":"䷥","id":38,"kanji":"睽","lowerBinaryString":"110","sameTrigram":false,"text":"Hexagram 38 is named 睽 (kuí), \"Polarising\". Other variations include \"opposition\" and \"perversion\". Its inner trigram is ☱ (兌 duì) open = (澤) swamp, and its outer trigram is ☲ (離 lí) radiance = (火) fire.","translation":"Polarising","unicode":19941,"upperBinaryString":"101","yomi":"kuí","ichingTexts":{"text":{"cn":"睽：小事吉。","en":"Kui indicates that, (notwithstanding the condition of things which it denotes), in small matters there will (still) be good success."},"tuanZhuan":{"cn":"睽，火動而上，澤動而下；二女同居，其志不同行；說而麗乎明，柔進而上行，得中而應乎剛；是以小事吉。天地睽，而其事同也；男女睽，而其志通也；萬物睽，而其事類也；睽之時用大矣哉！","en":"In Kui we have (the symbol of) Fire, which, when moved, tends upwards, and that of a Marsh, whose waters, when moved, tend downwards. We have (also the symbols of) two sisters living together, but whose wills do not move in the same direction. (We see how the inner trigram expressive of) harmonious satisfaction is attached to (the outer expressive of) bright intelligence; (we see) the weak line advanced and acting above, and how it occupies the central place, and is responded to by the strong (line below). These indications show that 'in small matters there will (still) be good fortune.' Heaven and earth are separate and apart, but the work which they do is the same. Male and female are separate and apart, but with a common will they seek the same object. There is diversity between the myriad classes of beings, but there is an analogy between their several operations. Great indeed are the phenomena and the results of this condition of disunion and separation."},"xiangZhuan":{"cn":"上火下澤，睽；君子以同而異。","en":"(The trigram representing) fire above, and that for (the waters of) a marsh below, form Kui. The superior man, in accordance with this, where there is a general agreement, yet admits diversity."},"commentaries":[{"number":1,"text":{"cn":"初九：悔亡，喪馬勿逐，自復；見惡人无咎。","en":"The first NINE, undivided, shows that (to its subject) occasion for repentance will disappear. He has lost his horses, but let him not seek for them - they will return of themselves. Should he meet with bad men, he will not err (in communicating with them)."},"xiangZhuan":{"cn":"見惡人，以辟咎也。","en":"'He meets with bad men (and communicates with them):' - (he does so), to avoid the evil of their condemnation."}},{"number":2,"text":{"cn":"九二：遇主于巷，无咎。","en":"The second NINE, undivided, shows its subject happening to meet with his lord in a bye-passage. There will be no error."},"xiangZhuan":{"cn":"遇主于巷，未失道也。","en":"'He happens to meet with his lord in a bye-passage:' - but he has not deviated (for this meeting) from the (proper) course."}},{"number":3,"text":{"cn":"六三：見輿曳，其牛掣，其人天且劓，无初有終。","en":"In the third SIX, divided, we see one whose carriage is dragged back, while the oxen in it are pushed back, and he is himself subjected to the shaving of his head and the cutting off of his nose. There is no good beginning, but there will be a good end."},"xiangZhuan":{"cn":"見輿曳，位不當也。无初有終，遇剛也。","en":"'We see his carriage dragged back:' - this is indicated by the inappropriateness of the position (of the line). 'There is no (good) beginning, but there will be a (good) end:' - this arises from his meeting with the strong (subject of the topmost line)."}},{"number":4,"text":{"cn":"九四：睽孤，遇元夫，交孚，厲无咎。","en":"The fourth NINE, undivided, shows its subject solitary amidst the (prevailing) disunion. (But) he meets with the good man (represented by the first line), and they blend their sincere desires together. The position is one of peril, but there will be no mistake."},"xiangZhuan":{"cn":"交孚无咎，志行也。","en":"'They blend their sincere desires together, and there will be no error:' - their (common) aim is carried into effect."}},{"number":5,"text":{"cn":"六五：悔亡，厥宗噬膚，往何咎。","en":"The fifth SIX, divided, shows that (to its subject) occasion for repentance will disappear. With his relative (and minister he unites closely and readily) as if he were biting through a piece of skin. When he goes forward (with this help), what error can there be?"},"xiangZhuan":{"cn":"厥宗噬膚，往有慶也。","en":"'With his hereditary minister (he unites closely and easily) as if he were biting through a piece of skin:' - his going forward will afford ground for congratulation."}},{"number":6,"text":{"cn":"上九：睽孤，見豕負塗，載鬼一車，先張之弧，後說之弧，匪寇婚媾，往遇雨則吉。","en":"The topmost NINE, undivided, shows its subject solitary amidst the (prevailing) disunion. (In the subject of the third line, he seems to) see a pig bearing on its back a load of mud, (or fancies) there is a carriage full of ghosts. He first bends his bow against him, and afterwards unbends it, (for he discovers) that he is not an assailant to injure, but a near relative. Going forward, he shall meet with (genial) rain, and there will be good fortune."},"xiangZhuan":{"cn":"遇雨之吉，群疑亡也。","en":"'The good fortune symbolised by meeting with (genial) rain' springs from the passing away of all doubts."}}]}},{"binary":10,"binaryString":"001010","char":"䷦","id":39,"kanji":"蹇","lowerBinaryString":"001","sameTrigram":false,"text":"Hexagram 39 is named 蹇 (jiǎn), \"Limping\". Other variations include \"obstruction\" and \"afoot\". Its inner trigram is ☶ (艮 gèn) bound = (山) mountain, and its outer trigram is ☵ (坎 kǎn) gorge = (水) water.","translation":"Limping","unicode":19942,"upperBinaryString":"010","yomi":"jiǎn","ichingTexts":{"text":{"cn":"蹇：利西南，不利東北；利見大人，貞吉。","en":"In (the state indicated by) Jian advantage will be found in the south-west, and the contrary in the north-east. It will be advantageous (also) to meet with the great man. (In these circumstances), with firmness and correctness, there will be good fortune."},"tuanZhuan":{"cn":"蹇，難也，險在前也。見險而能止，知矣哉！蹇利西南，往得中也；不利東北，其道窮也。利見大人，往有功也。當位貞吉，以正邦也。蹇之時用大矣哉！","en":"Jian denotes difficulty. There is (the trigram expressive of) perilousness in front. When one, seeing the peril, can arrest his steps (in accordance with the significance of the lower tri. gram), is he not wise? (The language of) Jian, that 'advantage will be found in the south-west,' refers to the (strong fifth line) advanced and in the central place. That 'there will be no advantage in the north-east,' intimates that the way (of dealing with the Jian state) is exhausted. That 'it will be advantageous to see the great man,' intimates that advance will lead to achievement. That the places (of the different lines after the first) are those appropriate to them indicates firm correctness and good fortune, with which the regions (of the kingdom) are brought to their normal state. Great indeed is the work to be done in the time of Jian!"},"xiangZhuan":{"cn":"山上有水，蹇；君子以反身修德。","en":"(The trigram representing) a mountain, and above it that for water, form Jian. The superior man, in accordance with this, turns round (and examines) himself, and cultivates his virtue."},"commentaries":[{"number":1,"text":{"cn":"初六：往蹇，來譽。","en":"From the first SIX, divided, we learn that advance (on the part of its subject) will lead to (greater) difficulties, while remaining stationary will afford ground for praise."},"xiangZhuan":{"cn":"往蹇來譽，宜待也。","en":"'Advancing will conduct to (greater) difficulties, while remaining stationary will afford ground for praise:' - the proper course is to wait."}},{"number":2,"text":{"cn":"六二：王臣蹇蹇，匪躬之故。","en":"The second SIX, divided, shows the minister of the king struggling with difficulty on difficulty, and not with a view to his own advantage."},"xiangZhuan":{"cn":"王臣蹇蹇，終无尤也。","en":"'The minister of the king struggles with difficulty on difficulty:' - in the end no blame will be attached to him."}},{"number":3,"text":{"cn":"九三：往蹇來反。","en":"The third NINE, undivided, shows its subject advancing, (but only) to (greater) difficulties. He remains stationary, and returns (to his former associates)."},"xiangZhuan":{"cn":"往蹇來反，內喜之也。","en":"'He advances, (but only) to (greater) difficulty; he remains stationary, and returns to his former associates:' - they, (represented in) the inner (trigram), rejoice in him."}},{"number":4,"text":{"cn":"六四：往蹇來連。","en":"The fourth SIX, divided, shows its subject advancing, (but only) to (greater) difficulties. He remains stationary, and unites (with the subject of the line above)."},"xiangZhuan":{"cn":"往蹇來連，當位實也。","en":"'To advance will (only be to) encounter (greater) difficulties; he remains stationary, and unites (with the subject of the line above):' - that is in its proper place and has the solidity (due to it in that position)."}},{"number":5,"text":{"cn":"九五：大蹇朋來。","en":"The fifth NINE, undivided, shows its subject struggling with the greatest difficulties, while friends are coming to help him."},"xiangZhuan":{"cn":"大蹇朋來，以中節也。","en":"'He struggles with the greatest difficulties, while friends are coming (to help him):' - he is in the central position, and possesses the requisite virtue."}},{"number":6,"text":{"cn":"上六：往蹇來碩，吉；利見大人。","en":"The topmost SIX, divided, shows its subject going forward, (only to increase) the difficulties, while his remaining stationary will be (productive of) great (merit). There will be good fortune, and it will be advantageous to meet with the great man."},"xiangZhuan":{"cn":"往蹇來碩，志在內也。利見大人，以從貴也。","en":"'To advance will (only) increase the difficulties, while his remaining stationary will (be productive of) great (merit):' - his aim is to assist the (subject of the line) inside of him. 'It will be advantageous to meet the great man:' - by his course he follows that noble (lord of the figure)."}}]}},{"binary":20,"binaryString":"010100","char":"䷧","id":40,"kanji":"解","lowerBinaryString":"010","sameTrigram":false,"text":"Hexagram 40 is named 解 (xiè), \"Taking-Apart\". Other variations include \"deliverance\" and \"untangled\". Its inner trigram is ☵ (坎 kǎn) gorge = (水) water, and its outer trigram is ☳ (震 zhèn) shake = (雷) thunder.","translation":"Taking-Apart","unicode":19943,"upperBinaryString":"100","yomi":"xiè","ichingTexts":{"text":{"cn":"解：利西南，无所往，其來復吉。有攸往，夙吉。","en":"In (the state indicated by) Jie advantage will be found in the south-west. If no (further) operations be called for, there will be good fortune in coming back (to the old conditions). If some operations be called for, there will be good fortune in the early conducting of them."},"tuanZhuan":{"cn":"解，險以動，動而免乎險，解。解利西南，往得眾也。其來復吉，乃得中也。有攸往夙吉，往有功也。天地解，而雷雨作，雷雨作，而百果草木皆甲坼，解之時大矣哉！","en":"In Jie we have (the trigram expressive of) peril going on to that expressive of movement. By movement there is an escape from the peril: - (this is the meaning of) Jie. 'In (the state indicated by) Jie, advantage will be found in the south-west:' - the movement (thus) intimated will win all. That 'there will be good fortune in coming back (to the old conditions)' shows that such action is that of the due medium. That 'if some operations be necessary, there will be good fortune in the early conducting of them' shows that such operations will be successful. When heaven and earth are freed (from the grasp of winter), we have thunder and rain. When these come, the buds of the plants and trees that produce the various fruits begin to burst. Great indeed are the phenomena in the time intimated by Jie."},"xiangZhuan":{"cn":"雷雨作，解；君子以赦過宥罪。","en":"(The trigram representing) thunder and that for rain, with these phenomena in a state of manifestation, form Jie. The superior man, in accordance with this, forgives errors, and deals gently with crimes."},"commentaries":[{"number":1,"text":{"cn":"初六：无咎。","en":"The first SIX, divided, shows that its subject will commit no error."},"xiangZhuan":{"cn":"剛柔之際，義无咎也。","en":"The strong (fourth) line and the weak line here are in correlation: - we judge rightly in saying that 'its subject will commit no error.'"}},{"number":2,"text":{"cn":"九二：田獲三狐，得黃矢，貞吉。","en":"The second NINE, undivided, shows its subject catch, in hunting, three foxes, and obtain the yellow (= golden) arrows. With firm correctness there will be good fortune."},"xiangZhuan":{"cn":"九二貞吉，得中道也。","en":"'The good fortune springing from the firm correctness of the second NINE, (undivided),' is due to its subject holding the due mean."}},{"number":3,"text":{"cn":"六三：負且乘，致寇至，貞吝。","en":"The third SIX, divided, shows a porter with his burden, (yet) riding in a carriage. He will (only) tempt robbers to attack him. However firm and correct he may (try to) be, there will be cause for regret."},"xiangZhuan":{"cn":"負且乘，亦可醜也，自我致戎，又誰咎也。","en":"For 'a porter with his burden to be riding in a carriage' is a thing to be ashamed of. 'It is he himself that tempts the robbers to come:' - on whom besides can we lay the blame? (See Appendix III, i, 48.)"}},{"number":4,"text":{"cn":"九四：解而拇，朋至斯孚。","en":"(To the subject of) the fourth NINE, undivided, (it is said), 'Remove your toes. Friends will (then) come, between you and whom there will be mutual confidence.'"},"xiangZhuan":{"cn":"解而拇，未當位也。","en":"'Remove your toes:' - the places (of this line and of the third and first) are all inappropriate to them."}},{"number":5,"text":{"cn":"六五：君子維有解，吉；有孚于小人。","en":"The fifth SIX, divided, shows (its subject), the superior man (= the ruler), executing his function of removing (whatever is injurious to the idea of the hexagram), in which case there will he good fortune, and confidence in him will be shown even by the small men."},"xiangZhuan":{"cn":"君子有解，小人退也。","en":"When 'the superior man executes his function of removing (whatever is injurious to the idea of the hexagram),' small men will of themselves retire."}},{"number":6,"text":{"cn":"上六：公用射隼于高墉之上，獲之，无不利。","en":"In the sixth SIX, divided, we see a feudal prince (with his bow) shooting at a falcon on the top of a high wall, and hitting it. (The effect of his action) will be in every way advantageous."},"xiangZhuan":{"cn":"公用射隼，以解悖也。","en":"'A prince with his bow shoots a falcon:' - thus he removes (the promoters of) rebellion."}}]}},{"binary":49,"binaryString":"110001","char":"䷨","id":41,"kanji":"損","lowerBinaryString":"110","sameTrigram":false,"text":"Hexagram 41 is named 損 (sǔn), \"Diminishing\". Other variations include \"decrease\". Its inner trigram is ☱ (兌 duì) open = (澤) swamp, and its outer trigram is ☶ (艮 gèn) bound = (山) mountain.","translation":"Diminishing","unicode":19944,"upperBinaryString":"001","yomi":"sǔn","ichingTexts":{"text":{"cn":"損：有孚，元吉，无咎，可貞，利有攸往。曷之用，二簋可用享。","en":"In (what is denoted by) Sun, if there be sincerity (in him who employs it), there will be great good fortune:--freedom from error; firmness and correctness that can be maintained; and advantage in every movement that shall be made. In what shall this (sincerity in the exercise of Sun) be employed? (Even) in sacrifice two baskets of grain, (though there be nothing else), may be presented."},"tuanZhuan":{"cn":"損，損下益上，其道上行。損而有孚，元吉，无咎，可貞，利有攸往。曷之用？二簋可用享；二簋應有時。損剛益柔有時，損益盈虛，與時偕行。","en":"In Sun (we see) the lower (trigram) diminished, and the upper added to. (But) the method (of action) implied in this operates also above (or, mounts upwards (also) and operates). 'If there be sincerity in this method of diminution, there will be great good fortune; freedom from error; firmness and correctness that can be maintained; and advantage in every movement that shall be made. In what shall this (sincerity in the exercise of Sun) be employed? (Even) in sacrifice, two baskets of grain, (though there be nothing else), may be presented:' - for these two baskets there ought to be the fitting time. There is a time when the strong should be diminished, and the weak should be strengthened. Diminution and increase, overflowing and emptiness: -these take place in harmony with the conditions of the time."},"xiangZhuan":{"cn":"山下有澤，損；君子以懲忿窒欲。","en":"(The trigram representing) a mountain and beneath it that for the waters of a marsh form Sun. The superior man, in accordance with this, restrains his wrath and represses his desires."},"commentaries":[{"number":1,"text":{"cn":"初九：巳事遄往，无咎，酌損之。","en":"The first NINE, undivided, shows its subject suspending his own affairs, and hurrying away (to help the subject of the fourth line). He will commit no error, but let him consider how far he should contribute of what is his (for the other)."},"xiangZhuan":{"cn":"巳事遄往，尚合志也。","en":"'He suspends his own affairs and hurries away (to help the subject of the fourth line):' - the (subject of that) upper (line) mingles his wishes with his."}},{"number":2,"text":{"cn":"九二：利貞，征凶，弗損，益之。","en":"The second NINE, undivided, shows that it will be advantageous for its subject to maintain a firm correctness, and that action on his part will be evil. He can give increase (to his correlate) without taking from himself"},"xiangZhuan":{"cn":"九二利貞，中以為志也。","en":"'It will be advantageous for (the subject of) the second NINE, (undivided), to maintain his firm correctness:' - his central position gives its character to his aim."}},{"number":3,"text":{"cn":"六三：三人行，則損一人；一人行，則得其友。","en":"The third SIX, divided, shows how of three men walking together, the number is diminished by one; and how one, walking, finds his friend."},"xiangZhuan":{"cn":"一人行，三則疑也。","en":"'One man, walking,' (finds his friend): - when three are together, doubts rise among them."}},{"number":4,"text":{"cn":"六四：損其疾，使遄有喜，无咎。","en":"The fourth SIX, divided, shows its subject diminishing the ailment under which he labours by making (the subject of the first line) hasten (to his help), and make him glad. There will be no error."},"xiangZhuan":{"cn":"損其疾，亦可喜也。","en":"'He diminishes the ailment under which he labours:' - this is matter for joy."}},{"number":5,"text":{"cn":"六五：或益之，十朋之龜弗克違，元吉。","en":"The fifth SIX, divided, shows parties adding to (the stores of) its subject ten pairs of tortoise shells, and accepting no refusal. There will be great good fortune."},"xiangZhuan":{"cn":"六五元吉，自上佑也。","en":"'The great good fortune attached to the fifth six, (divided),' is due to the blessing from above."}},{"number":6,"text":{"cn":"上九：弗損益之，无咎，貞吉，有攸往，得臣无家。","en":"The topmost NINE, undivided, shows its subject giving increase to others without taking from himself. There will be no error. With firm correctness there will be good fortune. There will be advantage in every movement that shall be made. He will find ministers more than can be counted by their clans."},"xiangZhuan":{"cn":"弗損益之，大得志也。","en":"'He gives increase to others without taking from what is his own:' - he obtains his wish on a grand scale."}}]}},{"binary":35,"binaryString":"100011","char":"䷩","id":42,"kanji":"益","lowerBinaryString":"100","sameTrigram":false,"text":"Hexagram 42 is named 益 (yì), \"Augmenting\". Other variations include \"increase\". Its inner trigram is ☳ (震 zhèn) shake = (雷) thunder, and its outer trigram is ☴ (巽 xùn) ground = (風) wind.","translation":"Augmenting","unicode":19945,"upperBinaryString":"011","yomi":"yì","ichingTexts":{"text":{"cn":"益：利有攸往，利涉大川。","en":"Yi indicates that (in the state which it denotes) there will be advantage in every movement which shall be undertaken, that it will be advantageous (even) to cross the great stream."},"tuanZhuan":{"cn":"益，損上益下，民說无疆，自上下下，其道大光。利有攸往，中正有慶。利涉大川，木道乃行。益動而巽，日進无疆。天施地生，其益无方。凡益之道，與時偕行。","en":"In Yi we see the upper (trigram) diminished, and the lower added to. The satisfaction of the people (in consequence of this) is without limit. What descends from above reaches to all below, so great and brilliant is the course (of its operation). That 'there will be advantage in every movement which shall be undertaken' appears from the central and correct (positions of the second and fifth lines), and the (general) blessing (the dispensing of which they imply). That 'it will be advantageous (even) to cross the great stream' appears from the action of wood (shown in the figure). Yi is made up of (the trigrams expressive of) movement and docility, (through which) there is daily advancement to an unlimited extent. We have (also) in it heaven dispensing and earth producing, leading to an increase without restriction of place. Everything in the method of this increase proceeds according to the requirements of the time."},"xiangZhuan":{"cn":"風雷，益；君子以見善則遷，有過則改。","en":"(The trigram representing) wind and that for thunder form Yi. The superior man, in accordance with this, when he sees what is good, moves towards it; and when he sees his errors, he turns from them."},"commentaries":[{"number":1,"text":{"cn":"初九：利用為大作，元吉，无咎。","en":"The first NINE, undivided, shows that it will be advantageous for its subject in his position to make a great movement. If it be greatly fortunate, no blame will be imputed to him."},"xiangZhuan":{"cn":"元吉无咎，下不厚事也。","en":"'If the movement be greatly fortunate, no blame will be imputed to him:' - though it is not for one in so low a position to have to do with great affairs."}},{"number":2,"text":{"cn":"六二：或益之，十朋之龜弗克違，永貞吉。王用享于帝，吉。","en":"The second SIX, divided, shows parties adding to the stores of its subject ten pairs of tortoise shells whose oracles cannot be opposed. Let him persevere in being firm and correct, and there will be good fortune. Let the king, (having the virtues thus distinguished), employ them in presenting his offerings to God, and there will be good fortune."},"xiangZhuan":{"cn":"或益之，自外來也。","en":"'Parties add to his stores:' - they come from beyond (his immediate circle) to do so."}},{"number":3,"text":{"cn":"六三：益之用凶事，无咎。有孚中行，告公用圭。","en":"The third SIX, divided, shows increase given to its subject by means of what is evil, so that he shall (be led to good), and be without blame. Let him be sincere and pursue the path of the Mean, (so shall he secure the recognition of the ruler, like) an officer who announces himself to his prince by the symbol of his rank."},"xiangZhuan":{"cn":"益用凶事，固有之也。","en":"'Increase is given by means of what is evil and difficult:' - as he has in himself (the qualities called forth)."}},{"number":4,"text":{"cn":"六四：中行，告公從。利用為依遷國。","en":"The fourth SIX, divided, shows its subject pursuing the due course. His advice to his prince is followed. He can with advantage be relied on in such a movement as that of removing the capital."},"xiangZhuan":{"cn":"告公從，以益志也。","en":"'His advice to his prince is followed:' - his (only) object in it being the increase (of the general good)."}},{"number":5,"text":{"cn":"九五：有孚惠心，勿問元吉。有孚惠我德。","en":"The fifth NINE, undivided, shows its subject with sincere heart seeking to benefit (all below). There need be no question about it; the result will be great good fortune. (All below) will with sincere heart acknowledge his goodness."},"xiangZhuan":{"cn":"有孚惠心，勿問之矣。惠我德，大得志也。","en":"'(The ruler) with sincere heart seeks to benefit (all below):' - there need be no question (about the result). '(All below) with sincere heart acknowledge (his goodness):' - he gets what he desires on a great scale."}},{"number":6,"text":{"cn":"上九：莫益之，或擊之，立心勿恆，凶。","en":"In the sixth NINE, undivided, we see one to whose increase none will contribute, while many will seek to assail him. He observes no regular rule in the ordering of his heart. There will be evil."},"xiangZhuan":{"cn":"莫益之，偏辭也。或擊之，自外來也。","en":"'To his increase none will contribute:' - this expresses but half the result. 'Many will seek to assail him:' - they will come from beyond (his immediate circle) to do so."}}]}},{"binary":62,"binaryString":"111110","char":"䷪","id":43,"kanji":"夬","lowerBinaryString":"111","sameTrigram":false,"text":"Hexagram 43 is named 夬 (guài), \"Displacement\". Other variations include \"resoluteness\", \"parting\", and \"break-through\". Its inner trigram is ☰ (乾 qián) force = (天) heaven, and its outer trigram is ☱ (兌 duì) open = (澤) swamp.","translation":"Displacement","unicode":19946,"upperBinaryString":"110","yomi":"guài","ichingTexts":{"text":{"cn":"夬：揚于王庭，孚號，有厲，告自邑，不利即戎，利有攸往。","en":"Guai requires (in him who would fulfil its meaning) the exhibition (of the culprit's guilt) in the royal court, and a sincere and earnest appeal (for sympathy and support), with a consciousness of the peril (involved in cutting off the criminal). He should (also) make announcement in his own city, and show that it will not be well to have recourse at once to arms. (In this way) there will be advantage in whatever he shall go forward to."},"tuanZhuan":{"cn":"夬，決也，剛決柔也。健而說，決而和，揚于王庭，柔乘五剛也。孚號有厲，其危乃光也。告自邑，不利即戎，所尚乃窮也。利有攸往，剛長乃終也。","en":"Guai is the symbol of displacing or removing. We see (in the figure) the strong (lines) displacing the weak. (We have in it the attributes of) strength and complacency. There is displacement, but harmony (continues). 'The exhibition (of the criminal's guilt) in the royal courtyard' is suggested by the (one) weak (line) mounted on the five strong lines. There 'is an earnest and sincere appeal (for sympathy and support), and a consciousness of the peril (involved in the undertaking):' - it is the realisation of this danger, which makes the method (of compassing the object) brilliant. 'He should make an announcement in his own city, and show that it will not be well to have recourse at once to arms:' - (if he have recourse to arms), what he prefers will (soon) be exhausted. 'There will be advantage in whatever he shall go forward to:' - when the growth of the strong (lines) has been completed, there will be an end (of the displacement)."},"xiangZhuan":{"cn":"澤上于天，夬；君子以施祿及下，居德則忌。","en":"(The trigram representing) heaven and that for the waters of a marsh mounting above it form Guai. The superior man, in accordance with this, bestows emolument on those below him, and dislikes allowing his gifts to accumulate (undispensed)."},"commentaries":[{"number":1,"text":{"cn":"初九：壯于前趾，往不勝為咎。","en":"The first NINE, undivided, shows its subject in (the pride of) strength advancing with his toes. He goes forward, but will not succeed. There will be ground for blame."},"xiangZhuan":{"cn":"不勝而往，咎也。","en":"'Without (being able to) succeed, he goes forward:' - this is an error."}},{"number":2,"text":{"cn":"九二：惕號，莫夜有戎，勿恤。","en":"The second NINE, undivided, shows its subject full of apprehension and appealing (for sympathy and help). Late at night hostile measures may be (taken against him), but he need not be anxious about them."},"xiangZhuan":{"cn":"莫夜有戎，得中道也。","en":"'Though hostile measures be taken against him, he need not be anxious:' - he pursues the course of the due mean."}},{"number":3,"text":{"cn":"九三：壯于頄，有凶。君子夬夬，獨行，遇雨，若濡，有慍，无咎。","en":"The third NINE, undivided, shows its subject (about to advance) with strong (and determined) looks. There will be evil. (But) the superior man, bent on cutting off (the criminal), will walk alone and encounter the rain, (till he be hated by his proper associates) as if he were contaminated (by the others). (In the end) there will be no blame against him."},"xiangZhuan":{"cn":"君子夬夬，終无咎也。","en":"'The superior man looks bent on cutting off the culprit:' - there will in the end be no error."}},{"number":4,"text":{"cn":"九四：臀无膚，其行次且。牽羊悔亡，聞言不信。","en":"The fourth NINE, undivided, shows one from whose buttocks the skin has been stripped, and who walks slowly and with difficulty. (If he could act) like. a sheep led (after its companions), occasion for repentance would disappear. But though he hear these words, he will not believe them."},"xiangZhuan":{"cn":"其行次且，位不當也。聞言不信，聰不明也。","en":"'He walks slowly and with difficulty:' - he is not in the place appropriate to him. 'He hears these words, but does not believe them:' - he hears, but does not understand."}},{"number":5,"text":{"cn":"九五：莧陸夬夬，中行无咎。","en":"The fifth NINE, undivided, shows (the small men like) a bed of purslain, which ought to be uprooted with the utmost determination. (The subject of the line having such determination), his action, in harmony with his central position, will lead to no error or blame."},"xiangZhuan":{"cn":"中行无咎，中未光也。","en":"'If his action be in harmony with his central position, there will be no error:' - but his standing in the due mean is not yet clearly displayed."}},{"number":6,"text":{"cn":"上六：无號，終有凶。","en":"The sixth SIX, divided, shows its subject without any (helpers) on whom to call. His end will be evil."},"xiangZhuan":{"cn":"无號之凶，終不可長也。","en":"'There is the misery of having none on whom to call:' - the end will be that he cannot continue any longer."}}]}},{"binary":31,"binaryString":"011111","char":"䷫","id":44,"kanji":"姤","lowerBinaryString":"011","sameTrigram":false,"text":"Hexagram 44 is named 姤 (gòu), \"Coupling\". Other variations include \"coming to meet\" and \"meeting\". Its inner trigram is ☴ (巽 xùn) ground = (風) wind, and its outer trigram is ☰ (乾 qián) force = (天) heaven.","translation":"Coupling","unicode":19947,"upperBinaryString":"111","yomi":"gòu","ichingTexts":{"text":{"cn":"姤：女壯，勿用取女。","en":"Gou shows a female who is bold and strong. It will not be good to marry (such) a female."},"tuanZhuan":{"cn":"姤，遇也，柔遇剛也。勿用取女，不可與長也。天地相遇，品物咸章也。剛遇中正，天下大行也。姤之時義大矣哉！","en":"Gou has the significance of unexpectedly coming on. (We see in it) the weak (line) coming unexpectedly on the strong ones. 'It will not be good to marry (such) a female:' - one (so symbolised) should not be long associated with. Heaven and earth meeting together (as here represented), all the variety of natural things become fully displayed. When a strong (line) finds itself in the central and correct position, (good government) will greatly prevail all under the sky. Great indeed is the significance of what has to be done at the time indicated by Gou!"},"xiangZhuan":{"cn":"天下有風，姤；后以施命誥四方。","en":"(The trigram representing) wind and that for the sky above it form Gou. The sovereign, in accordance with this, delivers his charges, and promulgates his announcements throughout the four quarters (of the kingdom)."},"commentaries":[{"number":1,"text":{"cn":"初六：繫于金柅，貞吉，有攸往，見凶，羸豕孚蹢躅。","en":"The first SIX, divided, shows how its subject should be kept (like a carriage) tied and fastened to a metal drag, in which case with firm correctness there will be good fortune. (But) if he move in any direction, evil will appear. He will be (like) a lean pig, which is sure to keep jumping about."},"xiangZhuan":{"cn":"繫于金柅，柔道牽也。","en":"'Tied and fastened to a metal drag:' - (this describes the arrest of) the weak (line) in its advancing course."}},{"number":2,"text":{"cn":"九二：包有魚，无咎，不利賓。","en":"The second NINE, undivided, shows its subject with a wallet of fish. There will be no error. But it will not be well to let (the subject of the first line) go forward to the guests."},"xiangZhuan":{"cn":"包有魚，義不及賓也。","en":"'He has a wallet of fish:' - it is right for him not to allow (the subject of the first line) to get to the guests."}},{"number":3,"text":{"cn":"九三：臀无膚，其行次且，厲，无大咎。","en":"The third NINE, undivided, shows one from whose buttocks the skin has been stripped so that he walks with difficulty. The position is perilous, but there will be no great error."},"xiangZhuan":{"cn":"其行次且，行未牽也。","en":"'He walks with difficulty:' - but his steps have not yet been drawn (into the course of the first line)."}},{"number":4,"text":{"cn":"九四：包无魚，起凶。","en":"The fourth NINE, undivided, shows its subject with his wallet, but no fish in it. This will give rise to evil."},"xiangZhuan":{"cn":"无魚之凶，遠民也。","en":"'The evil' indicated by there being 'no fish in the wallet' is owing to (the subject of the line) keeping himself aloof from the people."}},{"number":5,"text":{"cn":"九五：以杞包瓜，含章，有隕自天。","en":"The fifth NINE, undivided, (shows its subject as) a medlar tree overspreading the gourd (beneath it). If he keep his brilliant qualities concealed, (a good issue) will descend (as) from Heaven."},"xiangZhuan":{"cn":"九五含章，中正也。有隕自天，志不舍命也。","en":"'The subject of the fifth NINE, (undivided), keeps his brilliant qualities concealed:' - as is indicated by his central and correct position. '(The good issue) descends (as) from Heaven: - 'his aim does not neglect the ordinances (of Heaven)."}},{"number":6,"text":{"cn":"上九：姤其角，吝，无咎。","en":"The sixth NINE, undivided, shows its subject receiving others on his horns. There will be occasion for regret, but there will be no error."},"xiangZhuan":{"cn":"姤其角，上窮吝也。","en":"'He receives others on his horns:' - he is exhausted at his greatest height, and there will be cause for regret."}}]}},{"binary":6,"binaryString":"000110","char":"䷬","id":45,"kanji":"萃","lowerBinaryString":"000","sameTrigram":false,"text":"Hexagram 45 is named 萃 (cuì), \"Clustering\". Other variations include \"gathering together (massing)\" and \"finished\". Its inner trigram is ☷ (坤 kūn) field = (地) earth, and its outer trigram is ☱ (兌 duì) open = (澤) swamp.","translation":"Clustering","unicode":19948,"upperBinaryString":"110","yomi":"cuì","ichingTexts":{"text":{"cn":"萃：亨。王假有廟，利見大人，亨，利貞。用大牲吉，利有攸往。","en":"In (the state denoted by) Cui, the king will repair to his ancestral temple. It will be advantageous (also) to meet with the great man; and then there will be progress and success, though the advantage must come through firm correctness. The use of great victims will conduce to good fortune; and in whatever direction movement is made, it will be advantageous."},"tuanZhuan":{"cn":"萃，聚也；順以說，剛中而應，故聚也。王假有廟，致孝享也。利見大人亨，聚以正也。用大牲吉，利有攸往，順天命也。觀其所聚，而天地萬物之情可見矣。","en":"Cui indicates (the condition of union, or) being collected. We have in it (the symbol of) docile obedience going on to (what is expressed by that of) satisfaction. There is the strong line in the central place, and rightly responded to. Hence comes the (idea of) union. 'The king will repair to his ancestral temple:' - with the utmost filial piety he presents his offerings (to the spirits of his ancestors). 'It will be advantageous to meet the great man, and there will then be prosperity and success:' - the union effected by him will be on and through what is correct. 'The, use of great victims will conduce to good fortune; and in whatsoever direction movement is made, it will be advantageous:' - all is done in accordance with the ordinances of Heaven. When we look at the way in which the gatherings (here shown) take place, the natural tendencies (in the outward action) of heaven and earth and of all things can be seen.."},"xiangZhuan":{"cn":"澤上於地，萃；君子以除戎器，戒不虞。","en":"(The trigram representing the) earth and that for the waters of a marsh raised above it form Cui. The superior man, in accordance with this, has his weapons of war put in good repair, to be prepared against unforeseen contingencies."},"commentaries":[{"number":1,"text":{"cn":"初六：有孚不終，乃亂乃萃，若號一握為笑，勿恤，往无咎。","en":"The first SIX, divided, shows its subject with a sincere desire (for union), but unable to carry it out, so that disorder is brought into the sphere of his union. If he cry out (for help to his proper correlate), all at once (his tears) will give place to smiles. He need not mind (the temporary difficulty); as he goes forward, there will be no error."},"xiangZhuan":{"cn":"乃亂乃萃，其志亂也。","en":"'In consequence disorder is brought into the sphere of his union:' - his mind and aim are thrown into confusion."}},{"number":2,"text":{"cn":"六二：引吉，无咎，孚乃利用禴。","en":"The second SIX, divided, shows its subject led forward (by his correlate). There will be good fortune, and freedom from error. There is entire sincerity, and in that case (even the small offerings of) the vernal sacrifice are acceptable."},"xiangZhuan":{"cn":"引吉无咎，中未變也。","en":"'He is led forward; there will be good fortune, and freedom from error:' - (the virtue proper to) his central place has not undergone any change."}},{"number":3,"text":{"cn":"六三：萃如，嗟如，无攸利，往无咎，小吝。","en":"The third SIX, divided, shows its subject striving after union and seeming to sigh, yet nowhere finding any advantage. If he go forward, he will not err, though there may be some small cause for regret."},"xiangZhuan":{"cn":"往无咎，上巽也。","en":"'If he go forward, he will not err:' - in the subject of the topmost line there is humility and condescension."}},{"number":4,"text":{"cn":"九四：大吉，无咎。","en":"The fourth NINE, undivided, shows its subject in such a state that, if he be greatly fortunate, he will receive no blame."},"xiangZhuan":{"cn":"大吉无咎，位不當也。","en":"'If he be grandly fortunate, he will receive no blame:' - (this condition is necessary, because) his position is not the one proper to him."}},{"number":5,"text":{"cn":"九五：萃有位，无咎。匪孚，元永貞，悔亡。","en":"The fifth NINE, undivided, shows the union (of all) under its subject in the place of dignity. There will be no error. If any do not have confidence in him, let him see to it that (his virtue) be great, long-continued, and firmly correct, and all occasion for repentance will disappear."},"xiangZhuan":{"cn":"萃有位，志未光也。","en":"'There is the union (of all) under him in the place of dignity:' - (but) his mind and aim have not yet been brilliantly displayed."}},{"number":6,"text":{"cn":"上六：齎咨涕洟，无咎。","en":"The topmost SIX, divided, shows its subject sighing and weeping; but there will be no error."},"xiangZhuan":{"cn":"齎咨涕洟，未安上也。","en":"'He sighs and weeps:' - he does not yet rest in his topmost position."}}]}},{"binary":24,"binaryString":"011000","char":"䷭","id":46,"kanji":"升","lowerBinaryString":"011","sameTrigram":false,"text":"Hexagram 46 is named 升 (shēng), \"Ascending\". Other variations include \"pushing upward\". Its inner trigram is ☴ (巽 xùn) ground = (風) wind, and its outer trigram is ☷ (坤 kūn) field = (地) earth.","translation":"Ascending","unicode":19949,"upperBinaryString":"000","yomi":"shēng","ichingTexts":{"text":{"cn":"升：元亨，用見大人，勿恤，南征吉。","en":"Sheng indicates that (under its conditions) there will be great progress and success. Seeking by (the qualities implied in it) to meet with the great man, its subject need have no anxiety. Advance to the south will be fortunate."},"tuanZhuan":{"cn":"柔以時升，巽而順，剛中而應，是以大亨。用見大人，勿恤；有慶也。南征吉，志行也。","en":"(We find) the weak (line), as it finds the opportunity, ascending upwards. We have (the attribute) of flexibility and that of obedience; we have the strong line (below) and its proper correlate above: - these things indicate that there will be 'great progress and success.' 'Seeking (by the qualities implied in Sheng) to meet with the great man, its subject need have no anxiety:' - there will be ground for congratulation. 'Advance to the south will be fortunate:' - his aim will be carried out."},"xiangZhuan":{"cn":"地中生木，升；君子以順德，積小以高大。","en":"(The trigram representing) wood and that for the earth with the wood growing in the midst of it form Sheng. The superior man, in accordance with this, pays careful attention to his virtue, and accumulates the small developments of it till it is high and great."},"commentaries":[{"number":1,"text":{"cn":"初六：允升，大吉。","en":"The first SIX, divided, shows its subject advancing upwards with the welcome (of those above him). There will be great good fortune."},"xiangZhuan":{"cn":"允升大吉，上合志也。","en":"'He is welcomed in his advance upwards, and there will be great good fortune:' - (the subjects of) the upper (trigram) are of the same mind with him."}},{"number":2,"text":{"cn":"九二：孚乃利用禴，无咎。","en":"The second NINE, undivided, shows its subject with that sincerity which will make even the (small) offerings of the vernal sacrifice acceptable. There will be no error."},"xiangZhuan":{"cn":"九二之孚，有喜也。","en":"'The sincerity of the subject of the second NINE, undivided,' affords occasion for joy."}},{"number":3,"text":{"cn":"九三：升虛邑。","en":"The third NINE, undivided, shows its subject ascending upwards (as into) an empty city."},"xiangZhuan":{"cn":"升虛邑，无所疑也。","en":"'He advances upwards (as into) an empty city:' - he has no doubt or hesitation."}},{"number":4,"text":{"cn":"六四：王用亨于岐山，吉无咎。","en":"The fourth SIX, divided, shows its subject employed by the king to present his offerings on mount Kh?. There will be good fortune; there will be no mistake."},"xiangZhuan":{"cn":"王用亨于岐山，順事也。","en":"'The king employs him to prevent his offerings on mount Kh?:' - such a service (of spiritual Beings) is according to (their mind)."}},{"number":5,"text":{"cn":"六五：貞吉，升階。","en":"The fifth six, divided, shows its subject firmly correct, and therefore enjoying good fortune. He ascends the stairs (with all due ceremony)."},"xiangZhuan":{"cn":"貞吉升階，大得志也。","en":"'He is firmly correct, and will therefore enjoy good fortune. He ascends the stairs (with all due ceremony):' - he grandly succeeds in his aim."}},{"number":6,"text":{"cn":"上六：冥升，利于不息之貞。","en":"The sixth six, divided, shows its subject advancing upwards blindly. Advantage will be found in a ceaseless maintenance of firm correctness."},"xiangZhuan":{"cn":"冥升在上，消不富也。","en":"'He blindly advances upwards,' and is in the highest place: - but there is decay in store for him, and he will not (preserve) his riches."}}]}},{"binary":22,"binaryString":"010110","char":"䷮","id":47,"kanji":"困","lowerBinaryString":"010","sameTrigram":false,"text":"Hexagram 47 is named 困 (kùn), \"Confining\". Other variations include \"oppression (exhaustion)\" and \"entangled\". Its inner trigram is ☵ (坎 kǎn) gorge = (水) water, and its outer trigram is ☱ (兌 duì) open = (澤) swamp.","translation":"Confining","unicode":19950,"upperBinaryString":"110","yomi":"kùn","ichingTexts":{"text":{"cn":"困：亨，貞，大人吉，无咎，有言不信。","en":"In (the condition denoted by) Kun there may (yet be) progress and success. For the firm and correct, the (really) great man, there will be good fortune. He will fall into no error. If he make speeches, his words cannot be made good."},"tuanZhuan":{"cn":"困，剛掩也。險以說，困而不失其所，亨；其唯君子乎？貞大人吉，以剛中也。有言不信，尚口乃窮也。","en":"In Kun (we see) the strong (lines) covered and obscured (by the weak). We have in it (the attribute of) perilousness going on to that of satisfaction. Who is it but the superior man that, though straitened, still does not fail in making progress to his proper end? 'For the firm and correct, the (really) great man, there will be good fortune:' - this is shown by the central positions of the strong (lines). 'If he make speeches, his words cannot be made good:' - to be fond of arguing or pleading is the way to be reduced to extremity."},"xiangZhuan":{"cn":"澤无水，困；君子以致命遂志。","en":"(The trigram representing) a marsh, and (below it that for a defile, which has drained the other dry so that there is) no water in it, form Kun. The superior man, in accordance with this, will sacrifice his life in order to carry out his purpose."},"commentaries":[{"number":1,"text":{"cn":"初六：臀困于株木，入于幽谷，三歲不覿。","en":"The first SIX, divided, shows its subject with bare buttocks straitened under the stump of a tree. He enters a dark valley, and for three years has no prospect (of deliverance)."},"xiangZhuan":{"cn":"入于幽谷，幽不明也。","en":"'He enters a dark valley:' - so benighted is he, and without clear vision."}},{"number":2,"text":{"cn":"九二：困于酒食，朱紱方來，利用享祀，征凶，无咎。","en":"The second NINE, undivided, shows its subject straitened amidst his wine and viands. There come to him anon the red knee-covers (of the ruler). It will be well for him (to maintain his sincerity as) in sacrificing. Active operations (on his part) will lead to evil, but he will be free from blame."},"xiangZhuan":{"cn":"困于酒食，中有慶也。","en":"'He is straitened amidst his wine and viands:' - (but) his position is central, and there will be ground for congratulation."}},{"number":3,"text":{"cn":"六三：困于石，據于蒺蔾，入于其宮，不見其妻，凶。","en":"The third SIX, divided, shows its subject straitened before a (frowning) rock. He lays hold of thorns. He enters his palace, and does not see his wife. There will be evil."},"xiangZhuan":{"cn":"據于蒺蔾，乘剛也。入于其宮，不見其妻，不祥也。","en":"'He lays hold of thorns:' - (this is suggested by the position of the line) above the strong (line). 'He enters his palace, and does not see his wife:' - this is inauspicious."}},{"number":4,"text":{"cn":"九四：來徐徐，困于金車，吝，有終。","en":"The fourth NINE, undivided shows its subject proceeding very slowly (to help the subject of the first line), who is straitened by the carriage adorned with metal in front of him. There will be occasion for regret, but the end will be good."},"xiangZhuan":{"cn":"來徐徐，志在下也。雖不當位，有與也。","en":"'He proceeds very slowly (to help the subject of the first line):' - his aim is directed to (help) that lower (line). Although he is not in his appropriate place, he and that other will (in the end) be together."}},{"number":5,"text":{"cn":"九五：劓刖，困于赤紱，乃徐有說，利用祭祀。","en":"The fifth NINE, undivided, shows its subject with his nose and feet cut off. He is straitened by (his ministers in their) scarlet aprons. He is leisurely in his movements, however, and is satisfied. It will be well for him to be (as sincere) as in sacrificing (to spiritual beings)."},"xiangZhuan":{"cn":"劓刖，志未得也。乃徐有說，以中直也。利用祭祀，受福也。","en":"'His nose and feet are cut off:' - his aim has not yet been gained. 'He is leisurely, however, in his movements, and is satisfied:' - his position is central and (his virtue) is correct. 'It will be well for him to be (as sincere as) in sacrificing:' - so shall he receive blessing."}},{"number":6,"text":{"cn":"上六：困于葛藟，于臲卼，曰動悔。有悔，征吉。","en":"The sixth SIX, divided, shows its subject straitened, as if bound with creepers; or n a high and dangerous position, and saying (to himself), 'If I move, I shall repent it.' If he do repent of former errors, there will be good fortune in his going forward."},"xiangZhuan":{"cn":"困于葛藟，未當也。動悔，有悔吉，行也。","en":"'He is straitened as if bound with creepers: (his spirit and action) are unsuitable. '(He says), \"If I move, I shall repent of it.\" And he does repent (of former errors), which leads to good fortune:' - so he (now) goes on."}}]}},{"binary":26,"binaryString":"011010","char":"䷯","id":48,"kanji":"井","lowerBinaryString":"011","sameTrigram":false,"text":"Hexagram 48 is named 井 (jǐng), \"Welling\". Other variations include \"the well\". Its inner trigram is ☴ (巽 xùn) ground = (風) wind, and its outer trigram is ☵ (坎 kǎn) gorge = (水) water.","translation":"Welling","unicode":19951,"upperBinaryString":"010","yomi":"jǐng","ichingTexts":{"text":{"cn":"井：改邑不改井，无喪无得，往來井井。汔至，亦未繘井，羸其瓶，凶。","en":"(Looking at) Jing, (we think of) how (the site of) a town may be changed, while (the fashion of) its wells undergoes no change. (The water of a well) never disappears and never receives (any great) increase, and those who come and those who go can draw and enjoy the benefit. If (the drawing) have nearly been accomplished, but, before the rope has quite reached the water, the bucket is broken, this is evil."},"tuanZhuan":{"cn":"巽乎水而上水，井；井養而不窮也。改邑不改井，乃以剛中也。汔至亦未繘井，未有功也。羸其瓶，是以凶也。","en":"(We have the symbol of) wood in the water and the raising of the water; which (gives us the idea of) a well. A well supplies nourishment and is not (itself) exhausted. 'The site of a town may be changed, while the fashion of its wells undergoes no change:' - this is indicated by the central position of the strong lines (in the second and fifth places). 'The drawing is nearly accomplished, but the rope has not yet reached the water of the well:' - its service has not yet been accomplished. 'The bucket is broken:' - it is this that occasions evil."},"xiangZhuan":{"cn":"木上有水，井；君子以勞民勸相。","en":"(The trigram representing) wood and above it that for water form Jing. The superior man, in accordance with this, comforts the people, and. stimulates them to mutual helpfulness."},"commentaries":[{"number":1,"text":{"cn":"初六：井泥不食，舊井无禽。","en":"The first SIX, divided, shows a well so muddy that men will not drink of it; or an old well to which neither birds (nor other creatures) resort."},"xiangZhuan":{"cn":"井泥不食，下也。舊井无禽，時舍也。","en":"'A well so muddy that men will not drink of it:' - this is indicated by the low position (of the line). 'An old well to which the birds do not come:' - it has been forsaken in the course of time."}},{"number":2,"text":{"cn":"九二：井谷射鮒，瓮敝漏。","en":"The second NINE, undivided, shows a well from which by a hole the water escapes and flows away to the shrimps (and such small creatures among the grass), or one the water of which leaks away from a broken basket."},"xiangZhuan":{"cn":"井谷射鮒，无與也。","en":"'A well from which by a hole the water escapes, and flows away to the shrimps:' - (the subject of this second line has) none co-operating with him (above)."}},{"number":3,"text":{"cn":"九三：井渫不食，為我心惻，可用汲，王明，並受其福。","en":"The third NINE, undivided, shows a well, which has been cleared out, but is not used. Our hearts are sorry for this, for the water might be drawn out and used. If the king were (only) intelligent, both he and we might receive the benefit of it."},"xiangZhuan":{"cn":"井渫不食，行惻也。求王明，受福也。","en":"'The well has been cleared out, but is not used:' - (even) passers-by would be sorry for this. A prayer is made 'that the king were intelligent:' - for then blessing would be received."}},{"number":4,"text":{"cn":"六四：井甃，无咎。","en":"The fourth SIX, divided, shows a well, the lining of which is well laid. There will be no error."},"xiangZhuan":{"cn":"井甃无咎，修井也。","en":"'A well the lining of which is well laid. There will be no error:' - the well has been put in good repair."}},{"number":5,"text":{"cn":"九五：井冽，寒泉食。","en":"The fifth NINE, undivided, shows a clear, limpid well, (the waters from) whose cold spring are (freely) drunk."},"xiangZhuan":{"cn":"寒泉之食，中正也。","en":"'The waters from the cold spring are (freely) drunk:' - this is indicated by the central and correct position (of the line)."}},{"number":6,"text":{"cn":"上六：井收勿幕，有孚元吉。","en":"The topmost SIX, divided, shows (the water from) the well brought to the top, which is not allowed to be covered. This suggests the idea of sincerity. There will be great good fortune."},"xiangZhuan":{"cn":"元吉在上，大成也。","en":"'The great good fortune' at the topmost place indicates the grand accomplishment (of the idea in the hexagram)."}}]}},{"binary":46,"binaryString":"101110","char":"䷰","id":49,"kanji":"革","lowerBinaryString":"101","sameTrigram":false,"text":"Hexagram 49 is named 革 (gé), \"Skinning\". Other variations include \"revolution (molting)\" and \"the bridle\". Its inner trigram is ☲ (離 lí) radiance = (火) fire, and its outer trigram is ☱ (兌 duì) open = (澤) swamp.","translation":"Skinning","unicode":19952,"upperBinaryString":"110","yomi":"gé","ichingTexts":{"text":{"cn":"革：巳日乃孚，元亨利貞，悔亡。","en":"(What takes place as indicated by) Ge is believed in only after it has been accomplished. There will be great progress and success. Advantage will come from being firm and correct. (In that case) occasion for repentance will disappear."},"tuanZhuan":{"cn":"革，水火相息，二女同居，其志不相得，曰革。巳日乃孚；革而信也。文明以說，大亨以正，革而當，其悔乃亡。天地革而四時成，湯武革命，順乎天而應乎人，革之時大矣哉！","en":"In Ge (we see) water and fire extinguishing each other; (we see also) two daughters dwelling together, but with their minds directed to different objects: - (on account of these things) it is called (the hexagram of) Change. 'It is believed in (only) after it has been accomplished:' - when the change has been made, faith is accorded to it. (We have) cultivated intelligence (as the basis of) pleased satisfaction, (suggesting) 'great progress and success,' coming from what is correct. When change thus takes place in the proper way, 'occasion for repentance disappears.' Heaven and earth undergo their changes, and the four seasons complete their functions. Thang changed the appointment (of the line of Hsi? to the throne), and Wu (that of the line of Shang), in accordance with (the will of) Heaven, and in response to (the wishes of) men. Great indeed is what takes place in a time of change."},"xiangZhuan":{"cn":"澤中有火，革；君子以治歷明時。","en":"(The trigram representing the waters of) a marsh and that for fire in the midst of them form Ge. The superior man, in accordance with this, regulates his (astronomical) calculations, and makes clear the seasons and times."},"commentaries":[{"number":1,"text":{"cn":"初九：鞏用黃牛之革。","en":"The first NINE, undivided, shows its subject (as if he were) bound with the skin of a yellow ox."},"xiangZhuan":{"cn":"鞏用黃牛，不可以有為也。","en":"'He is bound with (the skin of) a yellow ox:' - he should in his circumstances be taking action."}},{"number":2,"text":{"cn":"六二：巳日乃革之，征吉，无咎。","en":"The second SIX, divided, shows its subject making his changes after some time has passed. Action taken will be fortunate. There will be no error."},"xiangZhuan":{"cn":"巳日革之，行有嘉也。","en":"'He makes his changes when some time has passed:' - what he does will be matter of admiration."}},{"number":3,"text":{"cn":"九三：征凶，貞厲，革言三就，有孚。","en":"The third NINE, undivided, shows that action taken by its subject will be evil. Though he be firm and correct, his position is perilous. If the change (he contemplates) have been three times fully discussed, he will be believed in."},"xiangZhuan":{"cn":"革言三就，又何之矣。","en":"'The change (contemplated) has been three times fully discussed:' - to what else should attention (now) be directed?"}},{"number":4,"text":{"cn":"九四：悔亡，有孚改命，吉。","en":"The fourth NINE, undivided, shows occasion for repentance disappearing (from its subject). Let him be believed in; and though he change (existing) ordinances, there will be good fortune."},"xiangZhuan":{"cn":"改命之吉，信志也。","en":"'The good fortune consequent on changing (existing) ordinances' is due to the faith reposed in his aims."}},{"number":5,"text":{"cn":"九五：大人虎變，未占有孚。","en":"The fifth NINE, undivided, shows the great man (producing his changes) as the tiger (does when he) changes (his stripes). Before he divines (and proceeds to action), faith has been reposed in him."},"xiangZhuan":{"cn":"大人虎變，其文炳也。","en":"'The great man produces his changes as the tiger does when he changes his stripes:' - their beauty becomes more brilliant."}},{"number":6,"text":{"cn":"上六：君子豹變，小人革面，征凶，居貞吉。","en":"The sixth SIX, divided, shows the superior man producing his changes as the leopard (does when he) changes (his spots), while small men change their faces (and show their obedience). To go forward (now) would lead to evil, but there will be good fortune in abiding firm and correct."},"xiangZhuan":{"cn":"君子豹變，其文蔚也。小人革面，順以從君也。","en":"'The superior man produces his changes as the leopard does when he changes his spots:' - their beauty becomes more elegant. 'Small men change their faces:' - they show themselves prepared to follow their ruler."}}]}},{"binary":29,"binaryString":"011101","char":"䷱","id":50,"kanji":"鼎","lowerBinaryString":"011","sameTrigram":false,"text":"Hexagram 50 is named 鼎 (dǐng), \"Holding\". Other variations include \"the cauldron\". Its inner trigram is ☴ (巽 xùn) ground = (風) wind, and its outer trigram is ☲ (離 lí) radiance = (火) fire.","translation":"Holding","unicode":19953,"upperBinaryString":"101","yomi":"dǐng","ichingTexts":{"text":{"cn":"鼎：元吉，亨。","en":"Ding gives the intimation of great progress and success."},"tuanZhuan":{"cn":"鼎，象也。以木巽火，亨飪也。聖人亨以享上帝，而大亨以養聖賢。巽而耳目聰明，柔進而上行，得中而應乎剛，是以元亨。","en":"In Ding we have (symbolically) the figure of a caldron. (We see) the (symbol of) wood entering into that of fire, which suggests the idea of cooking. The sages cooked their offerings in order to present them to God, and made great feasts to nourish their wise and able (ministers). We have the symbol of) flexible obedience, and that (which denotes) ears quick of hearing and eyes clear-sighted. (We have also) the weak (line) advanced and acting above, in the central place, and responded to by the strong (line below). All these things give the idea of 'great progress and success.'"},"xiangZhuan":{"cn":"木上有火，鼎；君子以正位凝命。","en":"(The trigram representing) wood and above it that for fire form Ding. The superior man, in accordance with this, keeps his every position correct, and maintains secure the appointment (of Heaven)."},"commentaries":[{"number":1,"text":{"cn":"初六：鼎顛趾，利出否，得妾以其子，无咎。","en":"The first SIX, divided, shows the caldron overthrown and its feet turned up. (But) there will be advantage in its getting rid of what was bad in it. (Or it shows us) the concubine (whose position is improved) by means of her son. There will be no error."},"xiangZhuan":{"cn":"鼎顛趾，未悖也。利出否，以從貴也。","en":"'The caldron is overturned, and its feet turned upwards:' - but this is not (all) contrary (to what is right). 'There will be advantage in getting rid of what was bad:' - thereby (the subject of the line) will follow the more noble (subject of the fourth line)."}},{"number":2,"text":{"cn":"九二：鼎有實，我仇有疾，不我能即，吉。","en":"The second NINE, undivided, shows the caldron with the things (to be cooked) in it. (If its subject can say), 'My enemy dislikes me, but he cannot approach me,' there will be good fortune."},"xiangZhuan":{"cn":"鼎有實，慎所之也。我仇有疾，終无尤也。","en":"'There is the caldron with the things (to be cooked) in it:' - let (the subject of the line) be careful where he goes. 'My enemy dislikes me:' - but there will in the end be no fault (to which he can point)."}},{"number":3,"text":{"cn":"九三：鼎耳革，其行塞，雉膏不食，方雨虧悔，終吉。","en":"The third NINE, undivided, shows the caldron with (the places of) its ears changed. The progress (of its subject) is (thus) stopped. The fat flesh of the pheasant (which is in the caldron) will not be eaten. But the (genial) rain will come, and the grounds for repentance will disappear. There will be good fortune in the end."},"xiangZhuan":{"cn":"鼎耳革，失其義也。","en":"'There is the caldron with (the places for) its ears changed:' - (its subject) has failed in what was required of him (in his situation)."}},{"number":4,"text":{"cn":"九四：鼎折足，覆公餗，其形渥，凶。","en":"The fourth NINE, undivided, shows the caldron with its feet broken; and its contents, designed for the ruler's use, overturned and spilt. Its Subject will be made to blush for shame. There will be evil."},"xiangZhuan":{"cn":"覆公餗，信如何也。","en":"'The contents designed for the ruler's use are overturned and spilt:' - how can (the subject of the line) be trusted?"}},{"number":5,"text":{"cn":"六五：鼎黃耳，金鉉，利貞。","en":"The fifth six, divided, shows the caldron with yellow ears and rings of metal in them. There will be advantage through being firm and correct."},"xiangZhuan":{"cn":"鼎黃耳，中以為實也。","en":"'The caldron has yellow ears:' - the central position (of the line) is taken as (a proof of) the solid (virtue of its subject)."}},{"number":6,"text":{"cn":"上九：鼎玉鉉，大吉，无不利。","en":"The sixth NINE, undivided, shows the caldron with rings of jade. There will be great good fortune, and all action taken will be in every way advantageous."},"xiangZhuan":{"cn":"玉鉉在上，剛柔節也。","en":"'The rings of jade' are at the very top: - the strong and the weak meet in their due proportions."}}]}},{"binary":36,"binaryString":"100100","char":"䷲","id":51,"kanji":"震","lowerBinaryString":"100","sameTrigram":true,"text":"Hexagram 51 is named 震 (zhèn), \"Shake\". Other variations include \"the arousing (shock, thunder)\" and \"thunder\". Both its inner and outer trigrams are ☳ (震 zhèn) shake = (雷) thunder.","translation":"Shake","unicode":19954,"upperBinaryString":"100","yomi":"zhèn","ichingTexts":{"text":{"cn":"震：亨。震來虩虩，笑言啞啞。震驚百里，不喪匕鬯。","en":"Zhen gives the intimation of ease and development. When (the time of) movement (which it indicates) comes, (the subject of the hexagram) will be found looking out with apprehension, and yet smiling and talking cheerfully. When the movement (like a crash of thunder) terrifies all within a hundred Li, he will be (like the sincere worshipper) who is not (startled into) letting go his ladle and (cup of) sacrificial spirits."},"tuanZhuan":{"cn":"震，亨。震來虩虩，恐致福也。笑言啞啞，後有則也。震驚百里，驚遠而懼邇也。出可以守宗廟社稷，以為祭主也。","en":"Zhen (gives the intimation of) ease and development. 'When the (time of) movement (which it indicates) comes, (its subject) will be found looking out with apprehension:' - that feeling of dread leads to happiness. 'And yet smiling and talking cheerfully:' - the issue (of his dread) is that he adopts (proper) laws (for his course). 'The movement (like a crash of thunder) terrifies all within a hundred Lu:' - it startles the distant and frightens the near. 'He will be like the sincere worshipper, who is not startled into letting go his ladle and cup of sacrificial spirits:' - he makes his appearance, and maintains his ancestral temple and the altars of the spirits of the land and grain, as presiding at all sacrifices."},"xiangZhuan":{"cn":"洊雷，震；君子以恐懼脩省。","en":"(The trigram representing) thunder, being repeated, forms Zhen. The superior man, in accordance with this, is fearful and apprehensive, cultivates (his virtue), and examines (his faults)."},"commentaries":[{"number":1,"text":{"cn":"初九：震來虩虩，後笑言啞啞，吉。","en":"The first NINE, undivided, shows its subject, when the movement approaches, looking out and around with apprehension, and afterwards smiling and talking cheerfully. There will be good fortune."},"xiangZhuan":{"cn":"震來虩虩，恐致福也。笑言啞啞，後有則也。","en":"'When the (time of) movement comes, he will be found looking out with apprehension:' - that feeling of dread leads to happiness. 'He yet smiles and talks cheerfully:' - the issue (of his dread) is that he adopts (proper) laws (for his course)."}},{"number":2,"text":{"cn":"六二：震來厲，億喪貝，躋于九陵，勿逐，七日得。","en":"The second SIX, divided, shows its subject, when the movement approaches, in a position of peril. He judges it better to let go the articles (in his possession), and to ascend a very lofty height. There is no occasion for him to pursue after (the things he has let go); in seven days he will find them."},"xiangZhuan":{"cn":"震來厲，乘剛也。","en":"'When the movement approaches, he is in a position of peril:' - (a weak line) is mounted on a strong (one)."}},{"number":3,"text":{"cn":"六三：震蘇蘇，震行无眚。","en":"The third six, divided, shows its subject distraught amid the startling movements going on. If those movements excite him to (right) action, there will be no mistake."},"xiangZhuan":{"cn":"震蘇蘇，位不當也。","en":"'He is distraught amid the startling movements going on:' - (the third line) is in a position unsuitable to it."}},{"number":4,"text":{"cn":"九四：震遂泥。","en":"The fourth NINE, undivided, shows its subject, amid the startling movements, supinely sinking (deeper) in the mud."},"xiangZhuan":{"cn":"震遂泥，未光也。","en":"'Amid the startling movements, he sinks supinely in the mud:' - the light in him has not yet been brilliantly developed."}},{"number":5,"text":{"cn":"六五：震往來厲，億无喪，有事。","en":"The fifth SIX, divided, shows its subject going and coming amidst the startling movements (of the time), and always in peril; but perhaps he will not incur loss, and find business (which he can accomplish)."},"xiangZhuan":{"cn":"震往來厲，危行也。其事在中，大无喪也。","en":"'He goes and comes amid the startling movements, and (always) in peril:' - full of risk are his doings. 'What he has to do has to be done in his central position:' - far will he be from incurring any loss."}},{"number":6,"text":{"cn":"上六：震索索，視矍矍，征凶。震不于其躬，于其鄰，无咎。婚媾有言。","en":"The topmost SIX, divided, shows its subject, amidst the startling movements (of the time), in breathless dismay and looking round him with trembling apprehension. If he take action, there will be evil. If, while the startling movements have not reached his own person and his neighbourhood, (he were to take precautions), there would be no error, though his relatives might (still) speak against him."},"xiangZhuan":{"cn":"震索索，中未得也。雖凶无咎，畏鄰戒也。","en":"'Amid the startling movements he is in breathless dismay:' - he has not found out (the course of) the due mean. 'Though evil (threatens), he will not fall into error:' - he is afraid of being warned by his neighbours."}}]}},{"binary":9,"binaryString":"001001","char":"䷳","id":52,"kanji":"艮","lowerBinaryString":"001","sameTrigram":true,"text":"Hexagram 52 is named 艮 (gèn), \"Bound\". Other variations include \"keeping still, mountain\" and \"stilling\". Both its inner and outer trigrams are ☶ (艮 gèn) bound = (山) mountain.","translation":"Bound","unicode":19955,"upperBinaryString":"001","yomi":"gèn","ichingTexts":{"text":{"cn":"艮：艮其背，不獲其身，行其庭，不見其人，无咎。","en":"When one's resting is like that of the back, and he loses all consciousness of self; when he walks in his courtyard, and does not see any (of the persons) in it,--there will be no error."},"tuanZhuan":{"cn":"艮，止也。時止則止，時行則行，動靜不失其時，其道光明。艮其止，止其所也。上下敵應，不相與也。是以不獲其身，行其庭不見其人，无咎也。","en":"Gen denotes stopping or resting; - resting when it is the time to rest, and acting when it is the time to act. When one's movements and restings all take place at the proper time for them, his way (of proceeding) is brilliant and intelligent. Resting in one's resting-point is resting in one's proper place. The upper and lower (lines of the hexagram) exactly correspond to each other, but are without any interaction; hence it is said that '(the subject of the hexagram) has no consciousness of self; that when he walks in his courtyard, he does not see (any of) the persons in it; and that there will be no error.'"},"xiangZhuan":{"cn":"兼山，艮；君子以思不出其位。","en":"(Two trigrams representing) a mountain, one over the other, form Gen. The superior man, in accordance with this, does not go in his thoughts beyond the (duties of the) position in which he is."},"commentaries":[{"number":1,"text":{"cn":"初六：艮其趾，无咎，利永貞。","en":"The first SIX, divided, shows its subject keeping his toes at rest. There will be no error; but it will be advantageous for him to be persistently firm and correct."},"xiangZhuan":{"cn":"艮其趾，未失正也。","en":"'He keeps his toes at rest:' - he does not fail in what is correct (according to the idea of the figure)."}},{"number":2,"text":{"cn":"六二：艮其腓，不拯其隨，其心不快。","en":"The second SIX, divided, shows its subject keeping the calves of his legs at rest. He cannot help (the subject of the line above) whom he follows, and is dissatisfied in his mind."},"xiangZhuan":{"cn":"不拯其隨，未退聽也。","en":"'He cannot help him whom he follows:'(he whom he follows) will not retreat to listen to him."}},{"number":3,"text":{"cn":"九三：艮其限，列其夤，厲薰心。","en":"The third NINE, undivided, shows its subject keeping his loins at rest, and separating the ribs (from the body below). The situation is perilous, and the heart glows with suppressed excitement."},"xiangZhuan":{"cn":"艮其限，危薰心也。","en":"'He keeps the loins at rest:' - the danger (from his doing so) produces a glowing, heat in the heart."}},{"number":4,"text":{"cn":"六四：艮其身，无咎。","en":"The fourth SIX, divided, shows its subject keeping his trunk at rest. There will be no error."},"xiangZhuan":{"cn":"艮其身，止諸躬也。","en":"'He keeps the trunk of his body at rest:' - he keeps himself free (from agitation)."}},{"number":5,"text":{"cn":"六五：艮其輔，言有序，悔亡。","en":"S. The fifth SIX, divided, shows its subject keeping his jawbones at rest, so that his words are (all) orderly. Occasion for repentance will disappear."},"xiangZhuan":{"cn":"艮其輔，以中正也。","en":"'He keeps his cheek bones at rest:' - in harmony with his central position he acts correctly."}},{"number":6,"text":{"cn":"上九：敦艮，吉。","en":"The sixth NINE, undivided, shows its subject devotedly maintaining his restfulness. There will be good fortune."},"xiangZhuan":{"cn":"敦艮之吉，以厚終也。","en":"'There is good fortune through his devotedly maintaining his restfulness:' - to the end he shows himself generous and good."}}]}},{"binary":11,"binaryString":"001011","char":"䷴","id":53,"kanji":"漸","lowerBinaryString":"001","sameTrigram":false,"text":"Hexagram 53 is named 漸 (jiàn), \"Infiltrating\". Other variations include \"development (gradual progress)\" and \"advancement\". Its inner trigram is ☶ (艮 gèn) bound = (山) mountain, and its outer trigram is ☴ (巽 xùn) ground = (風) wind.","translation":"Infiltrating","unicode":19956,"upperBinaryString":"011","yomi":"jiàn","ichingTexts":{"text":{"cn":"漸：女歸吉，利貞。","en":"Jian suggests to us the marriage of a young lady, and the good fortune (attending it). There will be advantage in being firm and correct."},"tuanZhuan":{"cn":"漸之進也，女歸吉也。進得位，往有功也。進以正，可以正邦也。其位剛，得中也。止而巽，動不窮也。","en":"The advance indicated by Jian is (like) the marrying of a young lady which is attended by good fortune. (The lines) as they advance get into their correct places: - this indicates the achievements of a successful progress. The advance is made according to correctness: - (the subject of the hexagram) might rectify his country. Among the places (of the hexagram) we see the strong undivided line in the centre. 'In (the attributes of) restfulness and flexible penetration we have (the assurance of) an (onward) movement that is inexhaustible."},"xiangZhuan":{"cn":"山上有木，漸；君子以居賢德，善俗。","en":"(The trigram representing) a mountain and above it that for a tree form Jian. The superior man, in accordance with this, attains to and maintains his extraordinary virtue, and makes the manners of the people good."},"commentaries":[{"number":1,"text":{"cn":"初六：鴻漸于干，小子厲，有言，无咎。","en":"The first SIX, divided, shows the wild geese gradually approaching the shore. A young officer (in similar circumstances) will be in a position of danger, and be spoken against; but there will be no error."},"xiangZhuan":{"cn":"小子之厲，義无咎也。","en":"'The danger of a small officer (as represented in the first line)' is owing to no fault of his in the matter of what is right."}},{"number":2,"text":{"cn":"六二：鴻漸于磐，飲食衎衎，吉。","en":"The second SIX, divided, shows the geese gradually approaching the large rocks, where they eat and drink joyfully and at ease. There will be good fortune."},"xiangZhuan":{"cn":"飲食衎衎，吉，不素飽也。","en":"'They eat and drink joyfully and at ease:' - but not without having earned their food."}},{"number":3,"text":{"cn":"九三：鴻漸于陸，夫征不復，婦孕不育，凶；利禦寇。","en":"The third NINE, undivided, shows them gradually advanced to the dry plains. (It suggests also the idea of) a husband who goes on an expedition from which he does not return, and of a wife who is pregnant, but will not nourish her child. There will be evil. (The case symbolised) might be advantageous in resisting plunderers."},"xiangZhuan":{"cn":"夫征不復，離群醜也。婦孕不育，失其道也。利用御寇，順相保也。","en":"'A husband goes and does not return:' - he separates himself from his comrades. 'A wife is pregnant, but will not nourish her child:' - she has failed in her (proper) course. 'It might be advantageous in resisting plunderers:' - by acting as here indicated men would preserve one another."}},{"number":4,"text":{"cn":"六四：鴻漸于木，或得其桷，无咎。","en":"The fourth SIX, divided, shows the geese gradually advanced to the trees. They may light on the flat branches. There will be no error."},"xiangZhuan":{"cn":"或得其桷，順以巽也。","en":"'They may light on the flat branches:' - there is docility (in the line) going on to flexible penetration."}},{"number":5,"text":{"cn":"九五：鴻漸于陵，婦三歲不孕，終莫之勝，吉。","en":"The fifth NINE, undivided, shows the geese gradually advanced to the high mound. (It suggests the idea of) a wife who for three years does not become pregnant; but in the end the natural issue cannot be prevented. There will be good fortune."},"xiangZhuan":{"cn":"終莫之勝，吉；得所愿也。","en":"'In the end the natural issue cannot be prevented. There will be good fortune:' - (the subject of the line) will get what he desires."}},{"number":6,"text":{"cn":"上九：鴻漸于陸，其羽可用為儀，吉。","en":"The sixth NINE, undivided, shows the geese gradually advanced to the large heights (beyond). Their feathers can be used as ornaments. There will be good fortune."},"xiangZhuan":{"cn":"其羽可用為儀，吉；不可亂也。","en":"'Their feathers can be used as ornaments. There will be good fortune:' - (the object and character of the subject of the line) cannot be disturbed."}}]}},{"binary":52,"binaryString":"110100","char":"䷵","id":54,"kanji":"歸妹","lowerBinaryString":"110","sameTrigram":false,"text":"Hexagram 54 is named 歸妹 (guī mèi), \"Converting the Maiden\". Other variations include \"the marrying maiden\" and \"returning maiden\". Its inner trigram is ☱ (兌 duì) open = (澤) swamp, and its outer trigram is ☳ (震 zhèn) shake = (雷) thunder.","translation":"Converting the Maiden","unicode":19957,"upperBinaryString":"100","yomi":"guī mèi","ichingTexts":{"text":{"cn":"歸妹：征凶，无攸利。","en":"Gui Mei indicates that (under the conditions which it denotes) action will be evil, and in no wise advantageous."},"tuanZhuan":{"cn":"歸妹，天地之大義也。天地不交，而萬物不興，歸妹人之終始也。說以動，所歸妹也。征凶，位不當也。无攸利，柔乘剛也。","en":"By Gui Mei (the marrying away of a younger sister) the great and righteous relation between heaven and earth (is suggested to us). If heaven and earth were to have no intercommunication, things would not grow and flourish as they do. The marriage of a younger sister is the end (of her maidenhood) and the beginning (of her motherhood). We have (in the hexagram the desire of) pleasure and, on the ground of that, movement following. The marrying away is of a younger sister. 'Any action will be evil:' - the places (of the lines) are not those appropriate to them. 'It will be in no wise advantageous:' - the weak (third and fifth lines) are mounted on strong lines."},"xiangZhuan":{"cn":"澤上有雷，歸妹；君子以永終知敝。","en":"(The trigram representing the waters of) a marsh and over it that for thunder form Gui Mei. The superior man, in accordance with this, having regard to the far-distant end, knows the mischief (that may be done at the beginning)."},"commentaries":[{"number":1,"text":{"cn":"初九：歸妹以娣，跛能履，征吉。","en":"The first NINE, undivided, shows the younger sister married off in a position ancillary to the real wife. (It suggests the idea of) a person lame on one leg who yet manages to tramp along. Going forward will be fortunate."},"xiangZhuan":{"cn":"歸妹以娣，以恆也。跛能履吉，相承也。","en":"'The younger sister is married off in a position ancillary to that of the real wife:' - it is the constant practice (for such a case). 'Lame on one leg, she is able to tramp along:' - she can render helpful service."}},{"number":2,"text":{"cn":"九二：眇能視，利幽人之貞。","en":"The second NINE, undivided, shows her blind of one eye, and yet able to see. There will be advantage in her maintaining the firm correctness of a solitary widow."},"xiangZhuan":{"cn":"利幽人之貞，未變常也。","en":"'There will be advantage in maintaining the firm correctness of a solitary widow:' - (the subject of the line) has not changed from the constancy (proper to a wife)."}},{"number":3,"text":{"cn":"六三：歸妹以須，反歸以娣。","en":"The third SIX, divided, shows the younger sister who was to be married off in a mean position. She returns and accepts an ancillary position."},"xiangZhuan":{"cn":"歸妹以須，未當也。","en":"'The younger sister who was to be married off is in a mean position:' - this is shown by the improprieties (indicated in the line)."}},{"number":4,"text":{"cn":"九四：歸妹愆期，遲歸有時。","en":"The fourth NINE, undivided, shows the younger sister who is to be married off protracting the time. She may be late in being married, but the time will come."},"xiangZhuan":{"cn":"愆期之志，有待而行也。","en":"(The purpose in) 'protracting the time' is that, after waiting, the thing may be done (all the better)."}},{"number":5,"text":{"cn":"六五：帝乙歸妹，其君之袂，不如其娣之袂良，月幾望，吉。","en":"The fifth SIX, divided, reminds us of the marrying of the younger sister of (king) Di-yi, when the sleeves of her the princess were not equal to those of the (still) younger sister who accompanied her in an inferior capacity. (The case suggests the thought of) the moon almost full. There will be good fortune."},"xiangZhuan":{"cn":"帝乙歸妹，不如其娣之袂良也。其位在中，以貴行也。","en":"'The sleeves of the younger sister of (king) Di-yi, when she was married away, were not equal to those of her (half-)sister, who accompanied her:' - such was her noble character, indicated by the central position of the line."}},{"number":6,"text":{"cn":"上六：女承筐无實，士刲羊无血，无攸利。","en":"The sixth SIX, divided, shows the young lady bearing the basket, but without anything in it, and the gentleman slaughtering the sheep, but without blood flowing from it. There will be no advantage in any way."},"xiangZhuan":{"cn":"上六无實，承虛筐也。","en":"'(What is said in) the sixth SIX, (divided),about there being nothing in the basket' shows that the subject of it is carrying an empty basket."}}]}},{"binary":44,"binaryString":"101100","char":"䷶","id":55,"kanji":"豐","lowerBinaryString":"101","sameTrigram":false,"text":"Hexagram 55 is named 豐 (fēng), \"Abounding\". Other variations include \"abundance\" and \"fullness\". Its inner trigram is ☲ (離 lí) radiance = (火) fire, and its outer trigram is ☳ (震 zhèn) shake = (雷) thunder.","translation":"Abounding","unicode":19958,"upperBinaryString":"100","yomi":"fēng","ichingTexts":{"text":{"cn":"豐：亨，王假之，勿憂，宜日中。","en":"Feng intimates progress and development. When a king has reached the point (which the name denotes) there is no occasion to be anxious (through fear of a change). Let him be as the sun at noon."},"tuanZhuan":{"cn":"豐，大也。明以動，故丰。王假之，尚大也。勿憂宜日中，宜照天下也。日中則昃，月盈則食，天地盈虛，與時消息，而況人於人乎？況於鬼神乎？","en":"Feng has the signification of being great. It is made up of the trigrams (representing) intelligence and movement directed by that intelligence. It is thus that it has that signification. 'The king has reached the condition (denoted by Feng):' - he has still to make it greater. 'There is no occasion to be anxious. Let him be as the sun at noon:' - it is for him to cause his light to shine on all under the sky. When the sun has reached the meridian height, it begins to decline. When the moon has become full, it begins to wane. The (interaction of) heaven and earth is now vigorous and abundant, now dull and scanty, growing and diminishing according to the seasons. How much more must it be so with (the operations of) men! How much more also with the spiritual agency!"},"xiangZhuan":{"cn":"雷電皆至，豐；君子以折獄致刑。","en":"(The trigrams representing) thunder and lightning combine to form Feng. The superior man, in accordance with this, decides cases of litigation, and apportions punishments with exactness."},"commentaries":[{"number":1,"text":{"cn":"初九：遇其配主，雖旬无咎，往有尚。","en":"The first NINE, undivided, shows its subject meeting with his mate. Though they are both of the same character, there will be no error. Advance will call forth approval."},"xiangZhuan":{"cn":"雖旬无咎，過旬災也。","en":"'Though they are both of the same character, there will be no error:' - if the subject of this line seek to overpass that similarity, there will be calamity."}},{"number":2,"text":{"cn":"六二：豐其蔀，日中見斗，往得疑疾，有孚發若，吉。","en":"The second SIX, divided, shows its subject surrounded by screens so large and thick that at midday he can see from them the constellation of the Bushel. If he go (and try to enlighten his ruler who is thus emblemed), he will make himself to be viewed with suspicion and dislike. Let him cherish his feeling of sincere devotion that he may thereby move (his ruler's mind), and there will be good fortune."},"xiangZhuan":{"cn":"有孚發若，信以發志也。","en":"'Let him cherish his feeling of sincere devotion, that it shall appear being put forth:' - it is by sincerity that the mind is affected."}},{"number":3,"text":{"cn":"九三：豐其沛，日中見沬，折其右肱，无咎。","en":"The third NINE, undivided, shows its subject with an (additional) screen of a large and thick banner, through which at midday he can see (the small) Mei star. (In the darkness) he breaks his right arm; but there will be no error."},"xiangZhuan":{"cn":"豐其沛，不可大事也。折其右肱，終不可用也。","en":"'There is an (additional) screen of a large and thick banner:' - great things should not be attempted (in such circumstances). 'He breaks his right arm:' - in the end he will not be fit to be employed."}},{"number":4,"text":{"cn":"九四：豐其蔀，日中見斗，遇其夷主，吉。","en":"T he fourth NINE, undivided, shows its subject in a tent so large and thick that at midday he can see from it the constellation of the Bushel. But he meets with the subject of the (first) line, undivided like himself. There will be good fortune."},"xiangZhuan":{"cn":"豐其蔀，位不當也。日中見斗，幽不明也。遇其夷主，吉；行也。","en":"'He is surrounded by a screen large and thick:' - the position of the line is inappropriate. 'At midday he sees the constellation of the Bushel:' - there is darkness and no light. 'He meets with the subject of the line, undivided like himself. There will be good fortune:' - action may be taken."}},{"number":5,"text":{"cn":"六五：來章，有慶譽，吉。","en":"The fifth SIX, divided, shows its subject bringing around him the men of brilliant ability. There will be occasion for congratulation and praise. There will be good fortune."},"xiangZhuan":{"cn":"六五之吉，有慶也。","en":"'The good fortune indicated by the fifth six, (divided),'is the congratulation (that is sure to arise)."}},{"number":6,"text":{"cn":"上六：豐其屋，蔀其家，闚其戶，闃其无人，三歲不覿，凶。","en":"The topmost SIX, divided, shows its subject with his house made large, but only serving as a screen to his household. When he looks at his door, it is still, and there is nobody about it. For three years no one is to be seen. There will be evil."},"xiangZhuan":{"cn":"豐其屋，天際翔也。闚其戶，闃其无人，自藏也。","en":"'He has made his house large:' - he soars (in his pride) to the heavens. 'He looks at his door, which is still, with no one about it:' - he (only) keeps himself withdrawn from all others."}}]}},{"binary":13,"binaryString":"001101","char":"䷷","id":56,"kanji":"旅","lowerBinaryString":"001","sameTrigram":false,"text":"Hexagram 56 is named 旅 (lǚ), \"Sojourning\". Other variations include \"the wanderer\" and \"traveling\". Its inner trigram is ☶ (艮 gèn) bound = (山) mountain, and its outer trigram is ☲ (離 lí) radiance = (火) fire.","translation":"Sojourning","unicode":19959,"upperBinaryString":"101","yomi":"lǚ","ichingTexts":{"text":{"cn":"旅：小亨，旅貞吉。","en":"Lu intimates that (in the condition which it denotes) there may be some little attainment and progress. If the stranger or traveller be firm and correct as he ought to be, there will be good fortune."},"tuanZhuan":{"cn":"旅，小亨，柔得中乎外，而順乎剛，止而麗乎明，是以小亨，旅貞吉也。旅之時義大矣哉！","en":"'Lu indicates that there may be some small attainment and progress:' - the weak (line) occupies the central place in the outer (trigram), and is obedient to the strong (lines on either side of it). (We have also the attributes of quiet) resting closely attached to intelligence (in the component trigrams). Hence it is said, 'There may be some small attainment and progress. If the stranger or traveller be firm and correct as he ought to be, there will be good fortune.' Great is the time and great is the right course to be taken as intimated in Lu!"},"xiangZhuan":{"cn":"山上有火，旅；君子以明慎用刑，而不留獄。","en":"(The trigram representing) a mountain and above it that for fire form Lu. The superior man, in accordance with this, exerts his wisdom and caution in the use of punishments and not allowing litigations to continue."},"commentaries":[{"number":1,"text":{"cn":"初六：旅瑣瑣，斯其所取災。","en":"The first SIX, divided, shows the stranger mean and meanly occupied. It is thus that he brings on himself (further) calamity."},"xiangZhuan":{"cn":"旅瑣瑣，志窮災也。","en":"'The stranger is mean and meanly occupied:' - his aim is become of the lowest character, and calamity will ensue."}},{"number":2,"text":{"cn":"六二：旅即次，懷其資，得童僕貞。","en":"The second SIX, divided, shows the stranger, occupying his lodging-house, carrying with him his means of livelihood, and provided with good and trusty servants."},"xiangZhuan":{"cn":"得童僕貞，終无尤也。","en":"'He is provided with good and trusty servants:' - he will in the end have nothing of which to complain."}},{"number":3,"text":{"cn":"九三：旅焚其次，喪其童僕，貞厲。","en":"The third NINE, undivided, shows the stranger, burning his lodging-house, and having lost his servants. However firm and correct he (try to) be, he will be in peril."},"xiangZhuan":{"cn":"旅焚其次，亦以傷矣。以旅與下，其義喪也。","en":"'The stranger burns his lodging-house:' - and he himself also suffers hurt thereby. When, as a stranger, he treats those below him (as the line indicates), the right relation between him and them is lost."}},{"number":4,"text":{"cn":"九四：旅于處，得其資斧，我心不快。","en":"The fourth NINE, undivided, shows the traveller in a resting-place, having (also) the means of livelihood and the axe, (but still saying), 'I am not at ease in my mind.'"},"xiangZhuan":{"cn":"旅于處，未得位也。得其資斧，心未快也。","en":"'The stranger is in a resting-place:' - but he has not got his proper position. 'He has the means of livelihood, and the axe:' - but his mind is not at ease."}},{"number":5,"text":{"cn":"六五：射雉一矢亡，終以譽命。","en":"The fifth SIX, divided, shows its subject shooting a pheasant. He will lose his arrow, but in the end he will obtain praise and a (high) charge."},"xiangZhuan":{"cn":"終以譽命，上逮也。","en":"'In the end he will obtain praise and a (high) charge:' - he has reached a high place."}},{"number":6,"text":{"cn":"上九：鳥焚其巢，旅人先笑後號咷。喪牛于易，凶。","en":"The sixth NINE, undivided, suggests the idea of a bird burning its nest. The stranger, (thus represented), first laughs and then cries out. He has lost his ox(-like docility) too readily and easily. There will be evil."},"xiangZhuan":{"cn":"以旅在上，其義焚也。喪牛于易，終莫之聞也。","en":"'Considering that the stranger is here at the very height (of distinction),' with the spirit that possesses him, it is right he (should be emblemed by a bird) burning (its nest). 'He loses his ox(-like docility) too readily and easily:' - to the end he would not listen to (the truth about the course to be pursued)."}}]}},{"binary":27,"binaryString":"011011","char":"䷸","id":57,"kanji":"巽","lowerBinaryString":"011","sameTrigram":true,"text":"Hexagram 57 is named 巽 (xùn), \"Ground\". Other variations include \"the gentle (the penetrating, wind)\" and \"calculations\". Both its inner and outer trigrams are ☴ (巽 xùn) ground = (風) wind.","translation":"Ground","unicode":19960,"upperBinaryString":"011","yomi":"xùn","ichingTexts":{"text":{"cn":"巽：小亨，利攸往，利見大人。","en":"Xun intimates that (under the conditions which it denotes) there will be some little attainment and progress. There will be advantage in movement onward in whatever direction. It will be advantageous (also) to see the great man."},"tuanZhuan":{"cn":"重巽以申命，剛巽乎中正而志行。柔皆順乎剛，是以小亨，利有攸往，利見大人。","en":"The double Xun shows how, in accordance with it, (governmental) orders are reiterated. (We see that) the strong (fifth line) has penetrated into the central and correct place, and the will (of its subject) is being carried into effect; (we see also) the weak (first and fourth lines) both obedient to the strong lines (above them). It is hence said, 'There will be some little attainment and progress. There will be advantage in movement onward in whatever direction. It will be advantageous also to see the great man.'"},"xiangZhuan":{"cn":"隨風，巽；君子以申命行事。","en":"(Two trigrams representing) wind, following each other, form Xun. The superior man, in accordance with this, reiterates his orders, and secures the practice of his affairs."},"commentaries":[{"number":1,"text":{"cn":"初六：進退，利武人之貞。","en":"The first SIX, divided, shows its subject (now) advancing, (now) receding. It would be advantageous for him to have the firm correctness of a brave soldier."},"xiangZhuan":{"cn":"進退，志疑也。利武人之貞，志治也。","en":"'(Now) he advances, (now) he recedes:' - his mind is perplexed. 'It would be advantageous for him to have the firmness of a brave soldier:' - his mind would in that case be well governed."}},{"number":2,"text":{"cn":"九二：巽在床下，用史巫紛若，吉，无咎。","en":"The second NINE, undivided, shows the representative of Sun beneath a couch, and employing diviners and exorcists in a way bordering on confusion. There will be good fortune and no error."},"xiangZhuan":{"cn":"紛若之吉，得中也。","en":"'The good fortune springing from what borders on confusion' is due to the position (of the line) in the centre."}},{"number":3,"text":{"cn":"九三：頻巽，吝。","en":"The third NINE, undivided, shows its subject penetrating (only) by violent and repeated efforts. There will be occasion for regret."},"xiangZhuan":{"cn":"頻巽之吝，志窮也。","en":"'The regret arising from the violent and repeated efforts to penetrate' shows the exhaustion of the will."}},{"number":4,"text":{"cn":"六四：悔亡，田獲三品。","en":"The fourth SIX, divided, shows all occasion for repentance (in its subject) passed away. He takes game for its threefold use in his hunting."},"xiangZhuan":{"cn":"田獲三品，有功也。","en":"'He takes game in his hunting, enough for the threefold use of it:' - he achieves merit."}},{"number":5,"text":{"cn":"九五：貞吉悔亡，无不利。无初有終，先庚三日，後庚三日，吉。","en":"The fifth NINE, undivided, shows that with firm correctness there will be good fortune (to its subject). All occasion for repentance will disappear, and all his movements will be advantageous. There may have been no (good) beginning, but there will be a (good) end. Three days before making any changes, (let him give notice of them); and three days after, (let him reconsider them). There will (thus) be good fortune."},"xiangZhuan":{"cn":"九五之吉，位正中也。","en":"'The good fortune of (the subject of) the fifth NINE, undivided,' is owing to its correct position and its being in the centre."}},{"number":6,"text":{"cn":"上九：巽在床下，喪其資斧，貞凶。","en":"The sixth NINE, undivided, shows the representative of penetration beneath a couch, and having lost the axe with which he executed his decisions. However firm and correct he may (try to) be, there will be evil."},"xiangZhuan":{"cn":"巽在床下，上窮也。喪其資斧，正乎凶也。","en":"'The representative of penetration is beneath a couch:' - though occupying the topmost place, his powers are exhausted. 'He has lost the axe with which he executed his decisions:' - though he try to be correct, there will be evil."}}]}},{"binary":54,"binaryString":"110110","char":"䷹","id":58,"kanji":"兌","lowerBinaryString":"110","sameTrigram":true,"text":"Hexagram 58 is named 兌 (duì), \"Open\". Other variations include \"the joyous, lake\" and \"usurpation\". Both its inner and outer trigrams are ☱ (兌 duì) open = (澤) swamp.","translation":"Open","unicode":19961,"upperBinaryString":"110","yomi":"duì","ichingTexts":{"text":{"cn":"兌：亨，利貞。","en":"Dui intimates that (under its conditions) there will be progress and attainment. (But) it will be advantageous to be firm and correct."},"tuanZhuan":{"cn":"兌，說也。剛中而柔外，說以利貞，是以順乎天，而應乎人。說以先民，民忘其勞；說以犯難，民忘其死；說之大，民勸矣哉！","en":"Dui has the meaning of pleased satisfaction. (We have) the strong (lines) in the centre, and the weak (lines) on the outer edge (of the two trigrams), (indicating that) in pleasure what is most advantageous is the maintenance of firm correctness. Through this there will be found an accordance with (the will of) heaven, and a correspondence with (the feelings of) men. When (such) pleasure goes before the people, (and leads them on), they forget their toils; when it animates them in encountering difficulties, they forget (the risk of) death. How great is (the power of) this pleased satisfaction, stimulating in such a way the people!"},"xiangZhuan":{"cn":"麗澤，兌；君子以朋友講習。","en":"(Two symbols representing) the waters of a marsh, one over the other, form Dui. The superior man, in accordance with this, (encourages) the conversation of friends and (the stimulus of) their (common) practice."},"commentaries":[{"number":1,"text":{"cn":"初九：和兌，吉。","en":"The first NINE, undivided, shows the pleasure of (inward) harmony. There will be good fortune."},"xiangZhuan":{"cn":"和兌之吉，行未疑也。","en":"'The good fortune attached to the pleasure of (inward) harmony' arises from there being nothing in the conduct (of the subject of the line) to awaken doubt."}},{"number":2,"text":{"cn":"九二：孚兌，吉，悔亡。","en":"The second NINE, undivided, shows the pleasure arising from (inward) sincerity. There will be good fortune. Occasion for repentance will disappear."},"xiangZhuan":{"cn":"孚兌之吉，信志也。","en":"'The good fortune attached to the pleasure arising from (inward sincerity)' is due to the confidence felt in the object (of the subject of the line)."}},{"number":3,"text":{"cn":"六三：來兌，凶。","en":"The third SIX, divided, shows its subject bringing round himself whatever can give pleasure. There will be evil."},"xiangZhuan":{"cn":"來兌之凶，位不當也。","en":"'The evil predicated of one's bringing around himself whatever can give pleasure' is shown by the inappropriateness of the place (of the line)."}},{"number":4,"text":{"cn":"九四：商兌，未寧，介疾有喜。","en":"The fourth NINE, undivided, shows its subject deliberating about what to seek his pleasure in, and not at rest. He borders on what would be injurious, but there will be cause for joy."},"xiangZhuan":{"cn":"九四之喜，有慶也。","en":"'The joy in connexion with (the subject of) the fourth NINE, (undivided): is due to the happiness (which he will produce)."}},{"number":5,"text":{"cn":"九五：孚于剝，有厲。","en":"The fifth NINE, undivided, shows its subject trusting in one who would injure him. The situation is perilous."},"xiangZhuan":{"cn":"孚于剝，位正當也。","en":"'He trusts in one who would injure him:' - his place is that which is correct and appropriate."}},{"number":6,"text":{"cn":"上六：引兌。","en":"The topmost SIX, divided, shows the pleasure of its subject in leading and attracting others."},"xiangZhuan":{"cn":"上六引兌，未光也。","en":"'The topmost SIX, (divided), shows the pleasure (of its subject) in leading and attracting others:' - his (virtue) is not yet brilliant."}}]}},{"binary":19,"binaryString":"010011","char":"䷺","id":59,"kanji":"渙","lowerBinaryString":"010","sameTrigram":false,"text":"Hexagram 59 is named 渙 (huàn), \"Dispersing\". Other variations include \"dispersion (dissolution)\" and \"dispersal\". Its inner trigram is ☵ (坎 kǎn) gorge = (水) water, and its outer trigram is ☴ (巽 xùn) ground = (風) wind.","translation":"Dispersing","unicode":19962,"upperBinaryString":"011","yomi":"huàn","ichingTexts":{"text":{"cn":"渙：亨。王假有廟，利涉大川，利貞。","en":"Huan intimates that (under its conditions) there will be progress and success. The king goes to his ancestral temple; and it will be advantageous to cross the great stream. It will be advantageous to be firm and correct."},"tuanZhuan":{"cn":"渙，亨。剛來而不窮，柔得位乎外而上同。王假有廟，王乃在中也。利涉大川，乘木有功也。","en":"'Huan intimates that there will be progress and success:' - (we see) the strong line (in the second place) of the lower trigram, and not suffering any extinction there; and (also) the weak line occupying its place in the outer trigram, and uniting (its action) with that of the line above. 'The king goes to his ancestral temple:' - the king's (mind) is without any deflection. 'It will be advantageous to cross the great stream:' - (the subject of the hexagram) rides in (a vessel of) wood (over water), and will do so with success."},"xiangZhuan":{"cn":"風行水上，渙；先王以享于帝立廟。","en":"(The trigram representing) water and that for wind moving above the water form Huan. The ancient kings, in accordance with this, presented offerings to God and established the ancestral temple."},"commentaries":[{"number":1,"text":{"cn":"初六：用拯馬壯，吉。","en":"The first SIX, divided, shows its subject engaged in rescuing (from the impending evil) and having (the assistance of) a strong horse. There will be good fortune."},"xiangZhuan":{"cn":"初六之吉，順也。","en":"'The good fortune attached to the first six, divided),'is due to the natural course (pursued by its subject)."}},{"number":2,"text":{"cn":"九二：渙奔其机，悔亡。","en":"The second NINE, undivided, shows its subject, amid the dispersion, hurrying to his contrivance (for security). All occasion for repentance will disappear."},"xiangZhuan":{"cn":"渙奔其机，得愿也。","en":"'Amidst the prevailing dispersion, he hurries to his contrivance (for security):' - he gets what he desires."}},{"number":3,"text":{"cn":"六三：渙其躬，无悔。","en":"The third SIX, divided, shows its subject discarding any regard to his own person. There will be no occasion for repentance."},"xiangZhuan":{"cn":"渙其躬，志在外也。","en":"'He has no regard to his own person:' - his aim is directed to what is external to himself."}},{"number":4,"text":{"cn":"六四：渙其群，元吉。渙有丘，匪夷所思。","en":"The fourth SIX, divided, shows its subject scattering the (different) parties (in the state); which leads to great good fortune. From the dispersion (he collects again good men standing out, a crowd) like a mound, which is what ordinary men would not have thought of."},"xiangZhuan":{"cn":"渙其群，元吉；光大也。","en":"'He scatters the (different) parties (in the state), and there is great good fortune:' - brilliant and great (are his virtue and service)."}},{"number":5,"text":{"cn":"九五：渙汗其大號，渙王居，无咎。","en":"The fifth NINE, undivided, shows its subject amidst the dispersion issuing his great announcements as the perspiration (flows from his body). He scatters abroad (also) the accumulations in the royal granaries. There will be no error."},"xiangZhuan":{"cn":"王居无咎，正位也。","en":"'The accumulations of the royal (granaries) are dispersed, and there is no error:' - this is due to the correctness of the position."}},{"number":6,"text":{"cn":"上九：渙其血，去逖出，无咎。","en":"The topmost NINE, undivided, shows its subject disposing of (what may be called) its bloody wounds, and going and separating himself from its anxious fears. There will be no error."},"xiangZhuan":{"cn":"渙其血，遠害也。","en":"'His bloody wounds are gone:' - he is far removed from the danger of injury."}}]}},{"binary":50,"binaryString":"110010","char":"䷻","id":60,"kanji":"節","lowerBinaryString":"110","sameTrigram":false,"text":"Hexagram 60 is named 節 (jié), \"Articulating\". Other variations include \"limitation\" and \"moderation\". Its inner trigram is ☱ (兌 duì) open = (澤) swamp, and its outer trigram is ☵ (坎 kǎn) gorge = (水) water.","translation":"Articulating","unicode":19963,"upperBinaryString":"010","yomi":"jié","ichingTexts":{"text":{"cn":"節：亨。苦節，不可貞。","en":"Jie intimates that (under its conditions) there will be progress and attainment. (But) if the regulations (which it prescribes) be severe and difficult, they cannot be permanent."},"tuanZhuan":{"cn":"節，亨，剛柔分，而剛得中。苦節不可貞，其道窮也。說以行險，當位以節，中正以通。天地節而四時成，節以制度，不傷財，不害民。","en":"'Jie intimates progress and attainment:' - the strong and weak (lines) are equally divided, and the strong lines occupy the central places. 'If the regulations (which Jie prescribes) be severe and difficult, they cannot be permanent:' - its course (of action) will in that case come to an end. (We have the feeling of) pleasure and satisfaction directing the course amidst peril. (We have) all regulations controlled (by authority) in its proper place. (We have) free action proceeding from the central and correct position. Heaven and earth observe their regular terms, and we have the four seasons complete. (If rulers) frame their measures according to (the due) regulations, the resources (of the state) suffer no injury, and the people receive no hurt."},"xiangZhuan":{"cn":"澤上有水，節；君子以制數度，議德行。","en":"(The trigram representing) a lake, and above it that for water, form Jie. The superior man, in accordance with this, constructs his (methods of) numbering and measurement, and discusses (points of) virtue and conduct."},"commentaries":[{"number":1,"text":{"cn":"初九：不出戶庭，无咎。","en":"The first NINE, undivided, shows its subject not quitting the courtyard outside his door. There will be no error."},"xiangZhuan":{"cn":"不出戶庭，知通塞也。","en":"'He does not quit the courtyard outside his door:' - he knows when he has free course and when he is obstructed."}},{"number":2,"text":{"cn":"九二：不出門庭，凶。","en":"The second NINE, undivided, shows its subject not quitting the courtyard inside his gate. There will be evil."},"xiangZhuan":{"cn":"不出門庭，失時極也。","en":"'He does not quit the courtyard inside his gate. There will be evil:' - he loses the time (for action) to an extreme degree."}},{"number":3,"text":{"cn":"六三：不節若，則嗟若，无咎。","en":"The third SIX, divided, shows its subject with no appearance of observing the (proper) regulations, in which case we shall see him lamenting. But there will be no one to blame (but himself)."},"xiangZhuan":{"cn":"不節之嗟，又誰咎也。","en":"In 'the lamentation for not observing the (proper) regulations,' who should there be to blame?"}},{"number":4,"text":{"cn":"六四：安節，亨。","en":"The fourth SIX, divided, shows its subject quietly and naturally (attentive to all) regulations. There will be progress and success."},"xiangZhuan":{"cn":"安節之亨，承上道也。","en":"'The progress and success of the quiet and natural (attention) to all regulations' is due to the deference which accepts the ways of (the ruler) above."}},{"number":5,"text":{"cn":"九五：甘節，吉；往有尚。","en":"The fifth NINE, undivided, shows its subject sweetly and acceptably enacting his regulations. There will be good fortune. The onward progress with them will afford ground for admiration."},"xiangZhuan":{"cn":"甘節之吉，居位中也。","en":"'The good fortune arising from the regulations enacted sweetly and acceptably' is due to (the line) occupying the place (of authority) and being in the centre."}},{"number":6,"text":{"cn":"上六：苦節，貞凶，悔亡。","en":"The topmost SIX, divided, shows its subject enacting regulations severe and difficult. Even with firmness and correctness there will be evil. But though there will be cause for repentance, it will (by and by) disappear."},"xiangZhuan":{"cn":"苦節貞凶，其道窮也。","en":"'The regulations are severe and difficult. Even with firm correctness there will be evil:' - the course (indicated by the hexagram) is come to an end."}}]}},{"binary":51,"binaryString":"110011","char":"䷼","id":61,"kanji":"中孚","lowerBinaryString":"110","sameTrigram":false,"text":"Hexagram 61 is named 中孚 (zhōng fú), \"Center Returning\". Other variations include \"inner truth\" and \"central return\". Its inner trigram is ☱ (兌 duì) open = (澤) swamp, and its outer trigram is ☴ (巽 xùn) ground = (風) wind.","translation":"Center Returning","unicode":19964,"upperBinaryString":"011","yomi":"zhōng fú","ichingTexts":{"text":{"cn":"中孚：豚魚吉，利涉大川，利貞。","en":"Zhong Fu (moves even) pigs and fish, and leads to good fortune. There will be advantage in crossing the great stream. There will be advantage in being firm and correct."},"tuanZhuan":{"cn":"中孚，柔在內而剛得中。說而巽，孚，乃化邦也。豚魚吉，信及豚魚也。利涉大川，乘木舟虛也。中孚以利貞，乃應乎天也。","en":"In Zhong Fu we have the (two) weak lines in the innermost part (of the figure), and strong lines occupying the central places (in the trigrams). (We have the attributes) of pleased satisfaction and flexible penetration. Sincerity (thus symbolled) will transform a country. 'Pigs and fish (are moved), and there will be good fortune:' - sincerity reaches to (and affects even) pigs and fishes. 'There will be advantage in crossing the great stream:' - (we see in the figure) one riding on (the emblem of) wood, which forms an empty boat. In (the exercise of the virtue denoted by) Zhong Fu, (it is said that) 'there will be advantage in being firm and correct:' - in that virtue indeed we have the response (of man) to Heaven."},"xiangZhuan":{"cn":"澤上有風，中孚；君子以議獄緩死。","en":"(The trigram representing the waters of) a marsh and that for wind above it form Zhong Fu. The superior man, in accordance with this, deliberates about cases of litigation and delays (the infliction of) death."},"commentaries":[{"number":1,"text":{"cn":"初九：虞吉，有它不燕。","en":"I. The first NINE, undivided, shows its subject resting (in himself). There will be good fortune. If he sought to any other, he would not find rest."},"xiangZhuan":{"cn":"初九虞吉，志未變也。","en":"'The first NINE, (undivided), shows its subject resting (in himself). There will be good fortune:' - no change has yet come over his purpose."}},{"number":2,"text":{"cn":"九二：鳴鶴在陰，其子和之，我有好爵，吾與爾靡之。","en":"The second NINE, undivided, shows its subject (like) the crane crying out in her hidden retirement, and her young ones responding to her. (It is as if it were said), 'I have a cup of good spirits,' (and the response were), 'I will partake of it with you.'"},"xiangZhuan":{"cn":"其子和之，中心願也。","en":"'Her young ones respond to her:' - from the (common) wish of the inmost heart."}},{"number":3,"text":{"cn":"六三：得敵，或鼓或罷，或泣或歌。","en":"The third SIX, divided, shows its subject having met with his mate. Now he beats his drum, and now he leaves off. Now he weeps, and now he sings."},"xiangZhuan":{"cn":"可鼓或罷，位不當也。","en":"'Now he beats his drum, and now he leaves off:' - the position (of the line) is the appropriate one for it."}},{"number":4,"text":{"cn":"六四：月幾望，馬匹亡，无咎。","en":"The fourth SIX, divided, shows its subject (like) the moon nearly full, and (like) a horse (in a chariot) whose fellow disappears. There will be no error."},"xiangZhuan":{"cn":"馬匹亡，絕類上也。","en":"'A horse the fellow of which disappears:' - he breaks from his (former) companions, and mounts upwards."}},{"number":5,"text":{"cn":"九五：有孚攣如，无咎。","en":"The fifth NINE, undivided, shows its subject perfectly sincere, and linking (others) to him in closest union. There will be no error."},"xiangZhuan":{"cn":"有孚攣如，位正當也。","en":"'He is perfectly sincere, and links others to him in closest union:' - the place (of the line) is the correct and appropriate one."}},{"number":6,"text":{"cn":"上九：翰音登于天，貞凶。","en":"The topmost NINE, undivided, shows its subject in chanticleer (trying to) mount to heaven. Even with firm correctness there will be evil."},"xiangZhuan":{"cn":"翰音登于天，何可長也。","en":"'Chanticleer (tries to) mount to heaven:' - but how can (such an effort) continue long?"}}]}},{"binary":12,"binaryString":"001100","char":"䷽","id":62,"kanji":"小過","lowerBinaryString":"001","sameTrigram":false,"text":"Hexagram 62 is named 小過 (xiǎo guò), \"Small Exceeding\". Other variations include \"preponderance of the small\" and \"small surpassing\". Its inner trigram is ☶ (艮 gèn) bound = (山) mountain, and its outer trigram is ☳ (震 zhèn) shake = (雷) thunder.","translation":"Small Exceeding","unicode":19965,"upperBinaryString":"100","yomi":"xiǎo guò","ichingTexts":{"text":{"cn":"小過：亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上，宜下，大吉。","en":"Xiao Guo indicates that (in the circumstances which it implies) there will be progress and attainment. But it will be advantageous to be firm and correct. (What the name denotes) may be done in small affairs, but not in great affairs. (It is like) the notes that come down from a bird on the wing - to descend is better than to ascend. There will (in this way) be great good fortune."},"tuanZhuan":{"cn":"小過，小者過而亨也。過以利貞，與時行也。柔得中，是以小事吉也。剛失位而不中，是以不可大事也。有飛鳥之象焉，有飛鳥遺之音，不宜上宜下，大吉；上逆而下順也。","en":"In Xiao Guo (we see) the small (lines) exceeding the others, and (giving the intimation of) progress and attainment. Such 'exceeding, in order to its being advantageous, must be associated with firmness and correctness:' - that is, it must take place (only) according to (the requirements of) the time. The weak (lines) are in the central places, and hence (it is said that what the name denotes) may be done in small affairs, and there will be good fortune. Of the strong (lines one) is not in its proper place, and (the other) is not central, hence it is said that (what the name denotes) 'should not be done in great affairs.' (In the hexagram) we have 'the symbol of a bird on the wing, and of the notes that come down from such a bird, for which it is better to descend than to ascend, thereby leading to great good fortune:' - to ascend is contrary to what is reasonable in the case, while to descend is natural and right."},"xiangZhuan":{"cn":"山上有雷，小過；君子以行過乎恭，喪過乎哀，用過乎儉。","en":"(The trigram representing) a hill and that for thunder above it form Xiao Guo. The superior man, in accordance with this, in his conduct exceeds in humility, in mourning exceeds in sorrow, and in his expenditure exceeds in economy."},"commentaries":[{"number":1,"text":{"cn":"初六：飛鳥以凶。","en":"The first SIX, divided, suggests (the idea of) a bird flying, (and ascending) till the issue is evil."},"xiangZhuan":{"cn":"飛鳥以凶，不可如何也。","en":"'There is a bird flying (and ascending) till the result is evil:' - nothing can be done to avoid this issue."}},{"number":2,"text":{"cn":"六二：過其祖，遇其妣；不及其君，遇其臣；无咎。","en":"The second SIX, divided, shows its subject passing by his grandfather, and meeting with his grandmother; not attempting anything against his ruler, but meeting him as his minister. There will be no error."},"xiangZhuan":{"cn":"不及其君，臣不可過也。","en":"'He does not attempt to reach his ruler:' - a minister should not overpass the distance (between his ruler and himself)."}},{"number":3,"text":{"cn":"九三：弗過防之，從或戕之，凶。","en":"The third NINE, undivided, shows its subject taking no extraordinary precautions against danger; and some in consequence finding opportunity to assail and injure him. There will be evil."},"xiangZhuan":{"cn":"從或戕之，凶如何也。","en":"'Some in consequence find opportunity to assail and injure him. There will be evil:' - how great will it be!"}},{"number":4,"text":{"cn":"九四：无咎，弗過遇之。往厲必戒，勿用永貞。","en":"The fourth NINE, undivided, shows its subject falling into no error, but meeting (the exigency of his situation), without exceeding (in his natural. course). If he go forward, there will be peril, and he must be cautious. There is no occasion to be using firmness perpetually."},"xiangZhuan":{"cn":"弗過遇之，位不當也。往厲必戒，終不可長也。","en":"'He meets the exigency (of his situation), without exceeding (the proper course):' - (he does so), the position being inappropriate (for a strong line). 'If he go forward, there will be peril, and he must be cautious:' - the result would be that his course would not be long pursued."}},{"number":5,"text":{"cn":"六五：密雲不雨，自我西郊，公弋取彼在穴。","en":"The fifth SIX, divided, (suggests the idea) of dense clouds, but no rain, coming from our borders in the west. It also (shows) the prince shooting his arrow, and taking the bird in a cave."},"xiangZhuan":{"cn":"密雲不雨，已上也。","en":"'There are dense clouds, but no rain:' - (the line) is in too high a place."}},{"number":6,"text":{"cn":"上六：弗遇過之，飛鳥離之，凶，是謂災眚。","en":"The sixth SIX, divided, shows. its subject not meeting (the exigency of his situation), and exceeding (his proper course). (It suggests the idea of) a bird flying far aloft. There will be evil. The case is what is called one of calamity and self-produced injury."},"xiangZhuan":{"cn":"弗遇過之，已亢也。","en":"'He does not meet the exigency (of his situation), and exceeds (his proper course):' - (the position indicates) the habit of domineering."}}]}},{"binary":42,"binaryString":"101010","char":"䷾","id":63,"kanji":"既濟","lowerBinaryString":"101","sameTrigram":false,"text":"Hexagram 63 is named 既濟 (jì jì), \"Already Fording\". Other variations include \"after completion\" and \"already completed\" or \"already done\". Its inner trigram is ☲ (離 lí) radiance = (火) fire, and its outer trigram is ☵ (坎 kǎn) gorge = (水) water.","translation":"Already Fording","unicode":19966,"upperBinaryString":"010","yomi":"jì jì","ichingTexts":{"text":{"cn":"既濟：亨，小利貞，初吉終亂。","en":"Ji Ji intimates progress and success in small matters. There will be advantage in being firm and correct. There has been good fortune in the beginning; there may be disorder in the end."},"tuanZhuan":{"cn":"既濟，亨，小者亨也。利貞，剛柔正而位當也。初吉，柔得中也。終止則亂，其道窮也。","en":"'Ji Ji intimates progress and success:' - in small matters, that is, there will be that progress and success. 'There will be advantage in being firm and correct:' - the strong and weak (lines) are correctly arranged, each in its appropriate place. 'There has been good fortune in the beginning: - the weak (second line) is in the centre. 'In the end' there is a cessation (of effort), and 'disorder arises:' - the course (that led to rule and order) is (now) exhausted."},"xiangZhuan":{"cn":"水在火上，既濟；君子以思患而預防之。","en":"(The trigram representing) fire and that for water above it form Ji Ji. The superior man, in accordance with this, thinks of evil (that may come), and beforehand guards against it."},"commentaries":[{"number":1,"text":{"cn":"初九：曳其輪，濡其尾，无咎。","en":"The first NINE, undivided, (shows its subject as a driver) who drags back his wheel, (or as a fox) which has wet his tail. There will be no error."},"xiangZhuan":{"cn":"曳其輪，義无咎也。","en":"'He drags back his wheel:' - as we may rightly judge, there will be no mistake."}},{"number":2,"text":{"cn":"六二：婦喪其茀，勿逐，七日得。","en":"The second SIX, divided, (shows its subject as) a wife who has lost her (carriage-)screen. There is no occasion to go in pursuit of it. In seven days she will find it."},"xiangZhuan":{"cn":"七日得，以中道也。","en":"'In seven days she will find it:' - for the course pursued is that indicated by the central position (of the line)."}},{"number":3,"text":{"cn":"九三：高宗伐鬼方，三年克之，小人勿用。","en":"The third NINE, undivided, (suggests the case of) K?o ?ung, who attacked the Demon region, but was three years in subduing it. Small men should not be employed (in such enterprises)."},"xiangZhuan":{"cn":"三年克之，憊也。","en":"'He was three years in subduing it:' - enough to make him weary."}},{"number":4,"text":{"cn":"六四：繻有衣袽，終日戒。","en":"The fourth SIX, divided, shows its subject with rags provided against any leak (in his boat), and on his guard all day long."},"xiangZhuan":{"cn":"終日戒，有所疑也。","en":"'He is on his guard all the day:' - he is in doubt about something."}},{"number":5,"text":{"cn":"九五：東鄰殺牛，不如西鄰之禴祭，實受其福。","en":"The fifth NINE, undivided, shows its subject (as) the neighbour in the east who slaughters an ox (for his sacrifice); but this is not equal to the (small) spring sacrifice of the neighbour in the west, whose sincerity receives the blessing."},"xiangZhuan":{"cn":"東鄰殺牛，不如西鄰之時也；實受其福，吉大來也。","en":"'The slaughtering of an ox by the neighbour in the east is not equal to (the small sacrifice of) the neighbour in the west:' - because the time (in the latter case is more important and fit). 'His sincerity receives the blessing:' - good fortune comes on a great scale."}},{"number":6,"text":{"cn":"上六：濡其首，厲。","en":"The topmost SIX, divided, shows its subject with (even) his head immersed. The position is perilous."},"xiangZhuan":{"cn":"濡其首厲，何可久也。","en":"'His head is immersed; the position is perilous:' - how could such a state continue long?"}}]}},{"binary":21,"binaryString":"010101","char":"䷿","id":64,"kanji":"未濟","lowerBinaryString":"010","sameTrigram":false,"text":"Hexagram 64 is named 未濟 (wèi jì), \"Not Yet Fording\". Other variations include \"before completion\" and \"not yet completed\". Its inner trigram is ☵ (坎 kǎn) gorge = (水) water, and its outer trigram is ☲ (離 lí) radiance = (火) fire.","translation":"Not Yet Fording","unicode":19967,"upperBinaryString":"101","yomi":"wèi jì","ichingTexts":{"text":{"cn":"未濟：亨，小狐汔濟，濡其尾，无攸利。","en":"Wei Ji intimates progress and success (in the circumstances which it implies). (We see) a young fox that has nearly crossed (the stream), when its tail gets immersed. There will be no advantage in any way."},"tuanZhuan":{"cn":"未濟，亨；柔得中也。小狐汔濟，未出中也。濡其尾，无攸利；不續終也。雖不當位，剛柔應也。","en":"'Wei Ji intimates progress and success (in the circumstances which it implies):' - the weak (fifth) line is in the centre. 'The young fox has nearly crossed the stream:' - but he has not yet escaped from the midst (of the danger and calamity). 'Its tail gets immersed. There will be no advantage in any way:' - there is not at the end a continuance (of the purpose) at the beginning. Although the places (of the different lines) are not those appropriate to them, yet a strong (line) and a weak (line always) respond to each other."},"xiangZhuan":{"cn":"火在水上，未濟；君子以慎辨物居方。","en":"(The trigram representing) water and that for fire above it form Wei Ji. The superior man, in accordance with this, carefully discriminates among (the qualities of) things, and the (different) positions they (naturally) occupy."},"commentaries":[{"number":1,"text":{"cn":"初六：濡其尾，吝。","en":"The first SIX, divided, shows its subject (like a fox) whose tail gets immersed. There will be occasion for regret."},"xiangZhuan":{"cn":"濡其尾，亦不知極也。","en":"'His tail gets immersed:' - this is the very height of ignorance."}},{"number":2,"text":{"cn":"九二：曳其輪，貞吉。","en":"The second NINE, undivided, shows its subject dragging back his (carriage-) wheel. With firmness and correctness there will be good fortune."},"xiangZhuan":{"cn":"九二貞吉，中以行正也。","en":"'The second NINE, (undivided), shows good fortune arising from being firm and correct:' - it is in the central place, and the action of its subject thereby becomes correct."}},{"number":3,"text":{"cn":"六三：未濟，征凶，利涉大川。","en":"The third SIX, divided, shows its subject, with (the state of things) not yet remedied, advancing on; which will lead to evil. But there will be advantage in (trying to) cross the great stream."},"xiangZhuan":{"cn":"未濟征凶，位不當也。","en":"'(The state of things is) not yet remedied. Advancing will lead to evil:' - the place (of the line) is not that appropriate for it."}},{"number":4,"text":{"cn":"九四：貞吉，悔亡，震用伐鬼方，三年有賞于大國。","en":"The fourth NINE, undivided, shows its subject by firm correctness obtaining good fortune, so that all occasion for repentance disappears. Let him stir himself up, as if he were invading the Demon region, where for three years rewards will come to him (and his troops) from the great kingdom."},"xiangZhuan":{"cn":"貞吉悔亡，志行也。","en":"(By firm correctness there is good fortune, and cause for repentance disappears:' - the aim (of the subject of the line) is carried into effect."}},{"number":5,"text":{"cn":"六五：貞吉，无悔，君子之光，有孚，吉。","en":"The fifth SIX, divided, shows its subject by firm correctness obtaining good fortune, and having no occasion for repentance. (We see in him) the brightness of a superior man, and the possession of sincerity. There will be good fortune."},"xiangZhuan":{"cn":"君子之光，其暉吉也。","en":"'(We see) the brightness of a superior man: - 'the diffusion of that brightness tends to good fortune."}},{"number":6,"text":{"cn":"上九：有孚于飲酒，无咎，濡其首，有孚失是。","en":"The topmost NINE, undivided, shows its subject full of confidence and therefore feasting (quietly). There will be no error. (If he) cherish this confidence, till he (is like the fox who) gets his head immersed, it will fail of what is right."},"xiangZhuan":{"cn":"飲酒濡首，亦不知節也。","en":"'He drinks and gets his head immersed:' - he does not know how to submit to the (proper) regulations."}}]}}]