{
  "name": "䷖",
  "text": {
    "cn": "剝：不利有攸往。",
    "en": "Bo indicates that (in the state which it symbolises) it will not be advantageous to make a movement in any direction whatever."
  },
  "tuanZhuan": {
    "cn": "剝，剝也，柔變剛也。不利有攸往，小人長也。順而止之，觀象也。君子尚消息盈虛，天行也。",
    "en": "Bo denotes overthrowing or being overthrown. We see (in the figure) the weak lines (threatening to) change the (last) strong line (into one of themselves). That 'it will not be advantageous to make a movement in any direction whatever' appears from the fact that the small men are (now) growing and increasing. The superior man acts according to (the exigency of the time), and stops all forward movement, looking at the (significance of the) symbolic figures (in the hexagram). He values the processes of decrease and increase, of fulness and decadence, (as seen) in the movements of the heavenly bodies."
  },
  "xiangZhuan": {
    "cn": "山附地上，剝；上以厚下，安宅。",
    "en": "(The trigrams representing) the earth, and (above it) that for a mountain, which adheres to the earth, form Bo. Superiors, in accordance with this, seek to strengthen those below them, to secure the peace and stability of their own position."
  },
  "commentaries": [
    {
      "number": 1,
      "text": {
        "cn": "初六：剝床以足，蔑貞凶。",
        "en": "The first SIX, divided, shows one overturning the couch by injuring its legs. (The injury will go on to) the destruction of (all) firm correctness, and there will be evil."
      },
      "xiangZhuan": {
        "cn": "剝床以足，以滅下也。",
        "en": "'He overthrows the couch by injuring its legs:' - thus (he commences) his work of ruin with what is lowest (in the superior man)."
      }
    },
    {
      "number": 2,
      "text": {
        "cn": "六二：剝床以辨，蔑貞凶。",
        "en": "The second SIX, divided, shows one overthrowing the couch by injuring its frame. (The injury will go on to) the destruction of (all) firm correctness, and there will be evil."
      },
      "xiangZhuan": {
        "cn": "剝床以辨，未有與也。",
        "en": "'He destroys the couch by injuring its frame:' - (the superior man) has as yet no associates."
      }
    },
    {
      "number": 3,
      "text": {
        "cn": "六三：剝之，无咎。",
        "en": "The third SIX, divided, shows its subject among the overthrowers; but there will be no error."
      },
      "xiangZhuan": {
        "cn": "剝之无咎，失上下也。",
        "en": "That 'there will be no error on the part of this one among the overthrowers' arises from the difference between him and the others above and below."
      }
    },
    {
      "number": 4,
      "text": {
        "cn": "六四：剝床以膚，凶。",
        "en": "The fourth SIX, divided, shows its subject having overthrown the couch, and (going to injure) the skin (of him who lies on it). There will be evil."
      },
      "xiangZhuan": {
        "cn": "剝床以膚，切近災也。",
        "en": "'He has overthrown the couch, and (proceeds to injure) the skin (of him who lies on it):' - calamity is very near at hand."
      }
    },
    {
      "number": 5,
      "text": {
        "cn": "六五：貫魚，以宮人寵，无不利。",
        "en": "The fifth SIX, divided, shows (its subject leading on the others like) a string of fishes, and (obtaining for them) the favour that lights on the inmates of the palace. There will be advantage in every way."
      },
      "xiangZhuan": {
        "cn": "以宮人寵，終无尤也。",
        "en": "'He obtains for them the favour that lights on the inmates of the palace:' - in the end there will be no grudge against him."
      }
    },
    {
      "number": 6,
      "text": {
        "cn": "上九：碩果不食，君子得輿，小人剝廬。",
        "en": "The topmost NINE, undivided, shows its subject (as) a great fruit which has not been eaten. The superior man finds (the people again) as a chariot carrying him. The small men (by their course) overthrow their own dwellings."
      },
      "xiangZhuan": {
        "cn": "君子得輿，民所載也。小人剝廬，終不可用也。",
        "en": "'The superior man finds himself in a carriage:' - he is carried along by the people. 'The small men (by their course) overthrow their own dwellings:' - they can. never again be of use to them."
      }
    }
  ]
}
