{
  "name": "䷠",
  "text": {
    "cn": "遯：亨，小利貞。",
    "en": "Dun indicates successful progress (in its circumstances). To a small extent it will (still) be advantageous to be firm and correct."
  },
  "tuanZhuan": {
    "cn": "遯亨，遯而亨也。剛當位而應，與時行也。小利貞，浸而長也。遯之時義大矣哉！",
    "en": "'Dun indicates successful progress:' - that is, in the very retiring which Dun denotes there is such progress. The strong (line) is in the ruling place, (the fifth), and is properly responded to (by the second line). The action takes place according to (the requirement of) the time. 'To a small extent it will (still) be advantageous to be firm and correct:' - (the small men) are gradually encroaching and advancing. Great indeed is the significance of (what is required to be done in) the time that necessitates retiring."
  },
  "xiangZhuan": {
    "cn": "天下有山，遯；君子以遠小人，不惡而嚴。",
    "en": "(The trigram representing) the sky and below it that for a mountain form Dun. The superior man, in accordance with this, keeps small men at a distance, not by showing that he hates them, but by his own. dignified gravity."
  },
  "commentaries": [
    {
      "number": 1,
      "text": {
        "cn": "初六：遯尾，厲，勿用有攸往。",
        "en": "The first SIX, divided, shows a retiring tail. The position is perilous. No movement in any direction should be made."
      },
      "xiangZhuan": {
        "cn": "遯尾之厲，不往何災也。",
        "en": "There is 'the perilousness of the position shown by the retiring tail:' - but if 'no movement' be made, what disaster can there be?"
      }
    },
    {
      "number": 2,
      "text": {
        "cn": "六二：執之用黃牛之革，莫之勝說。",
        "en": "The second SIX, divided, shows its subject holding (his purpose) fast as if by a (thong made from the) hide of a yellow ox, which cannot be broken."
      },
      "xiangZhuan": {
        "cn": "執用黃牛，固志也。",
        "en": "'He holds it as; by (a thong from the hide of) a yellow ox:' - his purpose is firm."
      }
    },
    {
      "number": 3,
      "text": {
        "cn": "九三：係遯，有疾厲，畜臣妾吉。",
        "en": "The third NINE, undivided, shows one retiring but bound,--to his distress and peril. (If he were to deal with his binders as in) nourishing a servant or concubine, it would be fortunate for him."
      },
      "xiangZhuan": {
        "cn": "係遯之厲，有疾憊也。畜臣妾吉，不可大事也。",
        "en": "'The peril connected with the case of one retiring, though bound,' is due to the (consequent) distress and exhaustion. 'If he were (to deal as in) nourishing a servant or concubine, it would be fortunate for him:' - but a great affair cannot be dealt with in this way."
      }
    },
    {
      "number": 4,
      "text": {
        "cn": "九四：好遯，君子吉，小人否。",
        "en": "The fourth NINE, undivided, shows its subject retiring notwithstanding his likings. In a superior man this will lead to good fortune; a small man cannot attain to this."
      },
      "xiangZhuan": {
        "cn": "君子好遯，小人否也。",
        "en": "'A superior man retires notwithstanding his likings; a small man cannot attain to this.'"
      }
    },
    {
      "number": 5,
      "text": {
        "cn": "九五：嘉遯，貞吉。",
        "en": "The fifth NINE, undivided, shows its subject retiring in an admirable way. With firm correctness there will be good fortune."
      },
      "xiangZhuan": {
        "cn": "嘉遯貞吉，以正志也。",
        "en": "'He retires in an admirable way, and with firm correctness there will be good fortune:' - this is due to the rectitude of his purpose."
      }
    },
    {
      "number": 6,
      "text": {
        "cn": "上九：肥遯，无不利。",
        "en": "The sixth NINE, undivided, shows its subject retiring in a noble way. It will be advantageous in every respect."
      },
      "xiangZhuan": {
        "cn": "肥遯，无不利；无所疑也。",
        "en": "'He retires in a noble way, and his doing so will be advantageous in every respect:' - he who does so has no doubts about his course."
      }
    }
  ]
}