{
  "name": "䷰",
  "text": {
    "cn": "革：巳日乃孚，元亨利貞，悔亡。",
    "en": "(What takes place as indicated by) Ge is believed in only after it has been accomplished. There will be great progress and success. Advantage will come from being firm and correct. (In that case) occasion for repentance will disappear."
  },
  "tuanZhuan": {
    "cn": "革，水火相息，二女同居，其志不相得，曰革。巳日乃孚；革而信也。文明以說，大亨以正，革而當，其悔乃亡。天地革而四時成，湯武革命，順乎天而應乎人，革之時大矣哉！",
    "en": "In Ge (we see) water and fire extinguishing each other; (we see also) two daughters dwelling together, but with their minds directed to different objects: - (on account of these things) it is called (the hexagram of) Change. 'It is believed in (only) after it has been accomplished:' - when the change has been made, faith is accorded to it. (We have) cultivated intelligence (as the basis of) pleased satisfaction, (suggesting) 'great progress and success,' coming from what is correct. When change thus takes place in the proper way, 'occasion for repentance disappears.' Heaven and earth undergo their changes, and the four seasons complete their functions. Thang changed the appointment (of the line of Hsi? to the throne), and Wu (that of the line of Shang), in accordance with (the will of) Heaven, and in response to (the wishes of) men. Great indeed is what takes place in a time of change."
  },
  "xiangZhuan": {
    "cn": "澤中有火，革；君子以治歷明時。",
    "en": "(The trigram representing the waters of) a marsh and that for fire in the midst of them form Ge. The superior man, in accordance with this, regulates his (astronomical) calculations, and makes clear the seasons and times."
  },
  "commentaries": [
    {
      "number": 1,
      "text": {
        "cn": "初九：鞏用黃牛之革。",
        "en": "The first NINE, undivided, shows its subject (as if he were) bound with the skin of a yellow ox."
      },
      "xiangZhuan": {
        "cn": "鞏用黃牛，不可以有為也。",
        "en": "'He is bound with (the skin of) a yellow ox:' - he should in his circumstances be taking action."
      }
    },
    {
      "number": 2,
      "text": {
        "cn": "六二：巳日乃革之，征吉，无咎。",
        "en": "The second SIX, divided, shows its subject making his changes after some time has passed. Action taken will be fortunate. There will be no error."
      },
      "xiangZhuan": {
        "cn": "巳日革之，行有嘉也。",
        "en": "'He makes his changes when some time has passed:' - what he does will be matter of admiration."
      }
    },
    {
      "number": 3,
      "text": {
        "cn": "九三：征凶，貞厲，革言三就，有孚。",
        "en": "The third NINE, undivided, shows that action taken by its subject will be evil. Though he be firm and correct, his position is perilous. If the change (he contemplates) have been three times fully discussed, he will be believed in."
      },
      "xiangZhuan": {
        "cn": "革言三就，又何之矣。",
        "en": "'The change (contemplated) has been three times fully discussed:' - to what else should attention (now) be directed?"
      }
    },
    {
      "number": 4,
      "text": {
        "cn": "九四：悔亡，有孚改命，吉。",
        "en": "The fourth NINE, undivided, shows occasion for repentance disappearing (from its subject). Let him be believed in; and though he change (existing) ordinances, there will be good fortune."
      },
      "xiangZhuan": {
        "cn": "改命之吉，信志也。",
        "en": "'The good fortune consequent on changing (existing) ordinances' is due to the faith reposed in his aims."
      }
    },
    {
      "number": 5,
      "text": {
        "cn": "九五：大人虎變，未占有孚。",
        "en": "The fifth NINE, undivided, shows the great man (producing his changes) as the tiger (does when he) changes (his stripes). Before he divines (and proceeds to action), faith has been reposed in him."
      },
      "xiangZhuan": {
        "cn": "大人虎變，其文炳也。",
        "en": "'The great man produces his changes as the tiger does when he changes his stripes:' - their beauty becomes more brilliant."
      }
    },
    {
      "number": 6,
      "text": {
        "cn": "上六：君子豹變，小人革面，征凶，居貞吉。",
        "en": "The sixth SIX, divided, shows the superior man producing his changes as the leopard (does when he) changes (his spots), while small men change their faces (and show their obedience). To go forward (now) would lead to evil, but there will be good fortune in abiding firm and correct."
      },
      "xiangZhuan": {
        "cn": "君子豹變，其文蔚也。小人革面，順以從君也。",
        "en": "'The superior man produces his changes as the leopard does when he changes his spots:' - their beauty becomes more elegant. 'Small men change their faces:' - they show themselves prepared to follow their ruler."
      }
    }
  ]
}