{
  "name": "䷫",
  "text": {
    "cn": "姤：女壯，勿用取女。",
    "en": "Gou shows a female who is bold and strong. It will not be good to marry (such) a female."
  },
  "tuanZhuan": {
    "cn": "姤，遇也，柔遇剛也。勿用取女，不可與長也。天地相遇，品物咸章也。剛遇中正，天下大行也。姤之時義大矣哉！",
    "en": "Gou has the significance of unexpectedly coming on. (We see in it) the weak (line) coming unexpectedly on the strong ones. 'It will not be good to marry (such) a female:' - one (so symbolised) should not be long associated with. Heaven and earth meeting together (as here represented), all the variety of natural things become fully displayed. When a strong (line) finds itself in the central and correct position, (good government) will greatly prevail all under the sky. Great indeed is the significance of what has to be done at the time indicated by Gou!"
  },
  "xiangZhuan": {
    "cn": "天下有風，姤；后以施命誥四方。",
    "en": "(The trigram representing) wind and that for the sky above it form Gou. The sovereign, in accordance with this, delivers his charges, and promulgates his announcements throughout the four quarters (of the kingdom)."
  },
  "commentaries": [
    {
      "number": 1,
      "text": {
        "cn": "初六：繫于金柅，貞吉，有攸往，見凶，羸豕孚蹢躅。",
        "en": "The first SIX, divided, shows how its subject should be kept (like a carriage) tied and fastened to a metal drag, in which case with firm correctness there will be good fortune. (But) if he move in any direction, evil will appear. He will be (like) a lean pig, which is sure to keep jumping about."
      },
      "xiangZhuan": {
        "cn": "繫于金柅，柔道牽也。",
        "en": "'Tied and fastened to a metal drag:' - (this describes the arrest of) the weak (line) in its advancing course."
      }
    },
    {
      "number": 2,
      "text": {
        "cn": "九二：包有魚，无咎，不利賓。",
        "en": "The second NINE, undivided, shows its subject with a wallet of fish. There will be no error. But it will not be well to let (the subject of the first line) go forward to the guests."
      },
      "xiangZhuan": {
        "cn": "包有魚，義不及賓也。",
        "en": "'He has a wallet of fish:' - it is right for him not to allow (the subject of the first line) to get to the guests."
      }
    },
    {
      "number": 3,
      "text": {
        "cn": "九三：臀无膚，其行次且，厲，无大咎。",
        "en": "The third NINE, undivided, shows one from whose buttocks the skin has been stripped so that he walks with difficulty. The position is perilous, but there will be no great error."
      },
      "xiangZhuan": {
        "cn": "其行次且，行未牽也。",
        "en": "'He walks with difficulty:' - but his steps have not yet been drawn (into the course of the first line)."
      }
    },
    {
      "number": 4,
      "text": {
        "cn": "九四：包无魚，起凶。",
        "en": "The fourth NINE, undivided, shows its subject with his wallet, but no fish in it. This will give rise to evil."
      },
      "xiangZhuan": {
        "cn": "无魚之凶，遠民也。",
        "en": "'The evil' indicated by there being 'no fish in the wallet' is owing to (the subject of the line) keeping himself aloof from the people."
      }
    },
    {
      "number": 5,
      "text": {
        "cn": "九五：以杞包瓜，含章，有隕自天。",
        "en": "The fifth NINE, undivided, (shows its subject as) a medlar tree overspreading the gourd (beneath it). If he keep his brilliant qualities concealed, (a good issue) will descend (as) from Heaven."
      },
      "xiangZhuan": {
        "cn": "九五含章，中正也。有隕自天，志不舍命也。",
        "en": "'The subject of the fifth NINE, (undivided), keeps his brilliant qualities concealed:' - as is indicated by his central and correct position. '(The good issue) descends (as) from Heaven: - 'his aim does not neglect the ordinances (of Heaven)."
      }
    },
    {
      "number": 6,
      "text": {
        "cn": "上九：姤其角，吝，无咎。",
        "en": "The sixth NINE, undivided, shows its subject receiving others on his horns. There will be occasion for regret, but there will be no error."
      },
      "xiangZhuan": {
        "cn": "姤其角，上窮吝也。",
        "en": "'He receives others on his horns:' - he is exhausted at his greatest height, and there will be cause for regret."
      }
    }
  ]
}
