{
  "name": "䷺",
  "text": {
    "cn": "渙：亨。王假有廟，利涉大川，利貞。",
    "en": "Huan intimates that (under its conditions) there will be progress and success. The king goes to his ancestral temple; and it will be advantageous to cross the great stream. It will be advantageous to be firm and correct."
  },
  "tuanZhuan": {
    "cn": "渙，亨。剛來而不窮，柔得位乎外而上同。王假有廟，王乃在中也。利涉大川，乘木有功也。",
    "en": "'Huan intimates that there will be progress and success:' - (we see) the strong line (in the second place) of the lower trigram, and not suffering any extinction there; and (also) the weak line occupying its place in the outer trigram, and uniting (its action) with that of the line above. 'The king goes to his ancestral temple:' - the king's (mind) is without any deflection. 'It will be advantageous to cross the great stream:' - (the subject of the hexagram) rides in (a vessel of) wood (over water), and will do so with success."
  },
  "xiangZhuan": {
    "cn": "風行水上，渙；先王以享于帝立廟。",
    "en": "(The trigram representing) water and that for wind moving above the water form Huan. The ancient kings, in accordance with this, presented offerings to God and established the ancestral temple."
  },
  "commentaries": [
    {
      "number": 1,
      "text": {
        "cn": "初六：用拯馬壯，吉。",
        "en": "The first SIX, divided, shows its subject engaged in rescuing (from the impending evil) and having (the assistance of) a strong horse. There will be good fortune."
      },
      "xiangZhuan": {
        "cn": "初六之吉，順也。",
        "en": "'The good fortune attached to the first six, divided),'is due to the natural course (pursued by its subject)."
      }
    },
    {
      "number": 2,
      "text": {
        "cn": "九二：渙奔其机，悔亡。",
        "en": "The second NINE, undivided, shows its subject, amid the dispersion, hurrying to his contrivance (for security). All occasion for repentance will disappear."
      },
      "xiangZhuan": {
        "cn": "渙奔其机，得愿也。",
        "en": "'Amidst the prevailing dispersion, he hurries to his contrivance (for security):' - he gets what he desires."
      }
    },
    {
      "number": 3,
      "text": {
        "cn": "六三：渙其躬，无悔。",
        "en": "The third SIX, divided, shows its subject discarding any regard to his own person. There will be no occasion for repentance."
      },
      "xiangZhuan": {
        "cn": "渙其躬，志在外也。",
        "en": "'He has no regard to his own person:' - his aim is directed to what is external to himself."
      }
    },
    {
      "number": 4,
      "text": {
        "cn": "六四：渙其群，元吉。渙有丘，匪夷所思。",
        "en": "The fourth SIX, divided, shows its subject scattering the (different) parties (in the state); which leads to great good fortune. From the dispersion (he collects again good men standing out, a crowd) like a mound, which is what ordinary men would not have thought of."
      },
      "xiangZhuan": {
        "cn": "渙其群，元吉；光大也。",
        "en": "'He scatters the (different) parties (in the state), and there is great good fortune:' - brilliant and great (are his virtue and service)."
      }
    },
    {
      "number": 5,
      "text": {
        "cn": "九五：渙汗其大號，渙王居，无咎。",
        "en": "The fifth NINE, undivided, shows its subject amidst the dispersion issuing his great announcements as the perspiration (flows from his body). He scatters abroad (also) the accumulations in the royal granaries. There will be no error."
      },
      "xiangZhuan": {
        "cn": "王居无咎，正位也。",
        "en": "'The accumulations of the royal (granaries) are dispersed, and there is no error:' - this is due to the correctness of the position."
      }
    },
    {
      "number": 6,
      "text": {
        "cn": "上九：渙其血，去逖出，无咎。",
        "en": "The topmost NINE, undivided, shows its subject disposing of (what may be called) its bloody wounds, and going and separating himself from its anxious fears. There will be no error."
      },
      "xiangZhuan": {
        "cn": "渙其血，遠害也。",
        "en": "'His bloody wounds are gone:' - he is far removed from the danger of injury."
      }
    }
  ]
}
