{
  "name": "䷾",
  "text": {
    "cn": "既濟：亨，小利貞，初吉終亂。",
    "en": "Ji Ji intimates progress and success in small matters. There will be advantage in being firm and correct. There has been good fortune in the beginning; there may be disorder in the end."
  },
  "tuanZhuan": {
    "cn": "既濟，亨，小者亨也。利貞，剛柔正而位當也。初吉，柔得中也。終止則亂，其道窮也。",
    "en": "'Ji Ji intimates progress and success:' - in small matters, that is, there will be that progress and success. 'There will be advantage in being firm and correct:' - the strong and weak (lines) are correctly arranged, each in its appropriate place. 'There has been good fortune in the beginning: - the weak (second line) is in the centre. 'In the end' there is a cessation (of effort), and 'disorder arises:' - the course (that led to rule and order) is (now) exhausted."
  },
  "xiangZhuan": {
    "cn": "水在火上，既濟；君子以思患而預防之。",
    "en": "(The trigram representing) fire and that for water above it form Ji Ji. The superior man, in accordance with this, thinks of evil (that may come), and beforehand guards against it."
  },
  "commentaries": [
    {
      "number": 1,
      "text": {
        "cn": "初九：曳其輪，濡其尾，无咎。",
        "en": "The first NINE, undivided, (shows its subject as a driver) who drags back his wheel, (or as a fox) which has wet his tail. There will be no error."
      },
      "xiangZhuan": {
        "cn": "曳其輪，義无咎也。",
        "en": "'He drags back his wheel:' - as we may rightly judge, there will be no mistake."
      }
    },
    {
      "number": 2,
      "text": {
        "cn": "六二：婦喪其茀，勿逐，七日得。",
        "en": "The second SIX, divided, (shows its subject as) a wife who has lost her (carriage-)screen. There is no occasion to go in pursuit of it. In seven days she will find it."
      },
      "xiangZhuan": {
        "cn": "七日得，以中道也。",
        "en": "'In seven days she will find it:' - for the course pursued is that indicated by the central position (of the line)."
      }
    },
    {
      "number": 3,
      "text": {
        "cn": "九三：高宗伐鬼方，三年克之，小人勿用。",
        "en": "The third NINE, undivided, (suggests the case of) K?o ?ung, who attacked the Demon region, but was three years in subduing it. Small men should not be employed (in such enterprises)."
      },
      "xiangZhuan": {
        "cn": "三年克之，憊也。",
        "en": "'He was three years in subduing it:' - enough to make him weary."
      }
    },
    {
      "number": 4,
      "text": {
        "cn": "六四：繻有衣袽，終日戒。",
        "en": "The fourth SIX, divided, shows its subject with rags provided against any leak (in his boat), and on his guard all day long."
      },
      "xiangZhuan": {
        "cn": "終日戒，有所疑也。",
        "en": "'He is on his guard all the day:' - he is in doubt about something."
      }
    },
    {
      "number": 5,
      "text": {
        "cn": "九五：東鄰殺牛，不如西鄰之禴祭，實受其福。",
        "en": "The fifth NINE, undivided, shows its subject (as) the neighbour in the east who slaughters an ox (for his sacrifice); but this is not equal to the (small) spring sacrifice of the neighbour in the west, whose sincerity receives the blessing."
      },
      "xiangZhuan": {
        "cn": "東鄰殺牛，不如西鄰之時也；實受其福，吉大來也。",
        "en": "'The slaughtering of an ox by the neighbour in the east is not equal to (the small sacrifice of) the neighbour in the west:' - because the time (in the latter case is more important and fit). 'His sincerity receives the blessing:' - good fortune comes on a great scale."
      }
    },
    {
      "number": 6,
      "text": {
        "cn": "上六：濡其首，厲。",
        "en": "The topmost SIX, divided, shows its subject with (even) his head immersed. The position is perilous."
      },
      "xiangZhuan": {
        "cn": "濡其首厲，何可久也。",
        "en": "'His head is immersed; the position is perilous:' - how could such a state continue long?"
      }
    }
  ]
}