{
  "name": "䷢",
  "text": {
    "cn": "晉：康侯用錫馬蕃庶，晝日三接。",
    "en": "In Jin we see a prince who secures the tranquillity (of the people) presented on that account with numerous horses (by the king), and three times in a day received at interviews."
  },
  "tuanZhuan": {
    "cn": "晉，進也。明出地上，順而麗乎大明，柔進而上行。是以康侯用錫馬蕃庶，晝日三接也。",
    "en": "Jin denotes advancing. (In Jin we have) the bright (sun) appearing above the earth; (the symbol of) docile submission cleaving to that of the Great brightness; and the weak line advanced and moving above: - all these things give us the idea of 'a prince who secures the tranquillity (of the people), presented on that account with numerous horses (by the king), and three times in a day received at interviews.'"
  },
  "xiangZhuan": {
    "cn": "明出地上，晉；君子以自昭明德。",
    "en": "(The trigram representing) the earth and that for the bright (sun) coming forth above it form Jin. The superior man, according to this, gives himself to make more brilliant his bright virtue."
  },
  "commentaries": [
    {
      "number": 1,
      "text": {
        "cn": "初六：晉如，摧如，貞吉。罔孚，裕无咎。",
        "en": "The first SIX, divided, shows one wishing to advance, and (at the same time) kept back. Let him be firm and correct, and there will be good fortune. If trust be not reposed in him, let him maintain a large and generous mind, and there will be no error."
      },
      "xiangZhuan": {
        "cn": "晉如，摧如；獨行正也。裕无咎；未受命也。",
        "en": "'He appears wishing to advance, but (at the same time) being kept back:' - all-alone he pursues the correct course. 'Let him maintain a large and generous mind, and there will be no error:' - he has not yet received an official charge."
      }
    },
    {
      "number": 2,
      "text": {
        "cn": "六二：晉如，愁如，貞吉。受茲介福，于其王母。",
        "en": "The second SIX, divided, shows its subject with the appearance of advancing, and yet of being sorrowful. If he be firm and correct, there will be good fortune. He will receive this great blessing from his grandmother."
      },
      "xiangZhuan": {
        "cn": "受玆介福，以中正也。",
        "en": "'He will receive this great blessing:' - for he is in the central place and the correct position for him."
      }
    },
    {
      "number": 3,
      "text": {
        "cn": "六三：眾允，悔亡。",
        "en": "The third SIX, divided, shows its subject trusted by all (around him). All occasion for repentance will disappear."
      },
      "xiangZhuan": {
        "cn": "眾允之，志上行也。",
        "en": "'All (around) trust him:' - their (common) aim is to move upwards and act."
      }
    },
    {
      "number": 4,
      "text": {
        "cn": "九四：晉如碩鼠，貞厲。",
        "en": "The fourth NINE, undivided, shows its subject with the appearance of advancing, but like a marmot. However firm and correct he may be, the position is one of peril."
      },
      "xiangZhuan": {
        "cn": "碩鼠貞厲，位不當也。",
        "en": "'(He advances like) a marmot. However firm and correct he may be, his position is one of peril:' - his place is not that appropriate for him."
      }
    },
    {
      "number": 5,
      "text": {
        "cn": "六五：悔亡，失得勿恤，往吉，无不利。",
        "en": "The fifth SIX, divided, shows how all occasion for repentance disappears (from its subject). (But) let him not concern himself about whether he shall fail or succeed. To advance will be fortunate, and in every way advantageous."
      },
      "xiangZhuan": {
        "cn": "失得勿恤，往有慶也。",
        "en": "'Let him not concern himself whether he fails or succeeds:' - his movement in advance will afford ground for congratulation."
      }
    },
    {
      "number": 6,
      "text": {
        "cn": "上九：晉其角，維用伐邑，厲吉无咎，貞吝。",
        "en": "The topmost NINE, undivided, shows one advancing his horns. But he only uses them to punish the (rebellious people of his own) city. The position is perilous, but there will be good fortune. (Yet) however firm and correct he may be, there will be occasion for regret."
      },
      "xiangZhuan": {
        "cn": "維用伐邑，道未光也。",
        "en": "'He uses his horns only to punish (the rebellious people of) his city:' - his course of procedure is not yet brilliant."
      }
    }
  ]
}