{
  "name": "䷒",
  "text": {
    "cn": "臨：元，亨，利，貞。至于八月有凶。",
    "en": "Lin (indicates that under the conditions supposed in it) there will be great progress and success, while it will be advantageous to be firmly correct. In the eighth month there will be evil."
  },
  "tuanZhuan": {
    "cn": "臨，剛浸而長。說而順，剛中而應，大亨以正，天之道也。至于八月有凶，消不久也。",
    "en": "In Lin (we see) the strong (lines) gradually increasing and advancing. (The lower trigram is the symbol of) being pleased, and (the upper of) being compliant. The strong (line) is in the central position, and is properly responded to. 'There is great progress and success, along with firm correctness:' - this is the way of Heaven. 'In the eighth month there will be evil:' - (the advancing power) will decay after no long time."
  },
  "xiangZhuan": {
    "cn": "澤上有地，臨；君子以教思无窮，容保民无疆。",
    "en": "(The trigram for) the waters of a marsh and that for the earth above it form Lin. The superior man, in accordance with this, has his purposes of instruction that are inexhaustible, and nourishes and supports the people without limit."
  },
  "commentaries": [
    {
      "number": 1,
      "text": {
        "cn": "初九：咸臨，貞吉。",
        "en": "The first NINE, undivided, shows its subject advancing in company (with the subject of the second line). Through his firm correctness there will be good fortune."
      },
      "xiangZhuan": {
        "cn": "咸臨貞吉，志行正也。",
        "en": "'The good fortune through the firm correctness of (the subject of the first line) advancing in company (with the subject of the second)' is due to his will being set on doing what is right."
      }
    },
    {
      "number": 2,
      "text": {
        "cn": "九二：咸臨，吉无不利。",
        "en": "The second NINE, undivided, shows its subject advancing in company (with the subject of the first line). There will be good fortune; (advancing) will be in every way advantageous."
      },
      "xiangZhuan": {
        "cn": "咸臨，吉无不利；未順命也。",
        "en": "'The good fortune and every possible advantage attending the advance (of the subject of the second line), in company (with the subject of the first),' arises from the fact that those (to whom the advance is made) are not yet obedient to the ordinances (of Heaven)."
      }
    },
    {
      "number": 3,
      "text": {
        "cn": "六三：甘臨，无攸利。既憂之，无咎。",
        "en": "The third SIX, divided, shows one well pleased (indeed) to advance, (but whose action) will be in no way advantageous. If he become anxious about it (however), there will be no error."
      },
      "xiangZhuan": {
        "cn": "甘臨，位不當也。既憂之，咎不長也。",
        "en": "'He (shows himself) well pleased to advance:' - his position is not that appropriate to him. 'If he become anxious, however, about his action,' his error will not be continued."
      }
    },
    {
      "number": 4,
      "text": {
        "cn": "六四：至臨，无咎。",
        "en": "The fourth SIX, divided, shows one advancing in the highest mode. There will be no error."
      },
      "xiangZhuan": {
        "cn": "至臨无咎，位當也。",
        "en": "'The freedom from error consequent on the advance in the highest mode' is due to the (various) appropriateness of the position."
      }
    },
    {
      "number": 5,
      "text": {
        "cn": "六五：知臨，大君之宜，吉。",
        "en": "The fifth SIX, divided, shows the advance of wisdom, such as befits the great ruler. There will be good fortune."
      },
      "xiangZhuan": {
        "cn": "大君之宜，行中之謂也。",
        "en": "'What befits the great ruler' means the pursuing the course of the due mean."
      }
    },
    {
      "number": 6,
      "text": {
        "cn": "上六：敦臨，吉无咎。",
        "en": "The sixth SIX, divided, shows the advance of honesty and generosity. There will be good fortune, and no error."
      },
      "xiangZhuan": {
        "cn": "敦臨之吉，志在內也。",
        "en": "'The good fortune consequent on the advance of honesty and generosity' is due to the will (of the subject of the line) being set on the subjects of (the first two lines of) the inner (trigram)."
      }
    }
  ]
}