{
  "name": "䷀",
  "text": {
    "cn": "乾：元亨，利貞。",
    "en": "Qian (represents) what is great and originating, penetrating, advantageous, correct and firm."
  },
  "tuanZhuan": {
    "cn": "大哉乾元，萬物資始，乃統天。雲行雨施，品物流形。大明始終，六位時成，時乘六龍以御天。乾道變化，各正性命，保合大和，乃利貞。首出庶物，萬國咸寧。",
    "en": "Vast is the 'great and originating (power)' indicated by Qian! All things owe to it their beginning: - it contains all the meaning belonging to (the name) heaven. The clouds move and the rain is distributed; the various things appear in their developed forms. (The sages) grandly understand (the connexion between) the end and the beginning, and how (the indications of) the six lines (in the hexagram) are accomplished, (each) in its season. (Accordingly) they mount (the carriage) drawn by those six dragons at the proper times, and drive through the sky. The method of Qian is to change and transform, so that everything obtains its correct nature as appointed (by the mind of Heaven); and (thereafter the conditions of) great harmony are preserved in union. The result is 'what is advantageous, and correct and firm. (The sage) appears aloft, high above all things, and the myriad states all enjoy repose."
  },
  "xiangZhuan": {
    "cn": "天行健，君子以自強不息。",
    "en": "Heaven, in its motion, (gives the idea of) strength. The superior man, in accordance with this, nerves himself to ceaseless activity."
  },
  "commentaries": [
    {
      "number": 1,
      "text": {
        "cn": "初九：潛龍，勿用。",
        "en": "In the first (or lowest) NINE, undivided, (we see its subject as) the dragon lying hid (in the deep). It is not the time for active doing."
      },
      "xiangZhuan": {
        "cn": "潛龍勿用，陽在下也。",
        "en": "'The dragon lies hid in the deep; - it is not the time for active doing:' - (this appears from) the strong and undivided line's being in the lowest place."
      }
    },
    {
      "number": 2,
      "text": {
        "cn": "九二：見龍在田，利見大人。",
        "en": "In the second NINE, undivided, (we see its subject as) the dragon appearing in the field. It will be advantageous to meet with the great man."
      },
      "xiangZhuan": {
        "cn": "見龍在田，德施普也。",
        "en": "'The dragon appears in the field:' - the diffusion of virtuous influence has been wide."
      }
    },
    {
      "number": 3,
      "text": {
        "cn": "九三：君子終日乾乾，夕惕若，厲，无咎。",
        "en": "In the third NINE, undivided, (we see its subject as) the superior man active and vigilant all the day, and in the evening still careful and apprehensive. (The position is) dangerous, but there will be no mistake."
      },
      "xiangZhuan": {
        "cn": "終日乾乾，反復道也。",
        "en": "'Active and vigilant all the day:' - (this refers to) the treading of the (proper) path over and over again."
      }
    },
    {
      "number": 4,
      "text": {
        "cn": "九四：或躍在淵，无咎。",
        "en": "In the fourth NINE, undivided, (we see its subject as the dragon looking) as if he were leaping up, but still in the deep. There will be no mistake."
      },
      "xiangZhuan": {
        "cn": "或躍在淵，進无咎也。",
        "en": "'He seems to be leaping up, but is still in the deep:' - if he advance, there will be no error."
      }
    },
    {
      "number": 5,
      "text": {
        "cn": "九五：飛龍在天，利見大人。",
        "en": "In the fifth NINE, undivided, (we see its subject as) the dragon on the wing in the sky. It will be advantageous to meet with the great man."
      },
      "xiangZhuan": {
        "cn": "飛龍在天，大人造也。",
        "en": "'The dragon is on the wing in the sky:' - the great man rouses himself to his work."
      }
    },
    {
      "number": 6,
      "text": {
        "cn": "上九：亢龍有悔。",
        "en": "In the sixth (or topmost) NINE, undivided, (we see its subject as) the dragon exceeding the proper limits. There will be occasion for repentance."
      },
      "xiangZhuan": {
        "cn": "亢龍有悔，盈不可久也。",
        "en": "'The dragon exceeds the proper limits; - there will be occasion for repentance:' - a state of fulness, that is, should not be indulged in long."
      }
    },
    {
      "number": 7,
      "text": {
        "cn": "用九：見群龍无首，吉。",
        "en": "(The lines of this hexagram are all strong and undivided, as appears from) the use of the number NINE. If the host of dragons (thus) appearing were to divest themselves of their heads, there would be good fortune."
      },
      "xiangZhuan": {
        "cn": "用九，天德不可為首也。",
        "en": "'The same NINE (undivided) is used' (in all the places of this hexagram), but the attribute of heaven (thereby denoted) should not (always) take the foremost place."
      }
    }
  ]
}