{
  "name": "䷎",
  "text": {
    "cn": "謙：亨，君子有終。",
    "en": "Qian indicates progress and success. The superior man, (being humble as it implies), will have a (good) issue (to his undertakings)."
  },
  "tuanZhuan": {
    "cn": "謙，亨，天道下濟而光明，地道卑而上行。天道虧盈而益謙，地道變盈而流謙，鬼神害盈而福謙，人道惡盈而好謙。謙尊而光，卑而不可踰，君子之終也。",
    "en": "Qian indicates progress and success. It is the way of heaven to send down its beneficial influences below, where they are brilliantly displayed. It is the way of earth, lying low, to send its influences upwards and (there) to act. It is the way of heaven to diminish the full and augment the humble. It is the way of earth to overthrow the full and replenish the humble. Spiritual Beings inflict calamity on the full and bless the humble. It is the way of men to hate the full and love the humble. Humility in a position of honour makes that still more brilliant; and in a low position men will not (seek to) pass beyond it. Thus it is that 'the superior man will have a (good) issue (to his undertakings).'"
  },
  "xiangZhuan": {
    "cn": "地中有山，謙；君子以裒多益寡，稱物平施。",
    "en": "(The trigram for) the earth and (that of) a mountain in the midst of it form Qian. The superior man, in accordance with this, diminishes what is excessive (in himself), and increases where there is any defect, bringing about an equality, according to the nature of the case, in his treatment (of himself and others)."
  },
  "commentaries": [
    {
      "number": 1,
      "text": {
        "cn": "初六：謙謙君子，用涉大川，吉。",
        "en": "The first SIX, divided, shows us the superior man who adds humility to humility. (Even) the great stream may be crossed with this, and there will be good fortune."
      },
      "xiangZhuan": {
        "cn": "謙謙君子，卑以自牧也。",
        "en": "'The superior man who adds humility to humility' is one who nourishes his (virtue) in lowliness."
      }
    },
    {
      "number": 2,
      "text": {
        "cn": "六二：鳴謙，貞吉。",
        "en": "The second SIX, divided, shows us humility that has made itself recognised. With firm correctness there will be good fortune."
      },
      "xiangZhuan": {
        "cn": "鳴謙貞吉，中心得也。",
        "en": "'The good fortune consequent on being firm and correct, where the humility has made itself recognised, is owing to the possessor's having (the virtue) in the core of his heart."
      }
    },
    {
      "number": 3,
      "text": {
        "cn": "九三：勞謙，君子有終，吉。",
        "en": "The third NINE, undivided, shows the superior man of (acknowledged) merit. He will maintain his success to the end, and have good fortune."
      },
      "xiangZhuan": {
        "cn": "勞謙君子，萬民服也。",
        "en": "'The superior man of (acknowledged) merit, and yet humble:' - the myriads of the people will submit to him."
      }
    },
    {
      "number": 4,
      "text": {
        "cn": "六四：无不利，撝謙。",
        "en": "The fourth SIX, divided, shows one, whose action would be in every way advantageous, stirring up (the more) his humility."
      },
      "xiangZhuan": {
        "cn": "无不利，撝謙；不違則也。",
        "en": "'One, whose action would be in every way advantageous, stirs up his humility the more:'(but in doing so) he does not act contrary to the (proper) rule."
      }
    },
    {
      "number": 5,
      "text": {
        "cn": "六五：不富，以其鄰，利用侵伐，无不利。",
        "en": "The fifth SIX, divided, shows one who, without being rich, is able to employ his neighbours. He may advantageously use the force of arms. All his movements will be advantageous."
      },
      "xiangZhuan": {
        "cn": "利用侵伐，征不服也。",
        "en": "'He may advantageously use the force of arms:' - correcting, that is, those who do not submit."
      }
    },
    {
      "number": 6,
      "text": {
        "cn": "上六：鳴謙，利用行師，征邑國。",
        "en": "The sixth SIX, divided, shows us humility that has made itself recognised. The subject of it will with advantage put his hosts in motion; but (he will only) punish his own towns and state."
      },
      "xiangZhuan": {
        "cn": "鳴謙，志未得也。可用行師，征邑國也。",
        "en": "'His humility has made itself recognised:' - (but) all his aims have not yet been attained. He may employ the force of arms, (but only) in correcting (his own) towns and state.'"
      }
    }
  ]
}