{
  "name": "䷅",
  "text": {
    "cn": "訟：有孚，窒。惕中吉。終凶。利見大人，不利涉大川。",
    "en": "Song intimates how, though there is sincerity in one's contention, he will yet meet with opposition and obstruction; but if he cherish an apprehensive caution, there will be good fortune, while, if he must prosecute the contention to the (bitter) end, there will be evil. It will be advantageous to see the great man; it will not be advantageous to cross the great stream."
  },
  "tuanZhuan": {
    "cn": "訟，上剛下險，險而健訟。訟有孚窒，惕中吉，剛來而得中也。終凶；訟不可成也。利見大人；尚中正也。不利涉大川；入于淵也。",
    "en": "The upper portion of Song is (the trigram representing) strength, and the lower (that representing) peril. (The coming together of) strength and peril gives (the idea in) Song. 'Song intimates how, though there is sincerity in one's contention, he will yet meet with opposition and obstruction; but if he cherish an apprehensive caution, there will be good fortune:' - a strong (line) has come and got the central place (in the lower trigram).'If he must prosecute the contention to the (bitter) end, there will be evil:' - contention is not a thing to be carried on to extremity. 'It will be advantageous to meet with the great man:' - what he sets a value on is the due mean, and the correct place. 'It will not be advantageous to cross the great stream:' - one (attempting to do so) would find himself in an abyss."
  },
  "xiangZhuan": {
    "cn": "天與水違行，訟；君子以作事謀始。",
    "en": "(The trigram representing) heaven and (that representing) water, moving away from each other, form Song. The superior man, in accordance with this, in the transaction of affairs takes good counsel about his first steps."
  },
  "commentaries": [
    {
      "number": 1,
      "text": {
        "cn": "初六：不永所事，小有言，終吉。",
        "en": "The first SIX, divided, shows its subject not perpetuating the matter about which (the contention is). He will suffer the small (injury) of being spoken against, but the end will be fortunate."
      },
      "xiangZhuan": {
        "cn": "不永所事，訟不可長也。雖有小言，其辯明也。",
        "en": "'He does not perpetuate the matter about which (the contention is):' - contention should not be prolonged. Although 'he may suffer the small (injury) of being spoken against,' his argument is clear."
      }
    },
    {
      "number": 2,
      "text": {
        "cn": "九二：不克訟，歸而逋，其邑人三百戶，无眚。",
        "en": "The second NINE, undivided, shows its subject unequal to the contention. If he retire and keep concealed (where) the inhabitants of his city are (only) three hundred families, he will fall into no mistake."
      },
      "xiangZhuan": {
        "cn": "不克訟，歸而逋也。自下訟上，患至掇也。",
        "en": "'He is unequal to the contention; he retires and keeps concealed, stealthily withdrawing from it:' - for him from his lower place to contend with (the stronger one) above, would be to (invite) calamity, as if he brought it with his hand to himself."
      }
    },
    {
      "number": 3,
      "text": {
        "cn": "六三：食舊德，貞厲，終吉，或從王事，无成。",
        "en": "The third SIX, divided, shows its subject keeping in the old place assigned for his support, and firmly correct. Perilous as the position is, there will be good fortune in the end. Should he perchance engage in the king's business, he will not (claim the merit of) achievement."
      },
      "xiangZhuan": {
        "cn": "食舊德，從上吉也。",
        "en": "'He confines himself to the support assigned to him of old:' - (thus) following those above him, he will have good fortune."
      }
    },
    {
      "number": 4,
      "text": {
        "cn": "九四：不克訟，復即命渝，安貞吉。",
        "en": "The fourth NINE, undivided, shows its subject unequal to the contention. He returns to (the study of Heaven's) ordinances, changes (his wish to contend), and rests in being firm and correct. There will be good fortune."
      },
      "xiangZhuan": {
        "cn": "復即命，渝安貞；不失也。",
        "en": "'He returns to (the study of Heaven's) ordinances, changes (his wish to contend), and rests in being firm and correct:' - he does not fail (in doing what is right)."
      }
    },
    {
      "number": 5,
      "text": {
        "cn": "九五：訟元吉。",
        "en": "S. The fifth NINE, undivided, shows its subject contending - and with great good fortune."
      },
      "xiangZhuan": {
        "cn": "訟元吉，以中正也。",
        "en": "'He contends; - and 'with great fortune: - this is shown by his holding the due mean and being in the correct place."
      }
    },
    {
      "number": 6,
      "text": {
        "cn": "上九：或錫之鞶帶，終朝三褫之。",
        "en": "The topmost NINE, undivided, shows how its subject may have the leathern belt conferred on him (by the sovereign), and thrice it shall be taken from him in a morning."
      },
      "xiangZhuan": {
        "cn": "以訟受服，亦不足敬也。",
        "en": "'He receives the robe through his contention:' - but still be is not deserving of respect."
      }
    }
  ]
}
