{
  "name": "䷨",
  "text": {
    "cn": "損：有孚，元吉，无咎，可貞，利有攸往。曷之用，二簋可用享。",
    "en": "In (what is denoted by) Sun, if there be sincerity (in him who employs it), there will be great good fortune:--freedom from error; firmness and correctness that can be maintained; and advantage in every movement that shall be made. In what shall this (sincerity in the exercise of Sun) be employed? (Even) in sacrifice two baskets of grain, (though there be nothing else), may be presented."
  },
  "tuanZhuan": {
    "cn": "損，損下益上，其道上行。損而有孚，元吉，无咎，可貞，利有攸往。曷之用？二簋可用享；二簋應有時。損剛益柔有時，損益盈虛，與時偕行。",
    "en": "In Sun (we see) the lower (trigram) diminished, and the upper added to. (But) the method (of action) implied in this operates also above (or, mounts upwards (also) and operates). 'If there be sincerity in this method of diminution, there will be great good fortune; freedom from error; firmness and correctness that can be maintained; and advantage in every movement that shall be made. In what shall this (sincerity in the exercise of Sun) be employed? (Even) in sacrifice, two baskets of grain, (though there be nothing else), may be presented:' - for these two baskets there ought to be the fitting time. There is a time when the strong should be diminished, and the weak should be strengthened. Diminution and increase, overflowing and emptiness: -these take place in harmony with the conditions of the time."
  },
  "xiangZhuan": {
    "cn": "山下有澤，損；君子以懲忿窒欲。",
    "en": "(The trigram representing) a mountain and beneath it that for the waters of a marsh form Sun. The superior man, in accordance with this, restrains his wrath and represses his desires."
  },
  "commentaries": [
    {
      "number": 1,
      "text": {
        "cn": "初九：巳事遄往，无咎，酌損之。",
        "en": "The first NINE, undivided, shows its subject suspending his own affairs, and hurrying away (to help the subject of the fourth line). He will commit no error, but let him consider how far he should contribute of what is his (for the other)."
      },
      "xiangZhuan": {
        "cn": "巳事遄往，尚合志也。",
        "en": "'He suspends his own affairs and hurries away (to help the subject of the fourth line):' - the (subject of that) upper (line) mingles his wishes with his."
      }
    },
    {
      "number": 2,
      "text": {
        "cn": "九二：利貞，征凶，弗損，益之。",
        "en": "The second NINE, undivided, shows that it will be advantageous for its subject to maintain a firm correctness, and that action on his part will be evil. He can give increase (to his correlate) without taking from himself"
      },
      "xiangZhuan": {
        "cn": "九二利貞，中以為志也。",
        "en": "'It will be advantageous for (the subject of) the second NINE, (undivided), to maintain his firm correctness:' - his central position gives its character to his aim."
      }
    },
    {
      "number": 3,
      "text": {
        "cn": "六三：三人行，則損一人；一人行，則得其友。",
        "en": "The third SIX, divided, shows how of three men walking together, the number is diminished by one; and how one, walking, finds his friend."
      },
      "xiangZhuan": {
        "cn": "一人行，三則疑也。",
        "en": "'One man, walking,' (finds his friend): - when three are together, doubts rise among them."
      }
    },
    {
      "number": 4,
      "text": {
        "cn": "六四：損其疾，使遄有喜，无咎。",
        "en": "The fourth SIX, divided, shows its subject diminishing the ailment under which he labours by making (the subject of the first line) hasten (to his help), and make him glad. There will be no error."
      },
      "xiangZhuan": {
        "cn": "損其疾，亦可喜也。",
        "en": "'He diminishes the ailment under which he labours:' - this is matter for joy."
      }
    },
    {
      "number": 5,
      "text": {
        "cn": "六五：或益之，十朋之龜弗克違，元吉。",
        "en": "The fifth SIX, divided, shows parties adding to (the stores of) its subject ten pairs of tortoise shells, and accepting no refusal. There will be great good fortune."
      },
      "xiangZhuan": {
        "cn": "六五元吉，自上佑也。",
        "en": "'The great good fortune attached to the fifth six, (divided),' is due to the blessing from above."
      }
    },
    {
      "number": 6,
      "text": {
        "cn": "上九：弗損益之，无咎，貞吉，有攸往，得臣无家。",
        "en": "The topmost NINE, undivided, shows its subject giving increase to others without taking from himself. There will be no error. With firm correctness there will be good fortune. There will be advantage in every movement that shall be made. He will find ministers more than can be counted by their clans."
      },
      "xiangZhuan": {
        "cn": "弗損益之，大得志也。",
        "en": "'He gives increase to others without taking from what is his own:' - he obtains his wish on a grand scale."
      }
    }
  ]
}
