{
  "name": "䷌",
  "text": {
    "cn": "同人于野，亨。利涉大川，利君子貞。",
    "en": "Tong Ren (or 'Union of men') appears here (as we find it) in the (remote districts of the) country, indicating progress and success. It will be advantageous to cross the great stream. It will be advantageous to maintain the firm correctness of the superior man."
  },
  "tuanZhuan": {
    "cn": "同人，柔得位得中，而應乎乾，曰同人。同人曰，同人于野，亨。利涉大川，乾行也。文明以健，中正而應，君子正也。唯君子為能通天下之志。",
    "en": "In Tong Ren the weak (line) has the place (of influence), the central place, and responds to (the corresponding line in) Qian (above); hence comes its name of Tong Ren (or 'Union of men'). Tong Ren says: - The language, 'Tong Ren appears here (as we find it) in (the remote districts of) the country, indicating progress and success, and that it will be advantageous to cross the great stream,' is moulded by its containing the strength (symbolled) in Qian. (Then) we have (the trigram indicating) elegance and intelligence, supported by (that indicating) strength; with the line in the central, and its correct, position, and responding (to the corresponding line above): - (all representing) the correct course of the superior man. It is only the superior man who can comprehend and affect the minds of all under the sky."
  },
  "xiangZhuan": {
    "cn": "天與火，同人；君子以類族辨物。",
    "en": "(The trigrams for) heaven and fire form Tong Ren. The superior man, in accordance with this), distinguishes things according to their kinds and classes."
  },
  "commentaries": [
    {
      "number": 1,
      "text": {
        "cn": "初九：同人于門，无咎。",
        "en": "The first NINE, undivided, (shows the representative of) the union of men just issuing from his gate. There will be no error."
      },
      "xiangZhuan": {
        "cn": "出門同人，又誰咎也。",
        "en": "'(The representative of) the union of men is just issuing from his gate:' - who will blame him?"
      }
    },
    {
      "number": 2,
      "text": {
        "cn": "六二：同人于宗，吝。",
        "en": "The second SIX, divided, (shows the representative of) the union of men in relation with his kindred. There will be occasion for regret."
      },
      "xiangZhuan": {
        "cn": "同人于宗，吝道也。",
        "en": "'(The representative of) the union of men appears in relation with his kindred:' - that is the path to regret."
      }
    },
    {
      "number": 3,
      "text": {
        "cn": "九三：伏戎于莽，升其高陵，三歲不興。",
        "en": "The third NINE, undivided, (shows its subject) with his arms hidden in the thick grass, and at the top of a high mound. (But) for three years he makes no demonstration."
      },
      "xiangZhuan": {
        "cn": "伏戎于莽，敵剛也。三歲不興，安行也。",
        "en": "'He hides his arms in the thick grass:' - because of the strength of his opponent. 'For three years he makes no demonstration:' - how can he do anything?"
      }
    },
    {
      "number": 4,
      "text": {
        "cn": "九四：乘其墉，弗克攻，吉。",
        "en": "The fourth NINE, undivided, (shows its subject) mounted on the city wall; but he does not proceed to make the attack (he contemplates). There will be good fortune."
      },
      "xiangZhuan": {
        "cn": "乘其墉，義弗克也，其吉，則困而反則也。",
        "en": "'He is mounted on his city-wall;' but yielding to the right, 'he does not proceed to make the attack (he contemplated).' (Where it is said),'There will be good fortune,' (that shows how) he feels the strait he is in, and returns to the rule of law."
      }
    },
    {
      "number": 5,
      "text": {
        "cn": "九五：同人，先號咷而後笑。大師克相遇。",
        "en": "In the fifth NINE, undivided, (the representative of) the union of men first wails and cries out, and then laughs. His great host conquers, and he (and the subject of the second line) meet together."
      },
      "xiangZhuan": {
        "cn": "同人之先，以中直也。大師相遇，言相克也。",
        "en": "The first action of (the representative of) the union of men (here described) arises from his central position and straightforward character. 'The meeting secured by his great host' intimates that the opponents of it have been overcome."
      }
    },
    {
      "number": 6,
      "text": {
        "cn": "上九：同人于郊，无悔。",
        "en": "The topmost NINE, undivided, (shows the representative of) the union of men in the suburbs. There will be no occasion for repentance."
      },
      "xiangZhuan": {
        "cn": "同人于郊，志未得也。",
        "en": "'(The representative of) the union of men appears in the suburbs:' - his object has not yet been attained."
      }
    }
  ]
}