{
  "name": "䷘",
  "text": {
    "cn": "无妄：元亨，利貞。其匪正有眚，不利有攸往。",
    "en": "Wu Wang indicates great progress and success, while there will be advantage in being firm and correct. If (its subject and his action) be not correct, he will fall into errors, and it will not be advantageous for him to move in any direction."
  },
  "tuanZhuan": {
    "cn": "无妄，剛自外來，而為主於內。動而健，剛中而應，大亨以正，天之命也。其匪正有眚，不利有攸往。无妄之往，何之矣？天命不佑，行矣哉？",
    "en": "In Wu Wang we have the strong (first) line come from the outer (trigram), and become in the inner trigram lord (of the whole figure); we have (the attributes of) motive power and strength; we have the strong line (of the fifth place) in the central position, and responded to (by the weak second): - there will be 'great progress proceeding from correctness; such is the appointment of Heaven. 'If (its subject and his action) be not correct, he will fall into errors, and it will not be advantageous for him to move in any direction:' - whither can he (who thinks he is) free from all insincerity, (and yet is as here described) proceed? Can anything be done (advantageously) by him whom the (will and) appointment of Heaven do not help?"
  },
  "xiangZhuan": {
    "cn": "天下雷行，物與无妄；先王以茂對時，育萬物。",
    "en": "The thunder rolls all under the sky, and to (every)thing there is given (its nature), free from all insincerity. The ancient kings, in accordance with this, (made their regulations) in complete accordance with the seasons, thereby nourishing all things."
  },
  "commentaries": [
    {
      "number": 1,
      "text": {
        "cn": "初九：无妄，往吉。",
        "en": "The first NINE, undivided, shows its subject free from all insincerity. His advance will be accompanied with good fortune."
      },
      "xiangZhuan": {
        "cn": "无妄之往，得志也。",
        "en": "When 'he who is free from insincerity makes any movement,' he will get what he desires."
      }
    },
    {
      "number": 2,
      "text": {
        "cn": "六二：不耕獲，不菑畬，則利有攸往。",
        "en": "The second SIX, divided, shows one who reaps without having ploughed (that he might reap), and gathers the produce of his third year's fields without having cultivated them the first year for that end. To such a one there will be advantage in whatever direction he may move."
      },
      "xiangZhuan": {
        "cn": "不耕獲，未富也。",
        "en": "'He reaps without having ploughed:' - (the thought of) riches to be got had not risen (in his mind)."
      }
    },
    {
      "number": 3,
      "text": {
        "cn": "六三：无妄之災，或繫之牛，行人之得，邑人之災。",
        "en": "The third SIX, divided, shows calamity happening to one who is free from insincerity - as in the case of an ox that has been tied up. A passer by finds it (and carries it off), while the people in the neighbourhood have the calamity (of being accused and. apprehended)."
      },
      "xiangZhuan": {
        "cn": "行人得牛，邑人災也。",
        "en": "'The passer-by gets the ox:' - this proves a calamity to the people of the neighbourhood."
      }
    },
    {
      "number": 4,
      "text": {
        "cn": "九四：可貞，无咎。",
        "en": "The fourth NINE, undivided, shows (a case) in which, if its subject can remain firm and correct, there will be no error."
      },
      "xiangZhuan": {
        "cn": "可貞无咎，固有之也。",
        "en": "'If he can remain firm and correct there will be no error:' - he firmly holds fast (his correctness)."
      }
    },
    {
      "number": 5,
      "text": {
        "cn": "九五：无妄之疾，勿藥有喜。",
        "en": "The fifth NINE, undivided, shows one who is free from insincerity, and yet has fallen ill. Let him not use medicine, and he will have occasion for joy (in his recovery)."
      },
      "xiangZhuan": {
        "cn": "无妄之藥，不可試也。",
        "en": "'Medicine in the case of one who is free from insincerity!' - it should not be tried (at all)."
      }
    },
    {
      "number": 6,
      "text": {
        "cn": "上九：无妄，行有眚，无攸利。",
        "en": "The topmost NINE, undivided, shows its subject free from insincerity, yet sure to fall into error, if he take action. (His action) will not be advantageous in any way."
      },
      "xiangZhuan": {
        "cn": "无妄之行，窮之災也。",
        "en": "'The action (in this case) of one who is free from insincerity' will occasion the calamity arising from action (when the time for it is) exhausted."
      }
    }
  ]
}