{
  "name": "䷚",
  "text": {
    "cn": "頤：貞吉。觀頤，自求口實。",
    "en": "Yi indicates that with firm correctness there will be good fortune (in what is denoted by it). We must look at what we are seeking to nourish, and by the exercise of our thoughts seek for the proper aliment."
  },
  "tuanZhuan": {
    "cn": "頤貞吉，養正則吉也。觀頤，觀其所養也；自求口實，觀其自養也。天地養萬物，聖人養賢，以及萬民；頤之時大矣哉！",
    "en": "'Yi indicates that with firm correctness there will be good fortune:' - when the nourishing is correct, there will be good fortune. 'We must look at what we are seeking to nourish:' - we must look at those whom we wish to nourish. 'We must by the exercise of our thoughts seek the proper aliment:' - we must look to our own nourishing of ourselves. Heaven and earth nourish all things. The sages nourish men of talents and virtue, by them to reach to the myriads of the people. Great is (the work intended by this) nourishing in its time!"
  },
  "xiangZhuan": {
    "cn": "山下有雷，頤；君子以慎言語，節飲食。",
    "en": "(The trigram representing) a mountain and under it that for thunder form Yi. The superior man, in accordance with this, (enjoins) watchfulness over our words, and the temperate regulation of our eating and drinking."
  },
  "commentaries": [
    {
      "number": 1,
      "text": {
        "cn": "初九：舍爾靈龜，觀我朵頤，凶。",
        "en": "The first NINE, undivided, (seems to be thus addressed), 'You leave your efficacious tortoise, and look at me till your lower jaw hangs down.' There will be evil."
      },
      "xiangZhuan": {
        "cn": "觀我朵頤，亦不足貴也。",
        "en": "'You look at me till your (lower) jaw hangs down:' - (the subject of the line) is thus shown unfit to be thought noble."
      }
    },
    {
      "number": 2,
      "text": {
        "cn": "六二：顛頤，拂經，于丘頤，征凶。",
        "en": "The second SIX, divided, shows one looking downwards for nourishment, which is contrary to what is proper; or seeking it from the height (above), advance towards which will lead to evil."
      },
      "xiangZhuan": {
        "cn": "六二征凶，行失類也。",
        "en": "'The evil of advance by the subject of the second SIX, (divided),' is owing to his leaving in his movements his proper associates."
      }
    },
    {
      "number": 3,
      "text": {
        "cn": "六三：拂頤，貞凶，十年勿用，无攸利。",
        "en": "The third SIX, divided, shows one acting contrary to the method of nourishing. However firm he may be, there will be evil. For ten years let him not take any action, (for) it will not be in any way advantageous."
      },
      "xiangZhuan": {
        "cn": "十年勿用，道大悖也。",
        "en": "'For ten years let him not take any action:' - his course is greatly opposed (to what is right)."
      }
    },
    {
      "number": 4,
      "text": {
        "cn": "六四：顛頤，吉，虎視眈眈，其欲逐逐，无咎。",
        "en": "The fourth SIX, divided, shows one looking downwards for (the power to) nourish. There will be good fortune. Looking with a tiger's downward unwavering glare, and with his desire that impels him to spring after spring, he will fall into no error."
      },
      "xiangZhuan": {
        "cn": "顛頤之吉，上施光也。",
        "en": "'The good fortune attached to looking downwards for (the power to) nourish,' shows how brilliant will be the diffusion (of that power) from (the subject of the line's) superior position."
      }
    },
    {
      "number": 5,
      "text": {
        "cn": "六五：拂經，居貞吉，不可涉大川。",
        "en": "The fifth SIX, divided, shows one acting contrary to what is regular and proper; but if he abide in firmness, there will be good fortune. He should not, (however, try to) cross the great stream."
      },
      "xiangZhuan": {
        "cn": "居貞之吉，順以從上也。",
        "en": "'The good fortune from abiding in firmness' is due to the docility (of the subject of the line) in following (the subject of the line) above."
      }
    },
    {
      "number": 6,
      "text": {
        "cn": "上九：由頤，厲吉，利涉大川。",
        "en": "The sixth NINE, undivided, shows him from whom comes the nourishing. His position is perilous, but there will be good fortune. It will be advantageous to cross the great stream."
      },
      "xiangZhuan": {
        "cn": "由頤厲吉，大有慶也。",
        "en": "'The good fortune, notwithstanding the peril of his position, of him from whom comes the nourishing,' affords great cause for congratulation."
      }
    }
  ]
}
